[
    {
        "name": "Arts & Crafts Supplies Kits & Materials Set for Kids, Toddler - Carl & Kay",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/A1zjgYZSxsL._AC_UL400_.jpg",
            "description": "Arts & Crafts Supplies Kits & Materials Set for Kids, Toddler - Carl & Kay"
        },
        "totalReviews": 2348,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": true,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 14.97,
            "priceFraction": "97",
            "beforePrice": 21.99
        },
        "asin": "B07ZG6JY5J",
        "url": "https://www.amazon.com/dp/B07ZG6JY5J",
        "position": 4,
        "description": "Get creative with this all-inclusive arts and crafts supplies kit from Carl & Kay! This kit includes a huge assortment of craft materials, such as pipe cleaners, popsicle sticks, craft matchsticks, buttons, googly eyes, pom poms, feathers, foam sticker shapes, and sequins. Perfect for kids of all ages, this kit is easy to store and carry, and encourages creativity and problem-solving skills. Order with confidence with our 100% satisfaction guarantee!",
        "title": "Arts & Crafts Supplies Kit for Kids & Toddlers - Carl & Kay"
    },
    {
        "name": "Sundaymot Arts and Crafts Supplies for Kids, 2000+Pcs Craft Kits for Kids, DIY School Craft Project, Bulk Craft Set, Includes Art Supplies and Oxford Cloth Bag, Arts and Crafts for Kids Ages 8-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81f-53+ArXL._AC_UL400_.jpg",
            "description": "Sundaymot Arts and Crafts Supplies for Kids, 2000+Pcs Craft Kits for Kids, DIY School Craft Project, Bulk Craft Set, Inclu..."
        },
        "totalReviews": 3,
        "rating": 5.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 35.99,
            "priceFraction": "99",
            "beforePrice": 49.99
        },
        "asin": "B0C7ZPN57Y",
        "url": "https://www.amazon.com/dp/B0C7ZPN57Y",
        "position": 5,
        "description": "Unleash your child's creativity with this 2000+Pcs Craft Kit! This high-quality art and craft supplies set is perfect for kids aged 6-10. It includes a variety of art tools to encourage imaginative thinking and creative expression. The set includes a reusable canvas storage bag, making it easy to keep all the craft materials and tools organized and portable. It's suitable for various celebration occasions like New Year, birthdays, and Christmas. Make it a wonderful gift for kids and watch them love this art kit!",
        "title": "Arts and Crafts Supplies for Kids - 2000+Pcs Craft Kit"
    },
    {
        "name": "WAU CRAFTS Arts and Crafts Supplies for Kids - 1750 pcs Crafting for School Kindergarten Homeschool - Supplies Set for Kids Craft Art - Supply Kit for Toddlers and Kids Age 2 3 4 5 6 7 8 9",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81YKrnZNOTL._AC_UL400_.jpg",
            "description": "WAU CRAFTS Arts and Crafts Supplies for Kids - 1750 pcs Crafting for School Kindergarten Homeschool - Supplies Set for Kid..."
        },
        "totalReviews": 156,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 11.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B09X18RZ39",
        "url": "https://www.amazon.com/dp/B09X18RZ39",
        "position": 6,
        "description": "Unleash your kids' creativity with this 1750+ piece arts and crafts supplies set! Perfect for making pompom arts, this set includes Pom Poms, Pipe Cleaners, Feathers, Buttons, Googly Eyes, Foam Stickers, Popsicle Sticks and Match Sticks. Comes in a handy storage bag with all crafts packaged in their own reusable bags for easy cleanup. Perfect for kids of all ages! 100% satisfaction guarantee.",
        "title": "Arts and Crafts Supplies for Kids - 1750 pcs Crafting Set"
    },
    {
        "name": "FUNZBO Arts and Crafts Supplies for Kids - Kids Craft Kit with Art Supplies & Craft Supplies, Preschool Learning Activities, School Art Project, DIY Birthday Gifts, Crafts for Kids Age 4-6, 6-8, 8-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81rzg+ZjHIL._AC_UL400_.jpg",
            "description": "FUNZBO Arts and Crafts Supplies for Kids - Kids Craft Kit with Art Supplies & Craft Supplies, Preschool Learning Activitie..."
        },
        "totalReviews": 21940,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 21.98,
            "priceFraction": "98",
            "beforePrice": null
        },
        "asin": "B0C3H8CBNV",
        "url": "https://www.amazon.com/dp/B0C3H8CBNV",
        "position": 10,
        "description": "💕 Unleash your child's creativity with this all-in-one Arts and Crafts Supplies Kit for Kids! Perfect for DIY projects, school art projects, and creative play. Includes everything you need for hours of crafting fun. Reusable plastic jar for easy storage. 30-day warranty for full refund. Get your kids crafting today!",
        "title": "Arts and Crafts Supplies Kit for Kids - DIY Crafts and Projects for Ages 4-12"
    },
    {
        "name": "MIDUOLE Origami Paper, Pack of 500 Sheets - 20 Vivid Colors - Double Sided - 6 Inch Square, Easy Fold Paper for Kids Adult Beginners Training Arts & Crafts Projects.",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71NlNphp+XL._AC_UL400_.jpg",
            "description": "MIDUOLE Origami Paper, Pack of 500 Sheets - 20 Vivid Colors - Double Sided - 6 Inch Square, Easy Fold Paper for Kids Adult..."
        },
        "totalReviews": 18,
        "rating": 3.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BTLDD3SC",
        "url": "https://www.amazon.com/dp/B0BTLDD3SC",
        "position": 11,
        "description": "Get creative with this premium MIDUOLE Origami Paper! This pack includes 500 sheets of double-sided paper in 20 vivid colors, perfect for making traditional origami shapes. The paper is flexible and won't tear easily, and is durable and won't fade. Great for kids and adults alike, it's an excellent gift for children's day, birthdays, Christmas, and more! Stimulate your creativity and brain growth with this fun and rewarding hobby!",
        "title": "MIDUOLE Origami Paper - 20 Vivid Colors - 6 Inch Square"
    },
    {
        "name": "100Pcs Jumbo Wooden Craft Sticks Wooden Popsicle Craft Sticks Stick 6” Long x 3/4”Wide Treat Sticks Ice Pop Sticks for DIY Crafts，Home Art Projects, Classroom Art Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61eYJIB3zUL._AC_UL400_.jpg",
            "description": "100Pcs Jumbo Wooden Craft Sticks Wooden Popsicle Craft Sticks Stick 6” Long x 3/4”Wide Treat Sticks Ice Pop Sticks for DIY..."
        },
        "totalReviews": 2354,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 4.99,
            "priceFraction": "99",
            "beforePrice": 6.99
        },
        "asin": "B092CMPBPW",
        "url": "https://www.amazon.com/dp/B092CMPBPW",
        "position": 12,
        "description": "100Pcs Jumbo Wooden Craft Sticks made of high quality natural wood, smooth and straight with round edges and flat surface. Perfect for all your STEM educational activities, art projects, home decoration, party decorations, classroom activities, and building projects. Ideal for craft supplies, candle kit, sample bags, and popsicle bags. Great for making a wooden box, toy box, and wood house. Adults could use this for a waxing applicator as well.",
        "title": "100Pcs Jumbo Wooden Craft Sticks"
    },
    {
        "name": "Lifetop 120PCS Painting Rocks, DIY Rocks Flat & Smooth Kindness Rocks for Arts, Crafts, Decoration, Medium/Small/Tiny Rocks for Painting,Hand Picked for Painting Rocks…",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/717u+jRISGL._AC_UL400_.jpg",
            "description": "Lifetop 120PCS Painting Rocks, DIY Rocks Flat & Smooth Kindness Rocks for Arts, Crafts, Decoration, Medium/Small/Tiny Rock..."
        },
        "totalReviews": 3843,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 16.99,
            "priceFraction": "99",
            "beforePrice": 21.99
        },
        "asin": "B07MLQP58J",
        "position": 13,
        "url": "https://www.amazon.com/dp/B07MLQP58J",
        "description": "Create unique and beautiful art pieces with Lifetop 120PCS Painting Rocks. These flat and smooth stones are perfect for rock art, painting, gluing and other creative projects. Our rocks come in three sizes: medium, small and tiny, so you can choose the right size for your project. Great for kids and adults alike, these stones make fantastic gifts for family and friends. Package includes 120PCS Painting Rocks (12PCS Medium, 8PCS Small and 100PCS Tiny).",
        "title": "120PCS DIY Painting Rocks for Arts, Crafts and Decoration"
    },
    {
        "name": "WATINC 6Pcs Hand Puppet Making Kit for Kids Art Craft Felt Sock Puppet Toys Creative DIY Make Your Own Puppets Pompoms Wiggle Googly Eyes Storytelling Role Play Party Supplies Gift for Girls Boys",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91uvv2Ig5gL._AC_UL400_.jpg",
            "description": "WATINC 6Pcs Hand Puppet Making Kit for Kids Art Craft Felt Sock Puppet Toys Creative DIY Make Your Own Puppets Pompoms Wig..."
        },
        "totalReviews": 6022,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B081L8933P",
        "url": "https://www.amazon.com/dp/B081L8933P",
        "position": 14,
        "description": "Unleash your kid's creativity and imagination with this 6Pcs Hand Puppet Making Kit! This kit includes 6 colorful puppets, pompoms, googly eyes, felt decors, and a paper box - everything you need to create your own unique puppet. Perfect for indoor activities, storytelling role-play, parties, and educational toys. Let your kids explore their creativity and make their own puppet with their own imagination. A great gift idea for birthdays, Christmas, Halloween, and more!",
        "title": "6Pcs Hand Puppet Making Kit for Kids Art Craft Felt Sock Puppet Toys"
    },
    {
        "name": "JPSOR 600pcs Craft Gemstone Acrylic Flatback Rhinestones Jewels for Crafting Embellishments Gems, 6 Shapes, 6-13mm",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81jwGAjHOCL._AC_UL400_.jpg",
            "description": "JPSOR 600pcs Craft Gemstone Acrylic Flatback Rhinestones Jewels for Crafting Embellishments Gems, 6 Shapes, 6-13mm"
        },
        "totalReviews": 4068,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": 9.99
        },
        "asin": "B06XWWH3SR",
        "url": "https://www.amazon.com/dp/B06XWWH3SR",
        "position": 15,
        "description": "Add a touch of sparkle to your crafts with these 600pcs craft gemstone rhinestones! These jewels come in 6 different shapes and sizes, including heart-shaped, horse eye-shaped, pentagram, round, teardrop, and flower-shaped. They come in a variety of colors, such as red, yellow, green, blue, pink, rose red, transparent, purple, and sky blue. Made from high quality pressure materials, these rhinestones are perfect for making makeup, photo frames, vases, cell phones, greeting cards, gift decorations, and more. Please note that this artificial diamond is not sticky on the back, so you will need to provide your own glue. Keep away from children under 3 years old.",
        "title": "600pcs Craft Gemstone Rhinestones Jewels for Crafting Embellishments"
    },
    {
        "name": "Space Science Craft Kit Gift 6-in-1 | Arts Crafts Space Toy for Kids Ages 6-8 | Gifts for Boys and Girls Aged 6,7,8,9,10 Year Olds | Solar System Toys for Kids",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/711+0q46WLL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Space Science Craft Kit Gift 6-in-1 | Arts Crafts Space Toy for Kids Ages 6-8 | Gifts for Boys and Girls Ag..."
        },
        "totalReviews": 2127,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 24.99,
            "priceFraction": "99",
            "beforePrice": 29.99
        },
        "asin": "B07B7JJCM3",
        "url": "https://www.amazon.com/dp/B07B7JJCM3",
        "position": 16,
        "description": "Explore the wonders of space with this 6-in-1 Space Science Craft Kit! This STEM toy includes activities that allow kids to make their own Solar System Mobile, Constellation Streamer, Kaleidoscope, Rocket Science Experiment, and more. Perfect for inspiring imaginative play and learning practical skills, this space craft kit is designed by world renowned educational and learning experts. 100% Money Back Guarantee included.",
        "title": "6-in-1 Space Science Craft Kit | Arts & Crafts Toy for Kids Ages 6-8 | STEM Toys for Boys & Girls Aged 6-10 Year Olds"
    },
    {
        "name": "Caydo 200 PCS Pipe Cleaners Craft Supplies Multi-Color Chenille Stems for Art and Craft Projects Creative DIY Decorations (12inch x 6mm)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91QRd3kbzEL._AC_UL400_.jpg",
            "description": "Caydo 200 PCS Pipe Cleaners Craft Supplies Multi-Color Chenille Stems for Art and Craft Projects Creative DIY Decorations..."
        },
        "totalReviews": 559,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B09WV4JJRC",
        "url": "https://www.amazon.com/dp/B09WV4JJRC",
        "position": 18,
        "description": "Create unique art and craft projects with these 200 PCS Pipe Cleaners Craft Supplies. These multi-colored chenille stems are perfect for DIY decorations, toys, dolls, birthday cards and more. Made of wire and fiber, these pipe cleaners can be bent, twisted, curled or wrapped to most shapes. A great gift for parents, teachers, kids and hobbyists, these pipe cleaners are sure to bring life to your creations. Each pipe cleaner measures 12 inches long and 6mm in diameter.",
        "title": "200 PCS Pipe Cleaners Craft Supplies Multi-Color Chenille Stems"
    },
    {
        "name": "Caliart Acrylic Paint Set with 12 Brushes, 24 Colors (59ml, 2oz) Art Craft Paints Gifts for Artists Kids Beginners & Painters, Halloween Pumpkin Canvas Ceramic Rock Painting Kit Art Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81FS5fZNY4L._AC_UL400_.jpg",
            "description": "Caliart Acrylic Paint Set with 12 Brushes, 24 Colors (59ml, 2oz) Art Craft Paints Gifts for Artists Kids Beginners & Paint..."
        },
        "totalReviews": 16445,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 25.99,
            "priceFraction": "99",
            "beforePrice": 35.99
        },
        "asin": "B08BNNV3JY",
        "url": "https://www.amazon.com/dp/B08BNNV3JY",
        "position": 19,
        "description": "Unleash your creativity with this Caliart Acrylic Paint Set! This set includes 24 vibrant colors and 12 brushes so you can create beautiful works of art. The colors have a creamy consistency and high pigments that offer great covering power for large areas and fine details. The fast-dry formula allows you to layer additional coats or add other elements to your work right away. Suitable for most surfaces, including canvas, wood, rocks, stretched canvas, fabrics, stone, metal, plastic, ceramics, decorative wall, blackboard, paper, plaster and more. Certified safe and non-toxic, this paint set is perfect for professional artists, aspiring artists, painting lovers, students and kids.",
        "title": "Caliart Acrylic Paint Set with 24 Colors and 12 Brushes"
    },
    {
        "name": "24 Colors Acrylic Paint Pens, Paint Markers for Rock Painting, Fine Point Acrylic Pens Art Supplies for Canvas, Ceramic, Wood, Stone, Glass, DIY Craft",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Ux0PWyJUL._AC_UL400_.jpg",
            "description": "24 Colors Acrylic Paint Pens, Paint Markers for Rock Painting, Fine Point Acrylic Pens Art Supplies for Canvas, Ceramic, W..."
        },
        "totalReviews": 91,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.99,
            "priceFraction": "99",
            "beforePrice": 14.99
        },
        "asin": "B0BVZM5TS2",
        "url": "https://www.amazon.com/dp/B0BVZM5TS2",
        "position": 20,
        "description": "Create unique and vibrant art pieces with these 24 colors acrylic paint pens! Featuring a fine tip, these pens are perfect for creating intricate line work on a variety of surfaces, such as canvas, rocks, paper, glass, wood, mugs, plastic, fabric, stone, metal, ceramics, DIY easter eggs, Christmas ornament, and more. Made with water-based, non-toxic ink, these paint pens have no pungent odor and are safe for all ages. The ink also dries quickly and flows smoothly, allowing you to work on your project without worrying about smudging or smearing. An ideal gift for the creative DIY enthusiast, get these acrylic paint pens today and let your creativity run wild!",
        "title": "24 Colors Acrylic Paint Pens - Fine Point Art Supplies for DIY Crafts"
    },
    {
        "name": "Kid Made Modern Arts and Crafts Supply Library - Coloring Arts and Crafts Kit",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71gTgEhR0dL._AC_UL400_.jpg",
            "description": "Kid Made Modern Arts and Crafts Supply Library - Coloring Arts and Crafts Kit"
        },
        "totalReviews": 4675,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 32.99,
            "priceFraction": "99",
            "beforePrice": 39.99
        },
        "asin": "B07WSJVTR9",
        "url": "https://www.amazon.com/dp/B07WSJVTR9",
        "position": 21,
        "description": "Unleash your creativity with the Kid Made Modern Arts and Crafts Library! This set includes over 1,000 pieces to help you create your own craft projects and comes packaged in a reusable box for storage when not in use. Perfect for schools, homeschools, camps, and group projects, this kit helps to boost problem-solving and emotional health skills while encouraging creativity. Let the Kid Made Modern Deluxe Arts and Crafts Supply Collection be your cornerstone to any kid’s craft stash.",
        "title": "Kid Made Modern Arts and Crafts Supply Library"
    },
    {
        "name": "Dan&Darci Clay Jewelry Making Kit - Arts and Crafts Gifts for Girls Ages 8, 9, 10, 11 & 12 Teen Year Old - Fun DIY Girl Craft Gift Ideas for Creative Preteen Kids - Makes 3 Bracelets & 3 Necklaces",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81eE3T9ehEL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Dan&Darci Clay Jewelry Making Kit - Arts and Crafts Gifts for Girls Ages 8, 9, 10, 11 & 12 Teen Year Old - ..."
        },
        "totalReviews": 516,
        "rating": 4.45,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": 19.99
        },
        "asin": "B09GPW149N",
        "url": "https://www.amazon.com/dp/B09GPW149N",
        "position": 22,
        "description": "Unleash your creativity with this all-inclusive jewelry making kit! Create 6 designer clay jewelry pieces with the 10 colors of clay included, rolling pin, trimming tool, bracelet cord, 12 charms, 3 pendants, 99 crystal beads, 12 charm links, bead rod, 2 clay cutters, glue, and a comprehensive learning guide. Perfect for family projects, this kit fascinates children and provides a satisfying result. 100% satisfaction guaranteed.",
        "title": "Clay Jewelry Making Kit - Arts & Crafts Gift for Girls Ages 8-12"
    },
    {
        "name": "12 Wooden Birdhouses - Crafts for Girls and Boys - Kids Bulk Arts and Crafts Set - 12 DIY Unfinished Wood Birdhouse Kits, 12 Paint Strips, 12 Paintbrushes & Stickers for Children to Build & Paint",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71MkwUgpSiL._AC_UL400_.jpg",
            "description": "Sponsored Ad - 12 Wooden Birdhouses - Crafts for Girls and Boys - Kids Bulk Arts and Crafts Set - 12 DIY Unfinished Wood B..."
        },
        "totalReviews": 1708,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 37.99,
            "priceFraction": "99",
            "beforePrice": 41.99
        },
        "asin": "B08N32TC7X",
        "url": "https://www.amazon.com/dp/B08N32TC7X",
        "position": 23,
        "description": "Create your own birdhouse with this fun and educational craft set! The set includes 12 wooden birdhouses, 12 paint strips, 12 paintbrushes, and stickers for children to build and paint. Made of solid wood, these birdhouses are non-toxic and safe for even the littlest hands. Perfect for birthday parties, classrooms, or just a fun indoor activity for kids. Let your little ones explore their creativity and connect to nature with this complete craft kit!",
        "title": "12 Wooden Birdhouse Kits - Crafts for Girls and Boys - Paint and Decorate Your Own Birdhouses"
    },
    {
        "name": "Marbling Paint Art Kit, 18 Colors Water Marbling kit, Water Art Paint Set, Arts and Crafts for Girls & Boys Ages 6-12, Craft Kits Art Set for Activities",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81-NMnJ4O9L._AC_UL400_.jpg",
            "description": "Sponsored Ad - Marbling Paint Art Kit, 18 Colors Water Marbling kit, Water Art Paint Set, Arts and Crafts for Girls & Boys..."
        },
        "totalReviews": 278,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 27.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B08SC751LF",
        "url": "https://www.amazon.com/dp/B08SC751LF",
        "position": 24,
        "description": "Create beautiful marble art with this Water Marbling Paint Art Kit! Featuring 18 colors of paint, 36 drawing papers, 4 needles, 4 pipettes, 2 bags of carrageenan powder, 2 measuring spoons, 1 scraper, 1 tray, 1 empty bottle 250ml and 1 manual, this art kit makes it easy to create beautiful artwork in a new way. Layer paint, smear, drag and 'transfer' it onto the paper and let it dry for a stunning result. Perfect for family and friends, this art kit is a great way to spread imagination and hand-on ability!",
        "title": "Water Marbling Paint Art Kit - 18 Colors"
    },
    {
        "name": "DIY Wooden Magnets, 36 Wooden Art Craft for Kids, Art and Craft Supplies Party Birthday Gift Favors for Boys Girls Ages 4-8 8-12, Easter Crafts",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71+CIVYutLL._AC_UL400_.jpg",
            "description": "Sponsored Ad - DIY Wooden Magnets, 36 Wooden Art Craft for Kids, Art and Craft Supplies Party Birthday Gift Favors for Boy..."
        },
        "totalReviews": 743,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 15.99,
            "priceFraction": "99",
            "beforePrice": 19.99
        },
        "asin": "B09P3G1CN4",
        "url": "https://www.amazon.com/dp/B09P3G1CN4",
        "position": 25,
        "description": "Get creative with this Wooden Magnets Craft Kit for Kids! This set includes 36 wooden crafts, 12 colored pens, and 36 magnet stickers. Your kids can design their own wooden magnets and create their own wooden art with any color pens they want. This is an ideal birthday party gift idea and craft kit for kids ages 4-8. All materials are made from BPA-free natural stake wood and water-based non-toxic paint pens, so you can rest assured that it's safe for your kids to use. Have fun decorating your refrigerator with these wooden magnets!",
        "title": "Wooden Magnets Craft Kit for Kids - 36pcs Art & Craft Supplies Party Birthday Gift Favors"
    },
    {
        "name": "5400 Pcs 1 Inch Tissue Paper Squares, 36 Assorted Colored Tissue Paper for Crafts, Art Rainbow Tissue Paper Bulk for Art Projects, Collage, Suncatchers, Scrapbooking - Non Bleeding",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/715FNfwbODL._AC_UL400_.jpg",
            "description": "5400 Pcs 1 Inch Tissue Paper Squares, 36 Assorted Colored Tissue Paper for Crafts, Art Rainbow Tissue Paper Bulk for Art P..."
        },
        "totalReviews": 297,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.49,
            "priceFraction": "49",
            "beforePrice": 7.99
        },
        "asin": "B0B1ZYCJPG",
        "url": "https://www.amazon.com/dp/B0B1ZYCJPG",
        "position": 26,
        "description": "Create beautiful art projects with this set of 5400 pre-cut 1 Inch Tissue Paper Squares in 36 vibrant rainbow colors (including gold and silver). Perfect for DIY projects, scrapbooking, paper mache decorations, collages, journaling, Suncatchers, stained glass window effects, and other decoupage projects. Made of thin and soft 14gsm craft tissue paper, these tissue paper squares are non-bleeding and won't fade in water, making them easy to bend, cut, shape, crinkle, fold, and glue.",
        "title": "1 Inch Tissue Paper Squares - 36 Colored Bulk for Crafts & Art Projects"
    },
    {
        "name": "Dan&Darci Arts & Crafts Supplies Kit for Kids and Toddlers - with Storage Bin - Kid & Toddler Art & Craft Set Ages 3, 4, 5, 6, 7 & 8 Years Old - Crafting Materials Box Kits for School or Gift",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/911rmBidodL._AC_UL400_.jpg",
            "description": "Dan&Darci Arts & Crafts Supplies Kit for Kids and Toddlers - with Storage Bin - Kid & Toddler Art & Craft Set Ages 3, 4, ..."
        },
        "totalReviews": 272,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BM38X8J2",
        "url": "https://www.amazon.com/dp/B0BM38X8J2",
        "position": 27,
        "description": "Unleash your creativity with this complete arts and crafts supply kit for kids and toddlers! The kit includes over 500 pieces of art and craft supplies such as pipe cleaners, pom poms, pop sticks, googly eyes, sequins, spin pins, beads, felt strips, colored papers, rhinestones, feathers, scissors, glue, and a storage bin with dividers. Perfect for school projects, birthday gifts, or just for fun! 100% satisfaction guaranteed.",
        "title": "Arts & Crafts Supplies Kit for Kids & Toddlers - with Storage Bin"
    }
]