[
  {
    "title": "Business Notebook Office School Stationery Diary Book Agenda Organizer Memo Notepad",
    "path": "https://shopee.sg/INSTORE1-Business-Notebook-Office-School-Stationery-Diary-Book-Agenda-Organizer-Thickening-Memo-Notepad-i.397126376.21090465980",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcs-liudor8wtle741",
    "price": 705000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "This Business Notebook is perfect for taking notes, organizing, and planning. It has 128 sheets/256 pages of simple paper material, and comes in two sizes: 145x100mm and 179x127mm. It is perfect for students, office, and school use. It is also available in 4 colors. Get your own today!"
  },
  {
    "title": "European Vintage Code Book A5 Locked Notebook",
    "path": "https://shopee.sg/European-Vintage-Code-Book-A5-Locked-Notebook-Student-Diary-Handbook-Stationery-i.304229883.20855346011",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-p8v7lbm1oriv4d",
    "price": 1172000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 0,
    "description": "This European vintage code book is the perfect companion for students and professionals alike. With a beautiful imitation leather cover and rounded corners, this notebook is both stylish and durable. The notebook is bound with glue staple binding and comes with two ribbon bookmarks for easy marker finding. It has an A5 size format and contains 100 sheets/200 pages. Perfect for general use, schedule planning, and American excerpts. Available in two different packaging options: ordinary and gift box."
  },
  {
    "title": "A7 Business Notebook - 5 Color Stationery for Taking Notes and Journaling",
    "path": "https://shopee.sg/HUBERT-Business-Notebook-5-Color-Stationery-Taking-Notes-Journal-Book-Diary-Book-Agenda-Organizer-Memo-Notepad-i.457159071.18191040323",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdr-ljfu7mpwdow9dd",
    "price": 544000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Keep your notes organized with this A7 Business Notebook! The notebook is made of thick paper and comes with 40 sheets (80 pages). It features a simple design and comes in 5 colors. Perfect for students, office workers, and journalers who need to keep their notes organized. The size of the notebook is 145*105mm. Get your A7 Business Notebook today and take your notes in style!"
  },
  {
    "title": "Antique Thread-bound Sketchbook with Tassel",
    "path": "https://shopee.sg/JENNIFERDZ-Notebook-Antique-Creative-Retro-Thread-bound-Book-Tassel-Stationery-Sketchbook-Chinese-Style-Sketch-Blank-i.85948343.16484679480",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg3-lg44vgkcchtv64",
    "price": 608000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Add a touch of vintage to your stationery collection with this antique thread-bound sketchbook with a tassel. The notebook is made with 75-page GMS kraft paper and a 250g cover, perfect for sketching, journaling, and more. It features a unique Chinese style design, making it an eye-catching addition to your stationery collection. Get yours today!"
  },
  {
    "title": "Oil Painting Notebook Student Planner Organizer Notepad Diary Book Agenda",
    "path": "https://shopee.sg/HUBERT-Oil-Painting-Notebook-Stationery-Student-Weekly-Monthly-Planner-Diary-Book-Agenda-Organizer-Thickening-Memo-Notepad-i.457159071.18481920019",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg9-ljaq5v3wnke8bc",
    "price": 734000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Keep track of your tasks and plans with this stylish and practical Oil Painting Notebook. This notebook is made of high-quality paper, featuring 140*140mm size and a beautiful oil painting design. Perfect for taking notes, writing down tasks, and organizing your daily life. Ideal for students, office workers, and anyone who needs a reliable and stylish planner. Get this notebook and stay organized!"
  },
  {
    "title": "A5/B5 American 10-Hole Loose-Leaf Coil Notebook",
    "path": "https://shopee.sg/Peach-A5-B5-American-10-hole-loose-leaf-coil-book-Office-stationery-notebook-i.889055763.19389972742",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdh-li5xp6e92gks97",
    "price": 724000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Keep your notes organised in style with this A5/B5 American 10-Hole Loose-Leaf Coil Notebook! Available in two sizes (A5 and B5) and 8 different styles, this notebook contains 60 sheets (120 pages) of PP+Paper material. Get creative and start organising your notes today!"
  },
  {
    "title": "Cute Double-Sided Handbook Paper Storage Sticker Tape Illustrated Stationery",
    "path": "https://shopee.sg/Dianyuejia-A4A5-Release-Book-Cute-Double-Sided-Handbook-Paper-Storage-Sticker-Tape-Illustrated-Stationery-B02-i.601634327.22340165803",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-cnf410ascplv2b",
    "price": 810000,
    "location": "Taiwan",
    "rating": 0,
    "sold": 0,
    "description": "This cute double-sided handbook paper storage sticker tape illustrated stationery is perfect for organizing and storing your documents. It comes in two sizes, A4 and A5, with 40 sheets per book. The inner pages are made of double-sided release paper, with excellent paper quality, thick and durable. Its double wire ring binding allows it to be flipped 360°, making it convenient to use. Get yours today!"
  },
  {
    "title": "PVC Ocean Series Bookmark - Cartoon Animal Style",
    "path": "https://shopee.sg/MAYWI-Bookmarks-Gift-PVC-Ocean-Series-Creative-Stationery-Book-Markers-i.293608815.22049910175",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfn-ljuugrs7s2muc8",
    "price": 455000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Add a touch of fun to your reading experience with this colorful PVC Ocean Series Bookmark. Featuring a cartoon animal style, this bookmark is made from durable PVC material and measures about 10cm in length. Perfect for school, office, or home use, this bookmark is a great gift for any book lover."
  },
  {
    "title": "PVC Animal 3D Bookmark - Octopus, Turtle, Seal and Shark",
    "path": "https://shopee.sg/chunrong-Cartoon-Animal-3D-Bookmark-Reading-Book-Stationery-Student-School-Supplies-Gift-i.89889487.22275007494",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qveo-ljnukqpsdp6c31",
    "price": 730000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Add a touch of fun to your reading with these 3D bookmarks! Made of quality PVC material, these bookmarks come in the shape of a octopus, turtle, seal and shark and feature a three-dimensional design. Perfect for bookworms and book lovers, they make great gifts for birthdays, souvenirs and business gifts. Get your hands on these cute and useful stationery supplies today!"
  },
  {
    "title": "Genshin Impact Metal Bookmark",
    "path": "https://shopee.sg/YB3-Genshin-Impact-Bookmark-Creative-Book-Clip-Metal-Stationery-Cute-Cartoon-Wanderer-Xiao-Hutao-Office-Student-Supplie-i.322751424.21579740476",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve9-lgpvxd81sd7ef9",
    "price": 459000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 1,
    "description": "Add a unique touch to your reading experience with this Genshin Impact Metal Bookmark! This metal bookmark features a cute cartoon Wanderer Xiao Hutao design, and is perfect for any bookworm or office student. It measures 9x6cm and weighs 15g. Please note that due to the light, environment, camera, various effects, the picture may be slightly different from the real thing. Manual measurement will have an error of 1-3cm, please understand. Get yours today!"
  },
  {
    "title": "JIANWU 160 Pages First Love Series Mini Portable Pocket Book Notebook Creative DIY Journal Decor Stationery",
    "path": "https://shopee.sg/JIANWU-160-Pagesbook-Introduction-To-First-Love-Series-Mini-Portable-Pocket-Book-Notebook-Creative-DIY-Journal-Decor-Stationery-i.705065790.23249352584",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf6-ljmbjo8ece5wcf",
    "price": 313000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Keep your thoughts, dreams and ideas close with this JIANWU 160 Pages First Love Series Mini Portable Pocket Book Notebook. This notebook is perfect for creative DIY projects, journaling, and decorating. It features 160 pages of high quality paper and comes in a convenient pocket size. Perfect for taking notes on the go, this pocket book is a great addition to any stationery collection. Note: Due to the light and screen setting difference, the item's color may be slightly different from the pictures. Please allow slight dimension difference due to different manual measurement."
  },
  {
    "title": "English Homework Book Exercise Book A5B5 Stationery School Supplies",
    "path": "https://shopee.sg/notebook-English-homework-book-exercise-book-A5B5-stationery-school-supplies-primary-school-students-junior-high-school-i.407547812.21749143387",
    "image": "https://down-sg.img.susercontent.com/file/e5002057de682c56c28ca50b38162430",
    "price": 2600000,
    "location": "SG",
    "rating": 0,
    "sold": 0,
    "description": "Get your school year off to a great start with this set of English Homework Book Exercise Book A5B5 Stationery School Supplies! Perfect for primary and junior high school students, this set includes A5 English book, A5 language text, and A5 exercise book. Each book is made with high-quality materials and comes with a satisfaction guarantee. With this set, you can be sure that your child has all the tools they need for a successful school year."
  },
  {
    "title": "Cute Cartoon A5 Coil Notebook Spiral Book",
    "path": "https://shopee.sg/Cute-Cartoon-A5-Coil-Notebook-Spiral-Book-Kuromi-Cinnamoroll-Notebook-Journal-Diary-Book-Student-Stationery-i.457170532.22027350597",
    "image": "https://down-sg.img.susercontent.com/file/vn-11134201-23020-b1s8poifdunv53",
    "price": 400000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 1,
    "description": "Add a touch of cuteness to your stationery collection with this adorable A5 Coil Notebook Spiral Book! Featuring the ever-popular Kuromi and Cinnamoroll designs, this notebook is perfect for jotting down notes, doodles, and more. The notebook contains 60 sheets of paper and is made of durable, high-quality paper. Ideal for students and adults alike, get yours today!"
  },
  {
    "title": "Waterproof Stationery Book Protective Film Cover",
    "path": "https://shopee.sg/Stationery-book-protective-film-protective-cover-transparent-waterproof-A416K22K-environmental-protection-material-i.278742849.7457023877",
    "image": "https://down-sg.img.susercontent.com/file/171fb0fe24b08a911bb61e637f907c63",
    "price": 648000,
    "location": "Mainland China",
    "rating": 4.871559633027523,
    "sold": 2,
    "description": "Keep your stationery books safe and dry with this waterproof protective film cover. Available in A4, 16K, 18K, 22K and 35K sizes. High-quality environmental protection material ensures long-lasting use. Make sure to contact customer service if there are any issues after delivery. Get free gifts with purchase!"
  },
  {
    "title": "Luminous Night Flying Dragon Bookmark Label Maker Stationery",
    "path": "https://shopee.sg/TWO-1XLuminous-Night-Flying-dragon-Bookmark-Label-Read-Maker-Book-Stationery-SG-i.308453752.23572529582",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf7-liqrwawfda0w49",
    "price": 241000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "This high-quality bookmark label maker is perfect for any bookworm! Crafted from copper, it features a beautiful design of a night flying dragon. The bookmark measures 11.5 cm in length and is a great gift for your friends and family. Add a touch of sophistication to your reading experience with this stylish bookmark."
  },
  {
    "title": "A5 Thickened Loose-leaf Coil Notebook",
    "path": "https://shopee.sg/Steve-A5-Thickened-Loose-leaf-Coil-Notebook-Cute-Comics-Student-Workbook-Notepad-Jouranl-Book-School-Supplies-Stationery-i.327652618.22506448911",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-kaaerpwk83jv5d",
    "price": 842000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 0,
    "description": "This A5 Thickened Loose-leaf Coil Notebook is perfect for students, comics lovers, and journaling enthusiasts. It's made of high-quality paper that is perfect for writing and drawing. It has 60 pages of content paper and measures 142 x 205mm. Get this notebook and make your writing and drawing activities more fun and organized. Enjoy fast delivery and excellent customer service."
  },
  {
    "title": "Flower Series Stickers - PET Waterproof Plant Sticker DIY Scrapbook Decor",
    "path": "https://shopee.sg/2-Sheets-Flower-Series-Stickers-PET-Waterproof-Plant-Sticker-DIY-Scrapbook-Decoration-Material-Stationery-i.161916446.23345474072",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvef-lhzx0z1go1ym80",
    "price": 103000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 3,
    "description": "Add a touch of beauty to your craft projects with these Flower Series Stickers! Made of PET material, these waterproof plant stickers are perfect for scrapbooking and other DIY decoration projects. Each package contains 2 sheets of stickers in 8 different styles, with each sheet measuring 150x100mm. Get creative and make your projects stand out with these Flower Series Stickers!"
  },
  {
    "title": "Elegant Patterns Paper Bookmarks - 40pcs",
    "path": "https://shopee.sg/JENNIFERDZ-School-Elegant-Patterns-40-pcspack-Blank-Paper-Bookmark-Reading-DIY-Stationery-Novelty-Book-Mark-i.85948343.15701303878",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvez-lftmgfmrqoj907",
    "price": 401000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 4,
    "description": "Add a touch of elegance to your reading experience with these stylish paper bookmarks. Each pack contains 40 bookmarks, measuring 14cm x 5cm. Perfect for DIY stationery projects or as a novelty gift. Made from high quality paper for durability."
  },
  {
    "title": "Translucent Bookmark Read Accessories for Students",
    "path": "https://shopee.sg/JENNIFERDZSG-Translucent-Bookmark-Read-Accessories-Students-Stationery-Book-Page-Marker-Landscape-Decoration-Bookmark-INS-Style-Reading-Assistant-i.368313728.18982230931",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdw-ljllrpsmmdj2c0",
    "price": 217000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Enhance your reading experience with this set of 5 translucent bookmarks. Made of PVC, these bookmarks come in an attractive landscape aesthetic design and are perfect for school, home, and office use. With its INS style, these bookmarks are sure to add a touch of style to your books. Keep your place and add a touch of style to your reading experience with these bookmarks!"
  },
  {
    "title": "PVC Animal Ass Bookmarks - Cute Dog Cat Hamster Fox",
    "path": "https://shopee.sg/OhayaPVC-Cute-Dog-Cat-Hamster-Fox-Ass-Bookmarks-Reading-Gift-i.75218433.7309880743",
    "image": "https://down-sg.img.susercontent.com/file/a38aaa360d96a455b417e37b4c05a58c",
    "price": 238000,
    "location": "Mainland China",
    "rating": 4.807302231237323,
    "sold": 21,
    "description": "Add a touch of fun to your bookmarks with these cute animal ass bookmarks! Made from PVC material, these bookmarks come in 4 colors - A, B, C and D. Each bookmark measures 2*14.5cm in length. Ideal for reading gifts or as a decorative item in your library. Package includes 1 x bookmark. Please note that colors may vary due to differences in display."
  }
]
