[
    {
        "title": "Mini Bowl Imitation Foods Keychain Pocket Festival Gift",
        "path": "https://shopee.sg/FLASH-SALEMini-Bowl-Imitation-Foods-Keychain-Pocket-Festival-Food-Festival-Gift-Gourmet-Accessories-Pendant-on-Tongue-i.604798004.16588800061",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-pfm9mcaduajv71",
        "price": 783000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Add a touch of fun and whimsy to your look with this Mini Bowl Imitation Foods Keychain Pocket Festival Gift! Perfect for food festivals, gourmet accessories, or as a unique pocket pendant. Crafted from durable resin material, this keychain is sure to last you for many years to come. With its tongue-in-cheek design, this keychain is sure to be a hit with everyone. Shop now and get it delivered to your doorstep!"
    },
    {
        "title": "Fried Ants Snacks - Spicy Pepper Salt Gourmet Insects",
        "path": "https://shopee.sg/FREE-Gift-Fresh-Fried-Ants-Grasient-Instant-Snacks-Remove-Wings-Locusts-Spicy-Pepper-Salt-Snacks-Insect-Gourmet-Fresh-Spicy-Little-Crab-Ready-to-Eat-i.991621090.22071772490",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdc-lid37qgiuzjg71",
        "price": 2111000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy a unique and delicious snack with these Fried Ants Snacks! Made from freshly fried ants, these snacks are bursting with flavor and spiced with pepper and salt. Perfect as an instant snack or as a gourmet treat, these snacks are ready to eat and are sure to be a hit with family and friends."
    },
    {
        "title": "Nature's Gift Gourmet - Chicken and Duck Loaf Style Dog Food",
        "path": "https://shopee.sg/Natures-Gift-Gourmet-Chicken-and-Duck-Loaf-Style-100g-i.264125905.3361772867",
        "image": "https://down-sg.img.susercontent.com/file/9b1703b53a8171f66cf10dbd1dd023e5",
        "price": 165000,
        "location": "SG",
        "rating": 5,
        "sold": 8,
        "description": "100% Australian meat, essential nutrients, complete and balanced nutrition for everyday health. Made from delicious natural ingredients with added vitamins and minerals to keep your dog healthy and happy. No artificial preservatives, colours or flavours. Suitable for all life stages. 100g."
    },
    {
        "title": "Hokkaido Retort Food Range - Assorted Seafood Side Dish ",
        "path": "https://shopee.sg/Easy-side-dish-assorted-with-Hokkaido-Retort-Food-Range-Hot-Side-Side-Fish-Fish-Side-Best-Fish-Side-dish-Debus-Gourmet-Gourmet-Gourmet-Gourmet-Assorted-Disaster-Emergency-Emergency-Food-Presentation-Food-Gift-Present-Simple-side-dish-countermeasures-1-i.981990758.15198827492",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lh2r9jj0snc365",
        "price": 7074000,
        "location": "Japan",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy a delicious side dish with this assortment of seafood from Hokkaido. This set contains 12 retort pcs. of stewed vegetables and 1 can, featuring Sanma, Iwashi, Hokke, Saba, Scallops, Komai, simmered with miso, simmered with black vinegar, simmered with ginger, simmered with water, basil, butter, soy sauce, and red snow crab flakes. Vacuum-packed in a retort for long-term preservation, this product is produced and manufactured in Hokkaido and all fish are from Hokkaido. Enjoy the original flavor and nutrients of the fish with this product. Shelf life: 180 days from manufacture. Please store away from high temperatures and direct sunlight."
    },
    {
        "title": "Natural Gourmet Wet Dog Food - Chicken or Lamb",
        "path": "https://shopee.sg/Natures-Gift-Gourmet-Real-Chicken-Wet-Dog-FoodNatures-Gift-Gourmet-Succulent-Lamb-Loaf-Style-100G-i.955359148.22473238934",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvew-lj27ynai1w8jc9",
        "price": 649000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Give your canine companion the gift of natural nutrition with this delicious wet dog food from Nature's Gift! Made with 100% fresh Australian meat, this gourmet wet dog food is sure to please your pup's palate. With real ingredients and no artificial additives, your pup will be sure to enjoy this wholesome meal."
    },
    {
        "title": "Food Hamper Gift Set - Chocolates, Crispy Treats, Gourmet Snacks and More!",
        "path": "https://shopee.sg/Simply-Hamper-Food-Hamper-Gift-Set-Decadent-Chocolates-Crispy-Treats-Gourmet-Snacks-and-More-Perfect-for-gifts-i.1006175206.22245573652",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve7-li19i1y36p6o2c",
        "price": 11328000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Delight your loved ones with this decadent hamper filled with a selection of delicious chocolates, crispy treats, gourmet snacks and more! This hamper includes Excelcium Pralines BonBons De Chocolat, Cupido Hazelnut Chocolate Seashells, Forum Hamlet Finest Waffle Crisp, Swiss Miss Dark Chocolate Sensation Hot Cocoa, K.Harrodson Blueberry Butter Cookies, Bickfords Premium Soft Drink Australia - Lemon Lime and Sarsaparilla, Kettle Honey Dijion Potato Chips, Vochelle Hazelnuts Doypack and a beautiful Exquisite Tray Basket. Perfect for any special occasion!"
    },
    {
        "title": "Premium Handmade Gourmet Chocolate for Valentine's Day",
        "path": "https://shopee.sg/Premium-Hand-Made-Gourmet-Chocolate-for-Valentines-Day-gift-i.945554869.22721935736",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-5ztpr81175mv9a",
        "price": 5290000,
        "location": "Korea",
        "rating": 0,
        "sold": 0,
        "description": "🎁Celebrate Valentine's Day with premium handmade gourmet couverture chocolate!🎁"
    },
    {
        "title": "Gourmet Food Hamper Gift Set - Delicious Treats & Snacks in Exquisite Tray Box ",
        "path": "https://shopee.sg/Simply-Hamper-Food-Hamper-Gift-Sets-Gourmet-Treats-Delightful-Goodies-in-Exquisite-Tray-Box-Lavish-Treats-i.1006175206.23471074612",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvcv-li1f7v0yp7c50b",
        "price": 7296000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Delight your recipient with this exquisite hamper basket of gourmet goodies! Our carefully curated selection of sweet and savoury treats will keep them munching away happily! Enjoy a picnic-perfect or snackin’ good time with this delightful food hamper! "
    },
    {
        "title": "Yuanshen Hand-Made Paimon Desktop Decoration",
        "path": "https://shopee.sg/Yuanshen-Hand-Made-Paimon-Is-Not-Emergency-Food-Gourmet-Theme-Mystery-Box-Car-Desktop-Decoration-Peripheral-Gift-i.960225353.20282490457",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvel-lj29sapb7ngv29",
        "price": 349000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Place of Origin: Zhejiang Province. Product Type: Static. Main Material: Resin. Work Area: Mainland China. Our store specializes in marketing all kinds of life women's must-haves. The service tenet of our store is to serve with heart and treat people with sincerity. Model Toy#益智玩具#数学益智玩具#玩具绘本# available. Welcome customers to come and buy with confidence. If you have any questions when purchasing, please contact us. Our working hours are: 7:30-23:30. Please shop rationally and check the goods condition when you receive them."
    },
    {
        "title": "Yiduojia Black Gold Crispy Egg Yolk Crispy Snow Mei Niang Salted Egg Yolk Bread Gourmet Snacks",
        "path": "https://shopee.sg/FREE-GIFT22-PCs1-box-black-gold-crispy-egg-yolk-crispy-snow-Mei-Niang-salted-egg-yolk-bread-gourmet-snacks-i.813663925.23671806103",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg9-lie6kcod57jj03",
        "price": 1393000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy the delicious Yiduojia Black Gold Crispy Egg Yolk Crispy Snow Mei Niang Salted Egg Yolk Bread Gourmet Snacks! This snack is 100% new and contains 40g net content. It is produced in mainland China with a production date of June 22, 2023 and a shelf life of 120 days. Contains sugar. Please note that due to different monitors, there may be slight color differences and measurement discrepancies. All products cannot be returned or exchanged after being unpacked. Delivery time is 1-3 days and arrival time is 15-22 days."
    },
    {
        "title": "Gourmet Popular Ramen Dashi Noodles Set of 10",
        "path": "https://shopee.sg/Gift-Order-Gourmet-Popular-Ramen-Dashi-Noodles-Excellent-Seafood-Dashi-Meat-Dashi-Set-of-10-Comparing-Eating-NationwideDirect-From-Japan-i.950540424.19074641966",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-x55od3wb12nv3c",
        "price": 5840000,
        "location": "Japan",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy the refined taste of Gourmet Popular Ramen Dashi Noodles! This set of 10 comes with an excellent seafood and meat dashi for a delicious flavor. Boiling time is 4 and a half minutes. Noodles are made with flour from Hokkaido and aged and dried for 2 days for a chewy texture. Soup uses \"plenty\" of \"dashi\" made with domestic ingredients. Store at room temperature and avoid direct sunlight, high temperature and humidity. Delivery time may vary due to the effects of new infectious diseases."
    },
    {
        "title": "Halal Gourmet Hamper - Delicious Treats in Exquisite Tray Box",
        "path": "https://shopee.sg/Simply-Hamper-Halal-Food-Gift-Set-Gourmet-Treats-Delightful-Surprises-in-Exquisite-Tray-Box-Blissful-Greetings-i.1006175206.21389876495",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve3-li19i1y3axk55d",
        "price": 6336000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Delight your loved ones this festive season with this exquisite Halal Gourmet Hamper! This delightful gift set features a variety of nutritious and delicious treats, all beautifully presented in a tray box. Get ready to indulge in Bonz Cookie Crunchy Oat & Sesame, Julie’s Butter Waffles, Beryl’s Almond milk Chocolate, Cowhead Cappuccino Butter Cookies, Hausboom Sparkling Real Juice, Amazin’ Graze Chocolate Hazelnut, and Amazin Graze Mini Pandan Coconut Mixed Nuts. A perfect gift for any occasion!"
    },
    {
        "title": "Bibizan Baked Gluten Spicy Strips Snacks",
        "path": "https://shopee.sg/Bibizan-Baked-Gluten-Spicy-Strips-Bulk-Snacks-Satisfy-the-Appetite-for-Foodie-Gourmet-Gift-Bag-Recommended-Leisure-Food-i.990710345.22466344739",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcu-lg3mfhnvcl5ab1",
        "price": 2328000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy the delicious and spicy flavor of Bibizan Baked Gluten Spicy Strips Snacks. Perfect for foodies and gourmet gift bags, this bulk snack satisfies your appetite. Comes in bags with a shelf life of 270 days. Product Standard Number: GB 2711. Production License Number: SC12443062606462. Net Content: 201-500g."
    },
    {
        "title": "Luxury Ochazuke Set Gift - Seafood Gourmet Aya (Irodori)",
        "path": "https://shopee.sg/Luxury-Ochazuke-Set-Gift-Gift-Seafood-Gourmet-Aya-Irodori-4-meals-Shizuoka-Prefecture-Shimoda-Golden-Sin-Silver-Silver-Silver-Crab-Scallop-Expo-Chaya-PREMIUM-GIFTJAPAN-MADE-i.238337977.21871847648",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfn-lgivdowscuae6c",
        "price": 6728000,
        "location": "Japan",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy a luxurious and authentic ochazuke experience with this Ochazuke Set Gift! This set includes 4 servings of carefully selected ingredients including sea bream from Izu-Shimoda, served in bonito-scented dashi broth. A light cup of rice is placed on top of the ingredients and chazuke ingredients and poured in hot water for a delicious meal. No chemical seasonings, colourings or preservatives are used. Enjoy a genuine gift that is both visually appealing and healthy. Shipping with tracking number provided."
    },
    {
        "title": "500g Signature Chargrilled Honey Glazed Pork Bak Kwa",
        "path": "https://shopee.sg/BAYEAH-GOURMET-500g-Signature-Chargrilled-Bak-Kwa-CNY-Gift-Set-i.368417096.5373474810",
        "image": "https://down-sg.img.susercontent.com/file/898f17be15d9c323092b283f72b59960",
        "price": 5980000,
        "location": "SG",
        "rating": 4.633333333333334,
        "sold": 0,
        "description": "Enjoy the best of traditional flavors with Ba Yeah! Gourmet's Signature Chargrilled Honey Glazed Pork Bak Kwa. Carefully grilled over charcoal on slow fire for the subtle smoky aroma and juicy texture, each piece is marinated with a secret recipe with over 15 types of spices and seasoning. Imported from Brazil, this 500g Bak Kwa is perfectly wrapped in a vacuum pack to ensure high quality during shipping and preserve better for longer period. Perfect for a Chinese New Year gift or to enjoy with your family and friends."
    },
    {
        "title": "Spicy Crispy Guizhou Specialty Dry Fried Sesame Chili",
        "path": "https://shopee.sg/FREE-Gift-Spicy-Crispy-Guizhou-Specialty-Dry-Fried-Sesame-Chili-Shredded-Crispy-Chili-Fried-Snacks-Crispy-Spicy-Gourmet-Bottled-Chili-Crisp-Spicy-Little-Crab-Ready-to-Eat-i.991621090.20190113668",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve1-lid506qnerkd1f",
        "price": 1787000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Enjoy the flavorful and spicy taste of Guizhou Specialty Dry Fried Sesame Chili. This crispy and delicious snack is perfect for any occasion. The net content is 250g and the shelf life is 240 days. Place of origin is Zhejiang Province, Mainland China. Packaged in a convenient bag, this snack is ready to eat and perfect for sharing."
    },
    {
        "title": "Gourmet Food Hamper - Sweet Tooth",
        "path": "https://shopee.sg/Gourmet-Food-Hampers-Sweet-Tooth-AGH10-starfloristcomsg-i.269874280.16647482621",
        "image": "https://down-sg.img.susercontent.com/file/d57617ccfce8ea977f5db01f066feb60",
        "price": 10914000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Delight your loved ones with this delicious gourmet food hamper! This hamper includes Lindt Excellence Dark Chocolate, Toblerone Swiss Milk Chocolate with Honey Almond, The Belgian Coffee Truffines, SUISS Premium Swiss Cereal Snack - Chocolate Fantasy, and Ferrero Rocher Chocolate. Perfect for any special occasion! All items come with flower and packaging."
    },
    {
        "title": "Gourmet Food Hamper - Perfect Gift",
        "path": "https://shopee.sg/Gourmet-Food-Hampers-Party-starfloristcomsg-i.269874280.16147470817",
        "image": "https://down-sg.img.susercontent.com/file/30e6b7123ffff36a0b878dce97d77ebc",
        "price": 12005000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Spoil your recipient with an exquisite gourmet hamper! This gift basket includes Belgian Caffe Latte, Diana Premium Almond Milk Chocolate, Toblerone, Ferrero Rocher, and Swiss Delice Chocolate. Packaged with a cute bear, this hamper is sure to impress your recipient!"
    },
    {
        "title": "Gourmet Food Hamper Gift Set - Delicious Treats for Your Loved Ones!",
        "path": "https://shopee.sg/Simply-Hamper-Food-Hamper-Gift-Sets-Gourmet-Treats-Delights-for-Your-Little-One-Golden-Bon-Bon-AmazinGrace-Roya-i.1006175206.22971071962",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfi-li1gr1d3uvrm21",
        "price": 15168000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Treat your loved ones to a delicious gourmet food hamper gift set! This exquisite gift basket includes sweet and savoury snacks, crunchy almond nougats, pandan coconut nuts mix, sparkling grape juice, chocolate hazelnut cookie snack, tropical candies jar, lentil chips, assorted chocolate selection, dark chocolate sensation hot cocoa, raspberry butter cookies, and almond milk chocolate. Perfect for any special occasion or celebration! *Delivery in Singapore Only **Simply Hamper reserves the right to replace any item with another of equivalent value depending on availability."
    },
    {
        "title": "Gourmet Food Hamper - Sweet Tooth",
        "path": "https://shopee.sg/Gourmet-Food-Hampers-Sweet-Tooth-AGH10-starfloristcomsg-i.269874280.16647482621",
        "image": "https://down-sg.img.susercontent.com/file/d57617ccfce8ea977f5db01f066feb60",
        "price": 10914000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Treat your loved ones to a delicious gourmet food hamper! This gift basket includes Lindt Excellence Dark Chocolate, Toblerone Swiss Milk Chocolate with Honey Almond, The Belgian Coffee Truffines, SUISS Premium Swiss Cereal Snack, and Ferrero Rocher Chocolate. Perfect for any occasion, this hamper is sure to be a hit! Gift comes with complimentary packaging and message card."
    }
]