[
    {
        "name": "KINSPORY Art Supplies Case, 139 Pack Arts Crafts, Painting, Coloring, Drawing & Art Set with Sketch Pad, Deluxe Portable Double Layers Aluminum Snakeskin Style Gift Box for Kids Teens Adults (Blue)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91Hqps0sY6L._AC_UL400_.jpg",
            "description": "Sponsored Ad - KINSPORY Art Supplies Case, 139 Pack Arts Crafts, Painting, Coloring, Drawing & Art Set with Sketch Pad, De..."
        },
        "totalReviews": 1743,
        "rating": 4.75,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 29.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B085Y1X1NS",
        "url": "https://www.amazon.com/dp/B085Y1X1NS",
        "position": 3,
        "description": "★【Amazing Gift for Kids Girls Boys 5 6 7 8 9 10 11 12】This coloring art set is highly recommend to children above 4 years and wish to learn creative art work. Art supplies including sketch pad, watercolors markers, crayons, colorful pencils, oil pastels, pallets and paint pens for painting & drawing, child easy to grab his online art classes, brings out the creative genius, hide art kit in a drawer for holiday, birthday, Christmas gift when kids visit, also a nice and great school supplies.\n★【Budding & Prefession Artists Dream Come True】This painting drawing art set, 24 oil pastels, 28 colorful pencils, 20 watercolor markers, 24 paint tubes, 24 solid paints, 6 camouflage crayons, 2 petal palettes, 1 rectangle palette , 4 brushes, 2 eraser, 2 Sketch pencil, 1 sharpener, 1 sketch pad. The Art Supplies case with metal trim is a wonderful gift to artists of all ages, even an adult, as there's so much to work with and start to explore the different kinds of artistic work.\n★【Deluxe and Beautiful Art Supplies Suitcase】This arts & crafts kit packed in a gorgeous, sturdy aluminum art case, has two layers, impressive looking and lots of great colorings. The clasps and rectangular case makes art kit much easier to keep supplies organized. If you are taking a camping trip, take art kit along will be perfect. All your child will need is some water and sketch pads for hours of entertainment. The neat case makes the art set perfect for the back seat or a relative's home.\n★【Not Only Art Kit】It's an amazing art crafts! This drawing art set is pretty fancy, heavy duty with snakeskin style exterior, each side has a pull up part to reveal more drawing items underneath, lots of pre-sharpened colored pencils, watercolor cake, flower shaped palette; The second layers has markers, and pastel crayons. Perfect painting fun school supplies for teens, encourages kids to be creative and artsy. Art Supplies case can be reused once all the art sets are done with in many years.\n★【Sure to be a Hit】Made of eco-friendly materials, non-toxic, conforms to ASTM 963. All of the art supplies come inside a aluminum suitcase, looks cute and feels nice to touch. The case opens easily showcasing some art supplies, the arms extending up to show inside level with more pieces of the art set. A gift to budding Artists, boys, girls, teen, kids, children, grandchildren and nephew ages 5 to 12 for birthday, holiday, school, Christmas present, to yourself to just play around and relax."
    },
    {
        "name": "Arts & Crafts Supplies Kits & Materials Set for Kids, Toddler - Carl & Kay",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/A1zjgYZSxsL._AC_UL400_.jpg",
            "description": "Arts & Crafts Supplies Kits & Materials Set for Kids, Toddler - Carl & Kay"
        },
        "totalReviews": 2348,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": true,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 14.97,
            "priceFraction": "97",
            "beforePrice": 21.99
        },
        "asin": "B07ZG6JY5J",
        "url": "https://www.amazon.com/dp/B07ZG6JY5J",
        "position": 4,
        "description": "ALL INCLUSIVE CRAFT KIT: Looking for a fun one-stop, ready-for-anything craft supply bundle that covers all the basics? You found it!\nHUGE ASSORTMENT: Materials included are 100 pipe cleaners, 50 colorful popsicle sticks, 100 craft matchsticks, 50 buttons, 100 adhesive googly eyes, 150 assorted size pom poms, 100 craft feathers, 100 foam sticker shapes, and 1000 sequins. (Some items packed by weight—quantity is approx.)\nEASY TO STORE & CARRY: Clean up time is a breeze! Each craft item comes neatly packed in small zipper bags, all conveniently stored in a large zipper bag that allows your kids to store and transport them without any hassle. Take them on-the-go for car rides, camping, vacations, friend’s houses, after school and more!\nBRAIN BOOSTING FUN: Creativity promotes fine motor skills, problem-solving and even emotional wellness. Whether you need items for your classroom, daycare art center, prek science projects, elementary craft stations and beyond, we've got you covered!\n100% SATISFACTION GUARANTEE: If you’re not 100% satisfied with your Carl & Kay purchase, contact us and we'll make it right! Order risk-free today!"
    },
    {
        "name": "Sundaymot Arts and Crafts Supplies for Kids, 2000+Pcs Craft Kits for Kids, DIY School Craft Project, Bulk Craft Set, Includes Art Supplies and Oxford Cloth Bag, Arts and Crafts for Kids Ages 8-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81f-53+ArXL._AC_UL400_.jpg",
            "description": "Sundaymot Arts and Crafts Supplies for Kids, 2000+Pcs Craft Kits for Kids, DIY School Craft Project, Bulk Craft Set, Inclu..."
        },
        "totalReviews": 3,
        "rating": 5.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 35.99,
            "priceFraction": "99",
            "beforePrice": 49.99
        },
        "asin": "B0C7ZPN57Y",
        "url": "https://www.amazon.com/dp/B0C7ZPN57Y",
        "position": 5,
        "description": "Art Craft Supplies Set: DIY Jewelry Making Crafts Materials for Kids 6-10 - Includes Storage Bag, fuzzy sticks, craft sticks, pom poms, felt pieces, craft papers, star shapes, feathers, sequins, sheet of gemstone stickers, googly eyes, acrylic crafts guka sheet, chain, sheets oflaser stickers, beads, letter beads, craft stick, colorful craft sticks, wooden clips, Safetu Scissors, elastic thread, white glue, tweezers, nano stickers, skeins embroidery floss,\nUnleash Creativity： Our high-quality art and craft supplies set is perfect for kids aged 6-10. It's a versatile kit for DIY jewelry making and other crafts. An assortment of art tools that encourage imaginative thinking and creative expression. DIY crafts, room decor, jewelry making or school projects, it's the perfect art kit for any kid's craft of choice\nSafe and Durability: Made with top-quality materials, our art and craft supplies ensure safety and durability. We prioritize children Safe while promoting their growth and artistic exploration, It's a rewarding and enjoyable way for kids to engage in hands-on creativity.\nEasy to Carry and Store: The set includes a reusable canvas storage bag, making it easy to keep all the craft materials and tools organized and portable.\nPerfect Gift: This preschool art craft supplies set is a wonderful gift for kids. It's suitable for various celebration occasions like New Year, birthdays, and Christmas. Great craft kits for kids ages 4-6, art supplies for kids ages 5-9, art supplies for kids ages 7-12, craft supplies for kids.Give children the joy of creativity and watch them love this art kit"
    },
    {
        "name": "WAU CRAFTS Arts and Crafts Supplies for Kids - 1750 pcs Crafting for School Kindergarten Homeschool - Supplies Set for Kids Craft Art - Supply Kit for Toddlers and Kids Age 2 3 4 5 6 7 8 9",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81YKrnZNOTL._AC_UL400_.jpg",
            "description": "WAU CRAFTS Arts and Crafts Supplies for Kids - 1750 pcs Crafting for School Kindergarten Homeschool - Supplies Set for Kid..."
        },
        "totalReviews": 156,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 11.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B09X18RZ39",
        "url": "https://www.amazon.com/dp/B09X18RZ39",
        "position": 6,
        "description": "𝗟𝗔𝗥𝗚𝗘 𝗖𝗥𝗔𝗙𝗧 𝗦𝗘𝗧 - This 1750+ piece bag is full of Pom Poms, Pipe Cleaners, Feathers, Buttons, Googly Eyes, Foam Stickers, Popsicle Sticks and Match Sticks\n𝗟𝗢𝗔𝗗𝗦 𝗢𝗙 𝗙𝗨𝗡 - This art and craft supply kit has all that you need to keep kids of all ages busy with crafting projects. Perfect for making pompom arts,\n𝗥𝗘𝗨𝗦𝗘𝗔𝗕𝗟𝗘 𝗕𝗔𝗚 - This Craft Kit comes in a super handy storage bag with all crafts come packaged in their own reusable bags! Easy cleanup keeps everyone happy!\n𝗖𝗥𝗘𝗔𝗧𝗜𝗩𝗜𝗧𝗬 𝗠𝗘𝗘𝗧𝗦 𝗙𝗨𝗡! - Your kids creativity is sure to go wild with amazing possibilities for different crafting projects.\n𝗗𝗜𝗬 𝗖𝗥𝗔𝗙𝗧𝗦 - Let your creativity run riot with this fantastic kids arts and crafts set. The perfect arts and crafts for kids of all ages!\n100% SATISFACTION GUARANTEE: If you’re not 100% satisfied with your purchase, contact us and we'll make it right!"
    },
    {
        "name": "FUNZBO Arts and Crafts Supplies for Kids - Kids Craft Kit with Art Supplies & Craft Supplies, Preschool Learning Activities, School Art Project, DIY Birthday Gifts, Crafts for Kids Age 4-6, 6-8, 8-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81rzg+ZjHIL._AC_UL400_.jpg",
            "description": "FUNZBO Arts and Crafts Supplies for Kids - Kids Craft Kit with Art Supplies & Craft Supplies, Preschool Learning Activitie..."
        },
        "totalReviews": 21940,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 21.98,
            "priceFraction": "98",
            "beforePrice": null
        },
        "asin": "B0C3H8CBNV",
        "url": "https://www.amazon.com/dp/B0C3H8CBNV",
        "position": 10,
        "description": "💕【 UNLIMITED FUN 】 Have a blast for hours crafting DIY toys, room decorations, or school projects and so much more! Best kids craft supplies!\n💕【 ALL IN ONE COMBO 】 Get Creative, express your art, start crafting, everything you need is all in this arts and craft supplies kits for toddler activities.\n💕【EASY TO STORE】 Arts & Craft supplies set comes in a reusable plastic jar for easy, convenient, hassle-free storage! Best arts and crafts for kids ages 8-12\n💕【 ENDLESS CREATIVITY 】 Foster your child's creativity, let their imagination fly with all the Arts & Crafts that you could possibly create! Perfect 4 5 6 7 8 9 10 year old girl birthday gifts.\n💕【 30 DAYS WARRANTY 】 Full refund within 30 days upon purchase. Get your kids this arts and craft supplies today and experience the fun world of crafting"
    },
    {
        "name": "MIDUOLE Origami Paper, Pack of 500 Sheets - 20 Vivid Colors - Double Sided - 6 Inch Square, Easy Fold Paper for Kids Adult Beginners Training Arts & Crafts Projects.",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71NlNphp+XL._AC_UL400_.jpg",
            "description": "MIDUOLE Origami Paper, Pack of 500 Sheets - 20 Vivid Colors - Double Sided - 6 Inch Square, Easy Fold Paper for Kids Adult..."
        },
        "totalReviews": 18,
        "rating": 3.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BTLDD3SC",
        "url": "https://www.amazon.com/dp/B0BTLDD3SC",
        "position": 11,
        "description": "500 Sheets Divided to 20 Colors, Each Color with 25 Sheets. 20 Vivid Colors on Double-Sided. Dimension: 6 X 6 Inches, Perfect Origami Paper for Making Traditional Origami Shapes.\nAdopted of Premium High-Quality Material, Soft Edges and Eco-Friendly. The Paper is Flexible Enough to Not Tear Easily and Can Hold the Creases and Shape Well, Durable, and Not Easy to Fade.\nGreat Gift for Kids Who Enjoy Doing Crafts and Art Projects, As it Can Stimulate the Creativity and Brain Growth for Kids. A Classic Origami Game, Suitable for Children's Day Gift, Birthday Gift, Christmas Gift, Party Favors, Etc.\nEasy Enough for Beginner, Challenging Enough for the Accomplished Users. First Choose Your Colored Paper Create Your Desired Design. Express Yourself in Creative and Imaginative Ways with This Fun and Rewarding Hobby!\nGUARANTEE: Order with Confidence! In the off Chance That you're Not Completely Satisfied with your Purchase, Return It for a FULL REFUND! We are Always Available to Help Our Customers."
    },
    {
        "name": "100Pcs Jumbo Wooden Craft Sticks Wooden Popsicle Craft Sticks Stick 6” Long x 3/4”Wide Treat Sticks Ice Pop Sticks for DIY Crafts，Home Art Projects, Classroom Art Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61eYJIB3zUL._AC_UL400_.jpg",
            "description": "100Pcs Jumbo Wooden Craft Sticks Wooden Popsicle Craft Sticks Stick 6” Long x 3/4”Wide Treat Sticks Ice Pop Sticks for DIY..."
        },
        "totalReviews": 2354,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 4.99,
            "priceFraction": "99",
            "beforePrice": 6.99
        },
        "asin": "B092CMPBPW",
        "url": "https://www.amazon.com/dp/B092CMPBPW",
        "position": 12,
        "description": "Standard Sizes: 100 Pcs Jumbo Wooden Craft Sticks, The Jumbo craft sticks measure 6-inch x 3/4 inch\nMultifunctional Craft Sticks: Wooden craft sticks can be used in many ways such as craft supplies, candle kit, sample bags, popsicle bags, making a wooden box, toy box, and wood house. Adults could use this for a waxing applicator as well.\nApplicable Activities: Perfect for all your STEM educational activities. Design your own math craft stick manipulative. Teachers, parents, and kids will love using their own customize craft sticks to count, add, and subtract. Great for art projects, home decoration, party decorations, classroom activities, building projects.\nSpecial Material: Jumbo wooden sticks made of high quality natural wood,smooth and straight,the smooth round edges and the flat surface makes it easy to decorate,build,and create while keeping it safe for children."
    },
    {
        "name": "Lifetop 120PCS Painting Rocks, DIY Rocks Flat & Smooth Kindness Rocks for Arts, Crafts, Decoration, Medium/Small/Tiny Rocks for Painting,Hand Picked for Painting Rocks…",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/717u+jRISGL._AC_UL400_.jpg",
            "description": "Lifetop 120PCS Painting Rocks, DIY Rocks Flat & Smooth Kindness Rocks for Arts, Crafts, Decoration, Medium/Small/Tiny Rock..."
        },
        "totalReviews": 3843,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 16.99,
            "priceFraction": "99",
            "beforePrice": 21.99
        },
        "asin": "B07MLQP58J",
        "position": 13,
        "url": "https://www.amazon.com/dp/B07MLQP58J",
        "description": "【 Great Rocks 】 -100% Lifetop Brand New , High Quality River Rocks .Flat & Smooth Kindness Rocks .\n【 Multi-Size】-3 sizes are available ,Medium ,Small and Tiny stones .Satisfy your various DIY ideas . The stones about 8PCS 1.2 to 2.0/12PCS 2.0 to 2.8/100PCS 0.5 to 1.0 inches in length.All great for rock art .These are fun to paint, also acrylic paint pens can be used on them for design and then spray acrylic sealer over paint.\n【 Great for Painting 】-Lifetop painting rocks are Hand Picked ,Flat & Smooth ,Easy to paint on.Please pay attention to the size . the photo is for reference .Smooth Surface Stones are great for painting kindness rocks and other arts and crafts projects. The rocks are suitable for rock art (painting, gluing, whatever your imagination craves).\n【 Fantastic Gift 】- Not only can be painted by yourself but also as a gift to family or friends ,child ect . Let kids busy ! Kids loved it.\n【 Package Included】-120PCS Painting Rocks . ( You can get 12PCS Medium rocks , 8PCS Small rocks , 100PCS Tiny rocks )"
    },
    {
        "name": "WATINC 6Pcs Hand Puppet Making Kit for Kids Art Craft Felt Sock Puppet Toys Creative DIY Make Your Own Puppets Pompoms Wiggle Googly Eyes Storytelling Role Play Party Supplies Gift for Girls Boys",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91uvv2Ig5gL._AC_UL400_.jpg",
            "description": "WATINC 6Pcs Hand Puppet Making Kit for Kids Art Craft Felt Sock Puppet Toys Creative DIY Make Your Own Puppets Pompoms Wig..."
        },
        "totalReviews": 6022,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B081L8933P",
        "url": "https://www.amazon.com/dp/B081L8933P",
        "position": 14,
        "description": "SUPER KIT - Package comes with 6 pcs colorful hand puppets, 1 bundle pompoms, 1 bundle googly eyes, 1 bundle felt decors and a paper box. Create your unique puppet in the world!\nDEVELOP INNOVATIVE ABILITY - It helps to promote children's brain development and creativity; Enhance imagination, concentration and strengthen the hands-on ability and interactively ability of building friendship!\nINDOOR ACTIVITY- These projects is easy, but safe and fun! Surely will bring your kids a happy childhood at home and school! Kids will enjoy themselves when create their own puppets, diy with friends and families!\nGREAT GIFT IDEA - Nice gift and decoration for puppets party, Christmas, Birthday Party, Halloween party, Christmas etc. Also can be great educational toy, teaching aids for science project at school.\nDIY YOUR OWN PUPPET - Our puppet kit comes with 6 colors unfinished puppet, kids can make their own puppet, such as green dinosaur, owl with a tie, pink chicken, etc. Let’s using your imagination!"
    },
    {
        "name": "JPSOR 600pcs Craft Gemstone Acrylic Flatback Rhinestones Jewels for Crafting Embellishments Gems, 6 Shapes, 6-13mm",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81jwGAjHOCL._AC_UL400_.jpg",
            "description": "JPSOR 600pcs Craft Gemstone Acrylic Flatback Rhinestones Jewels for Crafting Embellishments Gems, 6 Shapes, 6-13mm"
        },
        "totalReviews": 4068,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": 9.99
        },
        "asin": "B06XWWH3SR",
        "url": "https://www.amazon.com/dp/B06XWWH3SR",
        "position": 15,
        "description": "💎Various sizes and styles: 100 10mm heart-shaped rhinestones, 100 6*12mm horse eye shaped rhinestones, 100 10mm pentagram rhinestones, 100 6mm round rhinestones, 100 8*13mm teardrop rhinestones, and 100 10mm flower-shaped rhinestones.\n💎Rich colors: Red, yellow, green, blue, pink, rose red, transparent, purple, sky blue, etc. craft gemstone of various colors are the best choice for making different DIY crafts.\n💎Excellent materials: made from high quality pressure materials.\n💎Wild application: You can use them to enjoy an artistic creation. Whether it's make ups, photo frames, vases, cell phones or making greeting cards or gift decorations, they are the perfect choice. You can also use them for birthday parties, weddings, christmas etc.\n💎Notices: This artificial diamond is not sticky on the back, so you need to prepare your own glue.Please keep them away from children under 3years old and avoid the risk of swallowing."
    },
    {
        "name": "Space Science Craft Kit Gift 6-in-1 | Arts Crafts Space Toy for Kids Ages 6-8 | Gifts for Boys and Girls Aged 6,7,8,9,10 Year Olds | Solar System Toys for Kids",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/711+0q46WLL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Space Science Craft Kit Gift 6-in-1 | Arts Crafts Space Toy for Kids Ages 6-8 | Gifts for Boys and Girls Ag..."
        },
        "totalReviews": 2127,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 24.99,
            "priceFraction": "99",
            "beforePrice": 29.99
        },
        "asin": "B07B7JJCM3",
        "url": "https://www.amazon.com/dp/B07B7JJCM3",
        "position": 16,
        "description": "✪ DO YOU HAVE A SPACE CRAZY KID? Then look no further as he/she will love this astronomy gift for kids. This Space box includes 6 activities - Make your own beautiful Solar System Mobile, Learn about the constellations by making a streamer, Make a magical kaleidoscope and see patterns in it, Learn how a rocket works by doing a simple science experiment, and Use Oreo cookies to lick off the cream and understand the different phases that the moon goes through during the month. (Only Recipe)\n✪ A PERFECT GIFT – Science, Art and Craft, and a board game -- This outerspace gift for kids has it all! Gift your child hours of happiness with stem space toys\n✪ YOUR CHILD DESERVES THE BEST – This stem toy is designed by world renowned educational and learning experts\n✪ IDEAL STEM TOY – This space crafts for kids encourages children to use their imagination, learn practical skills and build confidence\n✪ 100% MONEY BACK GUARANTEE - We Offer a 30 day No Questions Asked 100% Money Back Guarantee on our Products"
    },
    {
        "name": "Caydo 200 PCS Pipe Cleaners Craft Supplies Multi-Color Chenille Stems for Art and Craft Projects Creative DIY Decorations (12inch x 6mm)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91QRd3kbzEL._AC_UL400_.jpg",
            "description": "Caydo 200 PCS Pipe Cleaners Craft Supplies Multi-Color Chenille Stems for Art and Craft Projects Creative DIY Decorations..."
        },
        "totalReviews": 559,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B09WV4JJRC",
        "url": "https://www.amazon.com/dp/B09WV4JJRC",
        "position": 18,
        "description": "Value Package: Coming with 200 pieces of pipe cleaners in 20 assorted colors, each color 10pcs, approx. 6mm in diameter, 12 inches in length, to bring life to your creations to satisfy your need\nExcellent Material: Made of wire and fiber, can be bent, twisted, curled, or wrapped to most shapes, which are soft and suit for many craft projects\nGreat Gift Choice: Our Assorted Colors Pipe Cleaners are a perfect gift for parents, teachers, kids, and hobbyists, which is a great way to have fun in crafting DIY projects with chenille stems supply\nInnovative and Distinctive: The craft pipe cleaners can be twisted into any shape you like and are widely used in kindergarten DIY courses and improve and develop children's intelligence and practical ability\nWide Use: These Chenille Stems can be twisted into any shapes you like, such as animals, fruits, vegetables, create toys, decorations, dolls, birthday cards, and so on by your ideas. You can use this for a family fun time with your children, or in manual classes with your students"
    },
    {
        "name": "Caliart Acrylic Paint Set with 12 Brushes, 24 Colors (59ml, 2oz) Art Craft Paints Gifts for Artists Kids Beginners & Painters, Halloween Pumpkin Canvas Ceramic Rock Painting Kit Art Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81FS5fZNY4L._AC_UL400_.jpg",
            "description": "Caliart Acrylic Paint Set with 12 Brushes, 24 Colors (59ml, 2oz) Art Craft Paints Gifts for Artists Kids Beginners & Paint..."
        },
        "totalReviews": 16445,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 25.99,
            "priceFraction": "99",
            "beforePrice": 35.99
        },
        "asin": "B08BNNV3JY",
        "url": "https://www.amazon.com/dp/B08BNNV3JY",
        "position": 19,
        "description": "Acrylic Paint Set With 12 Brushes: Premium paints glide on smoothly, dry quickly and stay as beautiful as the day they were painted. Whether you’re new to acrylic painting or a seasoned artist, the paint kit will set fire to your imagination. Great acrylic paint for canvas painting, halloween decorations, pumpkin painting. The craft paint set is great to produce true, consistent shades on painting art, ideal for professional artists, young aspiring artists, painting lovers, students and kids.The color of the paint brush is random.\nHigh Quality, Rich Pigments, Certified Safe & Non-Toxic: No need to worry about toxicity with our acrylic paint. The acrylic water-based non-toxic paint is Safe for all ages. The creamy consistency and high pigments offer great covering power for large areas and fine details. Blend easily and dry quickly. The fast-dry formula allows you to layer additional coats or add other elements to your work right away. Easy clean up with soap and water.\nPremium Arts & Diy Craft Supplies. Caliart acrylic paints are versatile in canvas art, painting, scrap booking, Christmas, Halloween decorations and more. Suitable for most surfaces, including canvas, wood, rocks, painting pumpkins, stretched canvas, fabrics, stone, metal, plastic, ceramics, decorative wall, blackboard, paper, plaster. Great gift for creative adults, artists, beginners, students, kids, teens, boys and girls. Packed in a sturdy box for keeping always organized and accessible.\nThis art acrylic painting kit comes with 24-pack, 2 oz / 59ml bottles in the classic colors: Lemon Yellow, Medium Yellow, Yellow Ochre, Raw Sienna, Burnt Sienna, Orange, Vermilion, Crimson, Scarlet, Magenta, Purple, Phthalo Blue, Deep Cyan Blue, Cobalt Blue, Cerulean Blue, Viridian, Monastral Green, Sap Green, Phthalo Green, Raw Umber, Burnt Umber, Lamp Black, Grey, Titanium White.\nMoney-Back Guarantee: We're sure you'll love using our acrylic paint supplies for arts crafts & DIY paint projects, but if you have any problems with the art kit set, just let us know for a fast, no-hassle refund or product free replacement.\nThe color of the paint brush is random. NOTE: When you receive the product, you need to check inside the package of the product because the brushes are smaller and occasionally appear at the bottom of the paint.The paint brushes may be at the Bottom of the Packing Box, please check carefully. If still not find or other issue, please feel free to contact us.\n›"
    },
    {
        "name": "24 Colors Acrylic Paint Pens, Paint Markers for Rock Painting, Fine Point Acrylic Pens Art Supplies for Canvas, Ceramic, Wood, Stone, Glass, DIY Craft",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Ux0PWyJUL._AC_UL400_.jpg",
            "description": "24 Colors Acrylic Paint Pens, Paint Markers for Rock Painting, Fine Point Acrylic Pens Art Supplies for Canvas, Ceramic, W..."
        },
        "totalReviews": 91,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.99,
            "priceFraction": "99",
            "beforePrice": 14.99
        },
        "asin": "B0BVZM5TS2",
        "url": "https://www.amazon.com/dp/B0BVZM5TS2",
        "position": 20,
        "description": "[High Quality] Our paint pens are made with water-based, non-toxic ink, have no pungent odor, safe, and are suitable for all ages. They also dry quickly and flow smoothly. Allowing you to work on your project without worrying about smudging or smearing.\n[Fine Tip and Bright Colors] These 24 colors acrylic paint pens are designed with fine tip, which is suitable for fine line work. A rich color range means more mixability and fun. With their vibrant and bright colors, they'll make your artwork pop and stand out. Once you've finished your project, the paint stays as bright as ever.\n[Multi-Purpose] We know paint markers can be used on a variety of surfaces, including canvas, rocks, paper, glass, wood, mugs, plastic, fabric, stone, metal, ceramics, DIY easter eggs, Christmas ornament, and more. Whether you are a child, student, artist, teenager, or adult, you can have fun with these fine tip acrylic paint pens.\n[Easy To Use] The acrylic pens are easy to control and the ink flows nicely. Just push the tip down on the paper a few times to start the pump, and then enjoy a rich, smooth, free-flowing paint pen experience. Note: If you are not using them, tighten the cap and place the pen horizontally.\n[Delicate Gift] Acrylic Paint Pens are a great gift for your family or DIY enthusiast. We offer great satisfied service for our products to make your purchase worry-free. Jus buy today, and let your creativity run wild!"
    },
    {
        "name": "Kid Made Modern Arts and Crafts Supply Library - Coloring Arts and Crafts Kit",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71gTgEhR0dL._AC_UL400_.jpg",
            "description": "Kid Made Modern Arts and Crafts Supply Library - Coloring Arts and Crafts Kit"
        },
        "totalReviews": 4675,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 32.99,
            "priceFraction": "99",
            "beforePrice": 39.99
        },
        "asin": "B07WSJVTR9",
        "url": "https://www.amazon.com/dp/B07WSJVTR9",
        "position": 21,
        "description": "LIMITLESS POSSIBILITY- Let kids’ creativity shine with the Kid Made Modern Arts and Crafts Library set! With over 1,000 pieces to create your own craft adventure, it’s the perfect cornerstone to any kid’s craft stash.\nKIDS CRAFT KIT - Our Arts and Crafts supplies bundle comes packaged in a reusable box to store your supplies when not in use. The only thing you need to add is your imagination.\nBRAIN-BOOSTING FUN: In addition to fine motor skills, creative Kids' art and craft games facilitate problem-solving and emotional health. Whether you need a classroom artist center, a daycare artist center, a science project for the park, or an elementary craft station, we've got you covered.\nDIY CRAFTS - Our bulk art supplies help your children to engage in fun and creative activities. The Kid Made Modern Deluxe Arts and Crafts Supply Collection is perfect for schools, homeschools, camps, and group projects!\nKID MADE MODERN - Creativity is in everyone; all we need is a little inspiration to spark the joy of being makers. Each product was carefully designed to bring every generation of crafters together to celebrate their unique imagination. Through fun arts and crafts supplies, crafts kits, and our catalog of DIY inspiration, you’ll find a home for your creativity at Made Modern."
    },
    {
        "name": "Dan&Darci Clay Jewelry Making Kit - Arts and Crafts Gifts for Girls Ages 8, 9, 10, 11 & 12 Teen Year Old - Fun DIY Girl Craft Gift Ideas for Creative Preteen Kids - Makes 3 Bracelets & 3 Necklaces",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81eE3T9ehEL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Dan&Darci Clay Jewelry Making Kit - Arts and Crafts Gifts for Girls Ages 8, 9, 10, 11 & 12 Teen Year Old - ..."
        },
        "totalReviews": 516,
        "rating": 4.45,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": 19.99
        },
        "asin": "B09GPW149N",
        "url": "https://www.amazon.com/dp/B09GPW149N",
        "position": 22,
        "description": "Unleash & Spark your Creativity: Roll the clay, form into shape, assemble the jewelry, and adorn yourself (or your friends) with the all-inclusive kit. Create 6 designer clay jewelry pieces. Mix and Match the colors or styles to make it unique.\nIncludes: Clay (10 colors), rolling pin, trimming tool, 3 necklaces, bracelet cord, 12 charms, 3 pendants, 99 crystal beads, 12 charm links, bead rod, 2 cLay cutters, glue, and a comprehensive learning guide that makes it very easy to follow along.\nCraft 'n Clay: Pottery is one of the oldest crafts in the world, but artists thousands of years ago never had a kit like this! You've got everything you need to make three beautiful jewelry or trinket dishes.\nA Fun Gift for Girls 8+: It fascinates children as soon as they pull it out of the box and is a perfect family project. The assembly is fun, and the final result is immensely satisfying.\n100% Satisfaction Guaranteed: Love it, or your money back! We're sure that the child will have a blast, but if you are not satisfied with the kit, we'll refund you 100% of the money, no questions asked."
    },
    {
        "name": "12 Wooden Birdhouses - Crafts for Girls and Boys - Kids Bulk Arts and Crafts Set - 12 DIY Unfinished Wood Birdhouse Kits, 12 Paint Strips, 12 Paintbrushes & Stickers for Children to Build & Paint",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71MkwUgpSiL._AC_UL400_.jpg",
            "description": "Sponsored Ad - 12 Wooden Birdhouses - Crafts for Girls and Boys - Kids Bulk Arts and Crafts Set - 12 DIY Unfinished Wood B..."
        },
        "totalReviews": 1708,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 37.99,
            "priceFraction": "99",
            "beforePrice": 41.99
        },
        "asin": "B08N32TC7X",
        "url": "https://www.amazon.com/dp/B08N32TC7X",
        "position": 23,
        "description": "HIGH QUALITY MATERIALS: The wooden bird houses are made of solid wood which means your kids will enjoy the fruits of their labor long after they finish creating these. The set includes everything you will need from start to finish.\nENTERTAINS AND EDUCATES: Birdhouse kits are a favorite crafts pick! Kids love building, creating and connecting to nature. This kit will help them do all of the above. A favorite birthday party or classroom arts and craft activity.\nCOMPLETE CRAFT KIT: This paint your own bird house set includes everything you need for a fun party activity. You get 12 individually wrapped birdhouses; each with a high quality paintbrush, a paint set of five colors, a string for hanging, and an instruction manual.\nSAFE AND NON-TOXIC: These smooth wood boards and non-toxic paints are safe for even the littlest hands. Guide the little ones, and let the older ones do it on their own. These wooden bird house kits are completely safe and kid friendly for children 3 years and older.\nPARTY SET OF 12: This attractive bulk crafts activity kit will make a group of kids very happy. Easy for children to assemble on their own, no screws necessary. Use it in the classroom, for a birthday party, or simply when you want to stock up on fun indoor activities."
    },
    {
        "name": "Marbling Paint Art Kit, 18 Colors Water Marbling kit, Water Art Paint Set, Arts and Crafts for Girls & Boys Ages 6-12, Craft Kits Art Set for Activities",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81-NMnJ4O9L._AC_UL400_.jpg",
            "description": "Sponsored Ad - Marbling Paint Art Kit, 18 Colors Water Marbling kit, Water Art Paint Set, Arts and Crafts for Girls & Boys..."
        },
        "totalReviews": 278,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 27.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B08SC751LF",
        "url": "https://www.amazon.com/dp/B08SC751LF",
        "position": 24,
        "description": "Interesting Painting Kit: Instead of painting on paper or canvas, try painting on... water! Our marbling painting process lets you create artwork in a new way. As soon as they starting the item，several hours of art craft with family or friends.\nEasy to use: Layer paint, smear, drag and 'transfer' it onto the paper. Let it dry and voila! Beautiful marble painted art! Follow the simple illustrated instruction guide and create your art. No need for painting foundation,the water art paint set is suitable for you.\nThe water marbling kit contains 18 bottles of paint 20ml for each, 36 drawing papers, 4 needles, 4 pipettes, 2 bags of carrageenan powder, 2 measuring spoons, 1 scraper, 1 tray, 1 empty bottle 250ml and 1 manual.\nSafe and quality: The pigments of the art kit are made of quality pastes, presenting the good color. With the high quality materials, it is easy to see precipitation, so please shake the bottle of dyes before painting.\nIt is a good project for family and friends, spread imagination and hand-on ability. You will have a blast."
    },
    {
        "name": "DIY Wooden Magnets, 36 Wooden Art Craft for Kids, Art and Craft Supplies Party Birthday Gift Favors for Boys Girls Ages 4-8 8-12, Easter Crafts",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71+CIVYutLL._AC_UL400_.jpg",
            "description": "Sponsored Ad - DIY Wooden Magnets, 36 Wooden Art Craft for Kids, Art and Craft Supplies Party Birthday Gift Favors for Boy..."
        },
        "totalReviews": 743,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 15.99,
            "priceFraction": "99",
            "beforePrice": 19.99
        },
        "asin": "B09P3G1CN4",
        "url": "https://www.amazon.com/dp/B09P3G1CN4",
        "position": 25,
        "description": "【WOODEN MAGNETS PACK】includes 36 wooden crafts, 12 colored pens, 36 magnet stickers. Wooden educational toy magnetic art to meet your child's creative needs.\n【DIY CRAFTS】Design your own wooden magnets and create your own wooden art with any color pens you want. Well-created wooden artwork can be pasted on refrigerators, iron windows, etc. Show your unique taste\n【A TONS OF FUN】There are 36 wooden artworks in the set, you can enjoy creating your own art with your friends, kids and family, as well as decorate your refrigerator with wooden magnets.\n【CREATIVE GIFTS】Perfect birthday party gift ideas and craft kits for kids, painting kits for kids ages 4-8. The perfect gift for children, families who love handmade wood products.\n【SAFE MATERIALS】Good crafts and painting set, rest assured for kids to use. Water-based non-toxic paint pens, wooden magnets are made from BPA-free natural stake wood."
    },
    {
        "name": "5400 Pcs 1 Inch Tissue Paper Squares, 36 Assorted Colored Tissue Paper for Crafts, Art Rainbow Tissue Paper Bulk for Art Projects, Collage, Suncatchers, Scrapbooking - Non Bleeding",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/715FNfwbODL._AC_UL400_.jpg",
            "description": "5400 Pcs 1 Inch Tissue Paper Squares, 36 Assorted Colored Tissue Paper for Crafts, Art Rainbow Tissue Paper Bulk for Art P..."
        },
        "totalReviews": 297,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.49,
            "priceFraction": "49",
            "beforePrice": 7.99
        },
        "asin": "B0B1ZYCJPG",
        "url": "https://www.amazon.com/dp/B0B1ZYCJPG",
        "position": 26,
        "description": "【Tissue Paper Square for Crafts】The package comes with 5400 pcs 1 Inch mosaic tissue paper squares, which are divided into 6 small bags and individually packaged, each small bag has 36 colors and a total of 900 sheets, just take out a small bag each time you can use 36 colors, easy to store.\n【36 Assorted Colors】Including 36 vibrant rainbow colors (including gold and silver), 150 sheets of each color, which can match most school craft works, festivals themed events and other occasions.\n【Pre-cut 1 Inch Tissue Paper】Each square of tissue paper is pre-cut to 2.54 x 2.54 cm, which is easy to use and saves you a lot of cuts time.\n【Ideal for Crafts & Art Projects】Colored tissue paper squares made of thin and soft 14gsm craft tissue paper, easy to bend, cut, shape, crinkle, fold, and glue. Perfect for DIY projects, scrapbooking, paper mache decorations, collages, journaling, Suncatchers, stained glass window effects, and other decoupage projects.\n【Non-Bleeding】The craft tissue paper square is no-bleeding and not dyed, it does not fade in water."
    },
    {
        "name": "Dan&Darci Arts & Crafts Supplies Kit for Kids and Toddlers - with Storage Bin - Kid & Toddler Art & Craft Set Ages 3, 4, 5, 6, 7 & 8 Years Old - Crafting Materials Box Kits for School or Gift",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/911rmBidodL._AC_UL400_.jpg",
            "description": "Dan&Darci Arts & Crafts Supplies Kit for Kids and Toddlers - with Storage Bin - Kid & Toddler Art & Craft Set Ages 3, 4, ..."
        },
        "totalReviews": 272,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BM38X8J2",
        "url": "https://www.amazon.com/dp/B0BM38X8J2",
        "position": 27,
        "description": "UNLEASH & SPARK YOUR CREATIVITY: Your complete arts and crafts supply bin with over 500 pieces of art & craft supplies for kids to create and craft. Packaged and stored in a beautiful storage bin.\nPREMIUM VALUE: Kit includes: Pipe cleaners (standard, striped, and wavy), pom poms (standard and spiky), pop sticks (multi-colored standard and slotted), googly eyes, sequins, spin pins, beads, felt strips, colored papers, rhinestones, feathers, scissors, glue, and a storage bin with dividers.\nCONVENIENT BIN: Includes beautiful and compact storage with customizable dividers to easily store all your craft supplies.\nENDLESS POSSIBILITIES: Make jewelry by adding beads to pipe cleaners. A windcatcher by gluing sticks together into a shape, decorating them, and then tying beads to hang down. Using as many different supplies as possible, make the world's strangest-looking monster. Create an animal that's a mix of animals … the feathers of a bird, a tail like a monkey, and a trunk of an elephant. You get the idea... the possibilities are endless with this mega craft bin!\n100% SATISFACTION GUARANTEED: Love it, or get your money back! We're sure the child will have a blast, but if you are not satisfied with the kit, we'll refund you 100% of the money, no questions asked.\nABOUT US: We are Dan & Darci! As you can tell from our name, we think that two is better than one. That's why we create quality toys and science kits that are both entertaining and educational. Our lab of mad scientists develops the coolest products for kids only — because they know that while you love to grow your brains and be the smartest one in the room, you're only going to do it if you're having fun!"
    },
    {
        "name": "260 Pieces Colorful Glitter Foam Stickers Self Adhesive Stars Mini Heart Shapes Glitter Stickers, Kid's Arts Craft Supplies Greeting Cards Home Decoration Stars&Heart Shapes",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71X2j24Q3CL._AC_UL400_.jpg",
            "description": "260 Pieces Colorful Glitter Foam Stickers Self Adhesive Stars Mini Heart Shapes Glitter Stickers, Kid's Arts Craft Supplie..."
        },
        "totalReviews": 2140,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.74,
            "priceFraction": "74",
            "beforePrice": 9.99
        },
        "asin": "B072JW6NQT",
        "url": "https://www.amazon.com/dp/B072JW6NQT",
        "position": 28,
        "description": "The Bubble stickers of the stars and hearts are very nice. I put them on my beloved table, on the back of the phone, on the computer, and on the wall. I give the floodlight heart-shaped stickers to my good friends and they like it very much. I buy the glittering star stickers and gave them to my lovely children and they are very happy.These colorful foam stickers are great for greeting cards, kids' craft project, classroom and home decoration, phone,etc. DIY develop your imagination\nIn appearance, the shape of the stars and the heart-shaped stickers are beautiful. They are colorful and sparkling, just like the stars in the sky are blinking, like a beautiful heart that is ready to move. I will be very happy whenever I see them, because it is very beautiful\nIn terms of quantity, there are about 260 small star stickers and heart-shaped stickers, and the number is really satisfying my needs. I can stick it on many items I like, such as pencil cases, mobile phone cases, textbooks, toys, and many places in the room\nIn terms of quality, I really like the soft bubble texture of star stickers and heart-shaped stickers. I can directly tear the sticker off the carrier for operation, super convenient, and the color will not fade because it has been used for a long time\nIn short, both the appearance and the quality of the stickers are very applicable. I can decorate anywhere I like; I can put these stickers on my friends and friends' arms, cheeks, and other decorations at the party; I can give my favorite friends a beautifully wrapped sticker"
    },
    {
        "name": "Mr. Pen- Craft Scissors Decorative Edge, 6 Pack, Craft Scissors, Zig Zag Scissors, Decorative Scissors, Scrapbooking Scissors, Fancy Scissors, Scissors for Crafting, Pattern Scissors, Design Scissors",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71oLNpwGpEL._AC_UL400_.jpg",
            "description": "Mr. Pen- Craft Scissors Decorative Edge, 6 Pack, Craft Scissors, Zig Zag Scissors, Decorative Scissors, Scrapbooking Sciss..."
        },
        "totalReviews": 3981,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.85,
            "priceFraction": "85",
            "beforePrice": 9.99
        },
        "asin": "B08F2SPQZR",
        "url": "https://www.amazon.com/dp/B08F2SPQZR",
        "position": 29,
        "description": "Package Included 6 Creative Craft Scissors; Each Pair Of Scissors Has A Unique Pattern.\nEasy To Use, Very Suitable For Children To Start Learning To Use Scissors.\nThe Blade Is Covered By Plastic, It Could Prevent Children From Cutting Their Hands When Using.\nCreate Fun Decorative Borders – Make Intricate Embellished Cuts For Distinct Edging & Borders.\nArt Cutters Let You Execute Incredible Adornments For All Your School & Leisure Projects, Great For Creating Unique Scrapbook Layouts, Bulletin Boards & More\n›"
    },
    {
        "name": "Darnassus 132-Piece Art Set, Deluxe Professional Color Set, Art Kit for Kids and Adult, With Compact Portable Case",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71NVrhIKCWL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Darnassus 132-Piece Art Set, Deluxe Professional Color Set, Art Kit for Kids and Adult, With Compact Portab..."
        },
        "totalReviews": 1952,
        "rating": 4.75,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": 35.99
        },
        "asin": "B0872TF4TP",
        "url": "https://www.amazon.com/dp/B0872TF4TP",
        "position": 30,
        "description": "🎨It includes all the necessary tools for a beginning artist and professional artists. Perfect art set for adults and kids. It contains: 22color pencils; 40 oil pastels; 18 dual-tips markers; 1 pencil sharpener; 6 markers; 18 watercolor cakes; 1 eraser; 1 palette; 1 brush; 4 sheets writing paper; 20 sheets A5 paper.\n🎨The case provides ample storage for the art supplies, keeping them organized, and opens flat for easy access. The locking clasps on the exterior of the case make it easy for transporting. It is durable to keep everything safe.\n🎨This 132 piece deluxe art set includes all the necessary tools for an artist to create beautiful content. It is suitable for both beginners and veteran artists, kids and adults alike. This high-quality art set is widely used by students, and professional artists.\n🎨This set is lightweight and thus ideal for travel. If you are visiting friends or relatives or on the plane, car or restaurant. It’s a perfect way to keep the little ones busy while having fun drawing, sketching or painting.\n🎨 NON-Toxic. All art supplies in this set is safe and non-toxic, conforms to ASTM D4236. Safe art kits to use for any level of artist. Perfect kids art kit, art set, art supplies kits."
    },
    {
        "name": "Kids Arts and Crafts Activities - Creates 20 Craft Farm Animal Puppets - Art Supplies Material with Instruction Manual for Boys & Girls - Carl & Kay",
        "leftInStock": "Only 4 left in stock - order soon.",
        "image": {
            "url": "https://m.media-amazon.com/images/I/81wpXm4qznL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Kids Arts and Crafts Activities - Creates 20 Craft Farm Animal Puppets - Art Supplies Material with Instruc..."
        },
        "totalReviews": 59,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.97,
            "priceFraction": "97",
            "beforePrice": null
        },
        "asin": "B0B3N84WZG",
        "url": "https://www.amazon.com/dp/B0B3N84WZG",
        "position": 31,
        "description": "EASY CRAFTS: Our Farm Animal Craft Jar kit includes Pom Poms, popsicle sticks, googly eyes, pipe cleaners, glue, buttons, feathers and EVA foam stickers\nPERFECT GIFT: Looking for gift ideas that kids will love? Whether it's a birthday gift, Christmas present, or just a special surprise - our best seller DIY art kit is sure to delight everyone from toddlers to tweens/preteens!\nPERFECT GIFT: Looking for gift ideas that kids will love? Whether it's a birthday gift, Christmas present, or just a special surprise—our best seller DIY art kit is sure to delight everyone from toddlers to tweens/preteens!\nEASY CRAFTS: Our Farm Animal Craft Jar kit includes Pom Poms, popsicle sticks, googly eyes, pipe cleaners, glue, buttons, feathers and EVA foam stickers"
    },
    {
        "name": "Darnassus 155-Piece Trifold Easel Art Set, Deluxe Professional Color Set, Compact Portable, with Crayons, Markers, Pencils, Color Cakes, and Sketch Pad, Crafts Gift for Ages 4-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71sHP2NPqDL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Darnassus 155-Piece Trifold Easel Art Set, Deluxe Professional Color Set, Compact Portable, with Crayons, M..."
        },
        "totalReviews": 765,
        "rating": 4.75,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B086DB7SKR",
        "url": "https://www.amazon.com/dp/B086DB7SKR",
        "position": 32,
        "description": "This 155 drawing set is dedicated to giving your artists a sense of full-scale drawing. Whether you are on vacation, or outdoors, it gives kids a comfortable and enjoyable time. They can draw and color everywhere hence keeping them engaged.\nYou don’t have to buy a separate drawing platform. This has a pop-up drawing easel for instant action. The interior is perfectly designed to offer proper tools organization. This helps kids to find a needed item quickly while also learning how to arrange.\nThis set comes with a variety of drawing pencils and markers. All featuring tools are kids’ friendly and non-toxic hence maintaining health and safety. Some of the featuring components include 24 crayons, 12 watercolor cakes, 36 markers among other essentials.\nCome with portable wooden case which is compact and easy to carry. Whether at home, office traveling or any other place, it gives you great versatility, it converts easily into an easel which allows you to draw while everywhere.\nThis art set is filled with materials of the highest quality and non-toxic and safe to use painting, drawing, coloring, and sketching art supplies."
    },
    {
        "name": "Deluxe Art Supplies, 88 Pieces Art Set in Portable Wooden Case, with 2 Drawing Books and 4 Canvas Panels, Professional Art Set for Painting & Drawing, Art Kit for Kids, Teens and Adults/Gift",
        "leftInStock": "Only 9 left in stock - order soon.",
        "image": {
            "url": "https://m.media-amazon.com/images/I/71iyhSmOnyL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Deluxe Art Supplies, 88 Pieces Art Set in Portable Wooden Case, with 2 Drawing Books and 4 Canvas Panels, P..."
        },
        "totalReviews": 1323,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 28.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B083M8XXF1",
        "position": 33,
        "url": "https://www.amazon.com/dp/B083M8XXF1",
        "description": "【MODERN DESIGN】The art set box is designed with nature wooden color, simple and elegant. It has two drawers. The push-pull design makes it easier to take the brush. The top can be opened and closed to increase the capacity of the box. After being folded, it saves space and is convenient for storage. The handle design is easy to carry\n【PACKAGING INCLUDES】Art supply has1 Wooden Case+2 large sketch books+4 Drawing Boards. Left: 10 acrylic brushes. Right: 12 Sketching Pencils+1 Putty Eraser+1 Wooden Sharpener. First Drawer: 8 Acrylic Paints+1 dipping palleteoil pastels+12 Watercolor Cakes. Second Drawer: 28 Watercolor Pencils+8 Oil Pastels. 88 pieces in total\n【WIDELY USE】Adult children's art set can be used in different places, school, outdoor and at home. It won't occupy a lot of space at home. There is enough space inside the box to put down the drawing paper and draw directly on the box. Because of its portability, it can be taken to any outdoor place without making it difficult for you to carry it. All the painting tools can be put together\n【MATERIAL QUALITY】Drawing set is made of high quality wood. All crayons, paint and chalk in this art box are non-toxic. Acrylic pigments are characterized by density balance, fluidity and flexibility. Essential acrylic paint brushes feature comfort handles and soft flexible nylon bristles\n【SUITABLE CROWD】100% safe for kids from 6 years old. Suitable for beginners and painting enthusiasts art supplies for kids 9-12.A variety of painting tools to provide you with different painting style experience"
    },
    {
        "name": "Horizon Group USA Rainbow Arts & Crafts Supplies, 400+ Piece Kit with Fuzzy Sticks, Poms, Sequins, Gems, & Wiggly Eyes, All-in-One Craft Box, Arts & Crafts for Kids, DIY Craft Supplies, Kids Art Set",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91LLR2yNSjL._AC_UL400_.jpg",
            "description": "Horizon Group USA Rainbow Arts & Crafts Supplies, 400+ Piece Kit with Fuzzy Sticks, Poms, Sequins, Gems, & Wiggly Eyes, Al..."
        },
        "totalReviews": 110,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 8.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B085HFQWJQ",
        "url": "https://www.amazon.com/dp/B085HFQWJQ",
        "position": 34,
        "description": "OVER 400 ARTS & CRAFTS SUPPLIES: This all-in-one craft box comes with vibrant craft supplies in every color of the rainbow to make crafts that sparkle, shine, & glow!\nMAKE YOUR CREATIONS SPARKLE: With over 200 multicolored sequins and jewels, give every one of your crafty creations a little extra pizzazz!\nWARM & FUZZY: This craft box comes with 60 soft and fuzzy pipe cleaners are a fun way to add soft texture and dimension to your craft projects. Bend them into cute shapes without ever using glue!\nFINE MOTOR & SENSORY PLAY: Create a fun sensory bin with 100 fuzzy pom-poms, or practice fine motor skills by creating counting sticks with sequins and colorful craft sticks!\nPACK INCLUDES: 60 Fuzzy Sticks (Red, Orange, Yellow, Green, Blue Purple), 100 Assorted Poms (Red, Orange, Yellow, Green, Blue, Purple), 1 Packet of Colorful Sequins (20g), 25 Wiggly Eyes, 265 Assorted Multicolored Jewels, 25 Jumbo Craft Sticks (Red, Yellow, Green, Blue, Purple), 10 Wood Craft Sticks"
    },
    {
        "name": "ICECHEN 8 Pcs Diamond Paintings Coasters Kits with Holder, DIY Halloween Coaster Diamond Art Kits,Full Drill Rhinestone Painting Kits for Adults & Kids,Beginners Art Craft Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/911uq-u77nL._AC_UL400_.jpg",
            "description": "ICECHEN 8 Pcs Diamond Paintings Coasters Kits with Holder, DIY Halloween Coaster Diamond Art Kits,Full Drill Rhinestone Pa..."
        },
        "totalReviews": 17,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 11.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C2KDP2FV",
        "url": "https://www.amazon.com/dp/B0C2KDP2FV",
        "position": 35,
        "description": "Gorgeous & Functional: Creatively combined with diamond painting and Halloween coasters, suitable size for the most cups. Diamond painting coasters bring about shining looking and practicality rather than just normal diamond painting stuffs.\nHalloween Diamond Painting Coaster Set:You can get diamond paintings coaster x 8（Size：4 Inch/10cm）,coaster holder x 1, clay glue x 1, pen x 1, diamond tray x 1 and enough colorful diamonds.It contains all the accessories and tools you need for DIY diamond painting coasters.\nPerfect Size:These coasters for drink will hold your coffe, cocktail, cocktails and more with its ideal size of 4\" inch diameter，which is suitable for most cups.These diamond painting coasters set will add a touch of funny Halloween atmosphere to your tableware.\nEasy for Beginners and Kids: Tear off the protective film on the coaster,and you only need to select the correct color according to the drill bit number comparison table on the coaster to fill the diamond.\nIdeal Gift：Diamond painting coasters kits is perfect for home decoration, best gift choice for your friends or family.Perfect for adults and kids who is beginner level with patience，so you can enjoy more family time，such as home craft competitions and school handmade classes.It can be placed on dining tables, coffee tables, office desks, and in cars etc. It is a meaningful gift for family and friends"
    },
    {
        "name": "Madisi Painting Canvas Panels Multi Pack, 4x4, 6x6, 8x8, 10x10(12 of Each), 48 Pack",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/615BRR9LyJL._AC_UL400_.jpg",
            "description": "Madisi Painting Canvas Panels Multi Pack, 4x4, 6x6, 8x8, 10x10(12 of Each), 48 Pack"
        },
        "totalReviews": 2652,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 29.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B07YHHRRX6",
        "url": "https://www.amazon.com/dp/B07YHHRRX6",
        "position": 36,
        "description": "Canvas panels multi pack,4x4, 6x6, 8x8, 10x10(12 of each), 48 Pack.\nIdeal art surface for effortless canvas painting.\nReady for paint, primed weight 8 oz, not easy to crack.\nSuitable for oils, acrylics, gouache and tempera.\nAcid free, ideal for kids,students,beginners and amateurs."
    },
    {
        "name": "Kids Rock Painting Kit - Glow in The Dark - Arts & Crafts Gifts for Boys and Girls Ages 4-12 - Craft Activities Kits - Creative Art Toys for 4, 5, 6, 7, 8, 9, 10, 11 & 12 Year Old Kids",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81lW6BTn0eL._AC_UL400_.jpg",
            "description": "Kids Rock Painting Kit - Glow in The Dark - Arts & Crafts Gifts for Boys and Girls Ages 4-12 - Craft Activities Kits - Cre..."
        },
        "totalReviews": 586,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BRNY9HZB",
        "url": "https://www.amazon.com/dp/B0BRNY9HZB",
        "position": 37,
        "description": "UNLEASH & SPARK YOUR CREATIVITY: The ultimate gift for any child who loves art, creativity, and a little bit of magic. With this fun and educational kit, kids can unleash their creativity and create truly unique and eye-catching 'glowing' rock designs.\nINCLUDES: 10 natural white river rocks, 4 puffy glow-in-the-dark paints, 6 standard paints, gold & silver glitter glue, 2 paintbrushes (fine tip and wider tip), googly eyes, gem stickers, gold and black transfer stickers, and instruction manual.\nLET IT GLOW: The main attraction is the puffy glow-in-the-dark paints. When the lights go out, these paints will light up and provide beautiful designs. Imagine the look on your child's face as they watch their rock designs come to life in the dark!\nFUN & EASY: Whether you're a beginner or an experienced rock painter, the Glow-in-the-Dark Rock Painting Kit has something for you. The fine-tip paintbrush is great for precise lines, while the wider brush is perfect for larger areas. With the included googly eyes, gem stickers, and transfer stickers, kids can get creative and add their personal touch to their rocks.\nA FUN AND EDUCATIONAL GIFT FOR ALL AGES: It fascinates children as soon as they pull it out of the box and is a perfect STEM project. It's a fun and engaging way for kids to spend their time and unleash their creativity. Great set for individual play or as a group activity. The process is fun, and the final result is immensely satisfying.\n100% SATISFACTION GUARANTEED: Love it, or get your money back! We're sure the child will have a blast, but if you are not satisfied with the kit, we'll refund you 100% of the money, no questions asked."
    },
    {
        "name": "Kraftic Arts and Crafts Supplies Set for Kids Ages 4-8, Giftable Art Box with 20 Drawers filled with Assorted DIY Craft Supplies for Toddlers, School Projects, and Homeschool - Red",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/916dZj4HnrL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Kraftic Arts and Crafts Supplies Set for Kids Ages 4-8, Giftable Art Box with 20 Drawers filled with Assort..."
        },
        "totalReviews": 594,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 49.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B01M02M87X",
        "url": "https://www.amazon.com/dp/B01M02M87X",
        "position": 38,
        "description": "COMPLETE ARTS AND CRAFTS SUPPLY CENTER: It's a crafting kit that has it all! Inspire hands on creativity through crafting with a colorful, diverse kit of art supplies\nCRAFT BOX INCLUDES: In each drawer, you'll find arts & crafts supplies such as, felt pom-poms, googly eyes, ABC stickers, crystals, pipe, cleaners, glue sticks, feathers, gems, markers and more\nLEARNING THROUGH ARTS & CRAFTS: While choosing items from their arts and crafts supply center kids will become interested in projects that will boost cognitive skills and their self-esteem\nORGANIZED: The back of our kids arts and crafts kit features hanging loops so you can hang it up for easy storage it. All the craft supplies are ready to use! No assembly required!\nTHE ULTIMATE ARTS AND CRAFTS KIT - Get creative! Using this craft assortment, you can make collages, Googly eyed mini monsters, photo frames, birthday or Get Well Soon cards, and more! The sky's the limit!"
    },
    {
        "name": "Candle Making Kit, Beeswax Scented Candles Supplies Arts and Crafts for Adults and Teens Gift Set for Women Including Fragrance, Soy Wax, Cotton Wicks, Metal Pot, Candle Dyes, Candle Jars and More",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71BwB2iXCcL._AC_UL400_.jpg",
            "description": "Sponsored Ad - Candle Making Kit, Beeswax Scented Candles Supplies Arts and Crafts for Adults and Teens Gift Set for Women..."
        },
        "totalReviews": 2539,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 34.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B07SW4RMFH",
        "url": "https://www.amazon.com/dp/B07SW4RMFH",
        "position": 39,
        "description": "Diy Candle Making Starter Set, Each set is packed with care and includes everything you need to get 1 melting pot 500ml, 4 bags of beeswax 7oz each, 6 candle tins with lids, 6 scents, 10 cotton wicks, 6 dye blocks, 10 wick stickers, 6 labels, 6 stirring sticks, 2 wick clips, 1 storage bag, 1 thermometer and an user manual.\nEasy to Make, Whether you're a beginner kids or adults, this Diy kit makes it easy for boys and girls to enjoy homemade candles, with a lot of fun throughout the making candle process. Also you could make candles for friends or lovers as a special gift instead of spending money on scented candle gifts set.\nEnjoy Six Divine Candles, Unlike other candle making sets, this kit contains enough tools to create 6 unique candles in different colors and scents. Light a different one each day to suit your mood.\nPremium Beeswax.Our candle making supplies are come with beeswax. That will make scented candles more long lasting.\nPerfect Gift. No one will refuse such a fairy house gift. If you are a diy lover or have patience and time,this Kit is very suitable for you.In addition, they comes with a gift package and makes a wonderful present for birthday, Christmas, Thanksgiving day gift or home decor for boyfriends,girlfriends, dad,mom,wife"
    },
    {
        "name": "TIFEE 8 Pcs Diamond Painting Coasters Kits Cat Shaped Diamond Painting Coasters with Holder DIY Diamond Art Coasters for Beginners, Adults & Kids Art Craft Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81bg-V8KeJL._AC_UL400_.jpg",
            "description": "TIFEE 8 Pcs Diamond Painting Coasters Kits Cat Shaped Diamond Painting Coasters with Holder DIY Diamond Art Coasters for B..."
        },
        "totalReviews": 44,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.99,
            "priceFraction": "99",
            "beforePrice": 14.99
        },
        "asin": "B0BZYKNHY2",
        "url": "https://www.amazon.com/dp/B0BZYKNHY2",
        "position": 40,
        "description": "Package Included: you will receive 8 pieces diamond painting coasters with 1 pieces of holder, 1 set of colorful diamond, 1 pieces of clay glue and diamond painting pen.\nPremium Material: These diamond art coaster made of thickened acrylic plastic, not easy to wear, to ensure long time use. The patterns are well painted so that those numbers and patterns can be seen clearly. Besides, it has strong adhesion, which can firmly stick the rhinestones on the coaster and is not easy to fall off.The cork base can be attached to the back of the coaster for non-slip.\nEasy to Operate: 1.Tear off the film; 2. Pour corresponding number's diamond into the tray; 3. Stick wax with the pen; 4. Absorb diamonds with the pen; 5. Find rhinestone corresponding number on the coaster, then put the diamond; 6.Start diamond painting until finish.\nCork Bottom: Every diamond painting coaster for drink is equipped with nature cork in the bottom, preventing your furniture or tables from scratching and wear and keep the coaster stay steady in place well — protects your desktop and countertop from heat.\nGrate Gift - Our Diamond Painting Coasters Kit is perfect for anyone who likes DIY. You can send it to your friends or family members as gifts for Valentine's Day, Birthday, Christmas, Mother's Day and New Year. If you have any problem about the product, please contact us directly."
    },
    {
        "name": "Flat Clay Beads for Jewelry Bracelet Making Kit,6mm Flat Polymer Heishi Beads DIY Arts and Crafts Kit with Smiley Face Letter Bead,Gifts Toys for Girls Age 6-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81UiJLfn+PL._AC_UL400_.jpg",
            "description": "Flat Clay Beads for Jewelry Bracelet Making Kit,6mm Flat Polymer Heishi Beads DIY Arts and Crafts Kit with Smiley Face Let..."
        },
        "totalReviews": 1962,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 18.96,
            "priceFraction": "96",
            "beforePrice": null
        },
        "asin": "B096Z5MCHJ",
        "url": "https://www.amazon.com/dp/B096Z5MCHJ",
        "position": 41,
        "description": "【Kits Include Everything You Need】：Include 15 colors, more than 3000pcs clay beads and 600pcs charms kit (macaron pony beads,seed beads,devil's eye beads,letter beads,smiley beads,bear beads,food beads,emoticon beads, pendants,lobster clasps, etc.), 2 crystals elastic ropes, a tweezers. This complete, expansive jewelry making kit is filled with endless possibilities to be imaginative, to meet all your needs for bracelet making & jewelry making.\n【High-quality Material】：The clay beads are made of polymer clay, which is very soft and environmentally friendly. Each bead does not break easily and is uniform in size (6mm in diameter, 2mm in hole diameter and 1mm in thickness). It is also skin-friendly and waterproof, so you won't feel any discomfort when wearing it. It does not fade easily and you can wear it in the pool, bathroom or on the beach.\n【Wide Applications】：This kit is suitable for making bracelets, necklaces, anklets, key chains, rings earrings, etc. It not only improves children's hands-on skills, but also enhances their imagination. Keep your kids busy and away from tablets phones and other electronics."
    },
    {
        "name": "Eppingwin 200 PCS Pipe Cleaners, Multi-Colored Pipe Cleaners Craft Supplies, 20 Colors Chenille Stems for DIY Arts Crafts Project(Multi Color)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/813VcAm0GdL._AC_UL400_.jpg",
            "description": "Eppingwin 200 PCS Pipe Cleaners, Multi-Colored Pipe Cleaners Craft Supplies, 20 Colors Chenille Stems for DIY Arts Crafts ..."
        },
        "totalReviews": 173,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 5.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BV2MKZYW",
        "url": "https://www.amazon.com/dp/B0BV2MKZYW",
        "position": 42,
        "description": "You Will Get: 200 pieces of multi colored chenille stems,exquisitely packaged. L×W×H：12*3*1 in. Available in a variety of colors, our pipe cleaners are sure to add a touch of whimsy to any project and create something that brings vitality to your life\nExcellent Quality: Pipe cleaners made of soft wire and polyester fiber.It is not only can be flexible bent and wrapped,but also sturdy and not easy to break, it can be used to create shapes, decorations, and more\nGreat Ideal for Gift：Eppingwin's pipe cleaner are bright and colorful and can stimulate imagination. It can be perpect gift in Christmas, Halloween, Mother's Day and every festival. And making it at home and in class can also add to the atmosphere of harmony\nDevelop Creativity：Making handicrafts is ideal for stimulating practical ability and improving innovation. Pipe cleaners can be made according to their own ideals and can be made into animals, flowers, fruits, toys and decor\nGuarantee：If your are not satisfy our product or unhappy purchase experience, we will deal with your problem in time. Welcome to share your designs and crafts."
    },
    {
        "name": "Bins & Things Stackable Storage Container with Organizers for Arts and Crafts - 4 Trays - Gray - Craft Box - Craft Storage / Craft Organizers and Storage - Bead Organizer Box/Art Supply Organizer - Sewing Box",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71vFVJ4cTEL._AC_UL400_.jpg",
            "description": "Bins & Things Stackable Storage Container with Organizers for Arts and Crafts - 4 Trays - Gray - Craft Box - Craft Storage..."
        },
        "totalReviews": 2247,
        "rating": 4.25,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 29.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B07VVH1LL2",
        "url": "https://www.amazon.com/dp/B07VVH1LL2",
        "position": 43,
        "description": "NEVER LOSE YOUR SMALL ITEMS AGAIN - Fiddly little household items can be a drag - especially when they get lost. Keep all items together in one place with this convenient organizer case from Bins & Things. Ideal for many purposes such as nail organizers and storage, craft organizer, bead storage, craft box and art organizer. barbie clothes storage\nPERFECT FOR SEWING & BEAD COLLECTIONS - Store thread spools individually in this handy plastic organizer tray and give each color thread its own compartment. Also works great for Bobbins, colored Beads, Jewelry, Beauty Products & Accessories, Scrapbooking Supplies and other art supplies. Great for organizing short nail polish (3\" or shorter) like essie. barbie storage case for dolls and accessories. sewing basket\nLIGHTWEIGHT, CONVENIENT & EASILY PORTABLE - Your Bins & Things storage container lid features a handle and can easily be carried around with you - clasps on the lid close up tight and it’s lightweight for easy portability. Take your art box with you on the go! Tackle box organizers and storage in a different way with our sewing organizer / bead storage organizer.\nVERSATILE WITH MULTIPLE USES - With 3 tiers and 30 individual adjustable compartments, it's perfect for storing and organizing LOL Suprise Dolls, Littlest Pet Shop, Shopkins and Lego Dimensions. The compartment organizer box keeps order even in the biggest art supply storage! Simply divide the big compartment box into small plastic case for a tidy art storage organizer.\nDURABLE, TRANSPARENT PLASTIC DESIGN - See clearly what you’ve stored and where - without even having to open the art bin. This craft storage box is made from durable clear plastic that is sure to last you for years to come. Sturdy craft storage containers for your passion!\n›"
    },
    {
        "name": "Olly Kids Arts and Crafts Supplies Set- 1000+ Pieces Giftable Craft Box for Kids: DIY Craft Supplies for Toddlers, School Project, and Homeschool",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Wh6BoRg7L._AC_UL400_.jpg",
            "description": "Olly Kids Arts and Crafts Supplies Set- 1000+ Pieces Giftable Craft Box for Kids: DIY Craft Supplies for Toddlers, School ..."
        },
        "totalReviews": 1627,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 34.97,
            "priceFraction": "97",
            "beforePrice": 39.97
        },
        "asin": "B086ZJ3Z9N",
        "url": "https://www.amazon.com/dp/B086ZJ3Z9N",
        "position": 44,
        "description": "We’ve carefully selected the most useful crafting supplies for kids. No more impractical items lying around, this is the ultimate set.\nOrganization at last! Triple-layer art box with sections and a carry handle.\nLet your imaginations go wild. You’re awesome for giving your little one’s educational, & creative experiences.\nDiscover 1000 + pieces. This giant box of kids craft set contains everything you need for a creative day, with more than enough for a whole bunch of kids.\nAn amazing gift for birthdays, Christmas, or just because you are stuck indoors. Watch your kids have a blast gluing, sticking, and creating OR watch their eyes stay glued to their screens. The choice is yours…"
    },
    {
        "name": "Kids Sea Shell Painting Kit - Arts & Crafts Gifts for Boys and Girls Ages 4-12 - Craft Activities Kits - Creative Art Activity Gift Toys for Age 4, 5, 6, 7, 8, 9, 10, 11 & 12 Year Old 4-6, 4-8, 8-12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/815d39HrdjL._AC_UL400_.jpg",
            "description": "Kids Sea Shell Painting Kit - Arts & Crafts Gifts for Boys and Girls Ages 4-12 - Craft Activities Kits - Creative Art Acti..."
        },
        "totalReviews": 52,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C7S26G2L",
        "url": "https://www.amazon.com/dp/B0C7S26G2L",
        "position": 45,
        "description": "UNLEASH & SPARK YOUR CREATIVITY: The ultimate gift for any child who loves art and creativity. With this fun kit, kids can unleash their imagination and create truly unique and stunning designs on real seashells.\nINCLUDES: 11 real seashells, 6 standard paints, 2 metallic paints, 5 modeling clays, glitter glue, regular glue, googly eyes, 2 paint brushes, and an instruction manual.\nCREATE ADORABLE CHARACTERS AND INTRICATE DESIGNS: With the included modeling clays, kids can let their creativity shine by sculpting cute characters, intricate patterns, and adding textured details to the seashells. The metallic paints provided in the kit add a touch of brilliance, making the designs on the shells stand out and shimmer with vibrant colors.\nFUN & EASY: Whether they are new to shell painting or experienced artists, this kit has something for everyone. The paint brushes allow for precise detailing, while the modeling clays can be used to add texture and depth to the shells. Kids can get creative and personalize their designs with googly eyes and other embellishments.\nA FUN AND EDUCATIONAL GIFT FOR ALL AGES: It fascinates children as soon as they pull it out of the box and is a perfect STEM project. It's a fun and engaging way for kids to spend their time and unleash their creativity. Great set for individual play or as a group activity. The process is fun, and the final result is immensely satisfying.\n100% SATISFACTION GUARANTEED: Love it, or get your money back! We're sure the child will have a blast, but if you are not satisfied with the kit, we'll refund you 100% of the money, no questions asked."
    },
    {
        "name": "Dan&Darci Arts and Crafts Vault - 1000+ Piece Craft Supplies Kit Library in a Box for Kids Ages 8 9 10 11 & 12 Year Old Girls & Boys - Crafting Set Kits - Gift Ideas for Kids Art Project Activity",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Y86A3IpkL._AC_UL400_.jpg",
            "description": "Dan&Darci Arts and Crafts Vault - 1000+ Piece Craft Supplies Kit Library in a Box for Kids Ages 8 9 10 11 & 12 Year Old Gi..."
        },
        "totalReviews": 3767,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 39.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B08H4SG94J",
        "url": "https://www.amazon.com/dp/B08H4SG94J",
        "position": 46,
        "description": "Unleash & spark your creativity: Your complete arts and crafts supply set with over 1,000 pieces of art & craft supplies for kids to create and craft. Packaged and stored in a beautiful 2-drawer case.\nPremium value: Kit includes: Pipe Cleaners, Fuzzy Sticks, Pom Poms, Wooden Pieces, Felt Strips, Craft Sticks, Sequins, Wooden Discs, Wooden Beads, Plastic Beads, Sticky Gems, Googly Eyes, Scissors, Sewing Needles, Glue, Glitter Glue, Feathers, Buttons, Thread.\nMake jewelry by adding beads to the thread or pipe cleaners. A windcatcher by gluing sticks together into a shape, decorating them, and then tie beads to hang down. Using as MANY of the different supplies as possible, make the world’s strangest-looking monster. Create an animal that’s a mix of animals … the feathers of a bird, a tail like a monkey, a trunk of an elephant. You get the idea... the possibilities are endless with this mega kit!\n100% satisfaction guaranteed: Love it, or your money back! We're sure that the child will have a blast, but if you are not satisfied with the kit, we'll refund you 100% of the money, no questions asked.\nAbout us: We are Dan & Darci! As you can tell from our name, we think that two is better than one. that’s why we create quality toys and science kits that are both entertaining and educational. Our lab of mad scientists develop the coolest products for kids only — because they know that while you love to grow your brains and be the smartest one in the room, you’re only going to do it if you’re having fun!"
    },
    {
        "name": "1405 Pcs Art and Craft Supplies for Kids, Toddler DIY Craft Art Supply Set Included Pipe Cleaners, Pom Poms, Feather, Folding Storage Box - All in One for Craft DIY Art Supplies, Rose Red",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81jD4TuiDkL._AC_UL400_.jpg",
            "description": "1405 Pcs Art and Craft Supplies for Kids, Toddler DIY Craft Art Supply Set Included Pipe Cleaners, Pom Poms, Feather, Fold..."
        },
        "totalReviews": 689,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 32.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B08R1BD2B2",
        "url": "https://www.amazon.com/dp/B08R1BD2B2",
        "position": 47,
        "description": "All in One: kortes art craft supplies included 1x Storage Box, 50x Multicolor Feathers, 100x Multicolor Paper, 100x Multicolor Craft Sticks, 100x Wooden Craft Sticks, 2x Crystal Stickers, 100x Multicolor Spot Pipe Cleaners, 100x Multicolor Glitter Pipe Cleaners,100x Muticolor Pipe Cleaners, 200x Pom Poms, 300x Beads, 100x Buttons, 200x Eyes, 1x Strings, 1x Scissors, All in One for Prechool Craft DIY Art Supplies\nLeading Quality: Quality products, safe and environmental friendly craft kits in one box, suitable for kids ages 4 and over, a number of colorful craft items can meet different needs when they doing projects, a must need in the growth of preschool children\nEndless Possibilities: Let your kids imagination run wild and be creative, helps children have a way to express themselves and enrich their growth, instead of the time to play mobile phone, protecting their eyes\nPerfect Gift : Wonderful present for kids in your life with this super preschool art craft supplies, suitable for any celebratory occasion in new year, birthday, Christmas, etc. or as a reward for good behavior to kids, they will happy and love this art kits in no time\nWarm tips: Please be accompanied by parent when young kids use scissors, these craft kits is conducive to promote the relation between parents and children also, very good media to improve their feelings of heat up"
    },
    {
        "name": "100 Pcs Small Paint Brushes Bulk Disposable Flat Paint Brushes Set for Kids Crafts Classroom Nylon Hair Paintbrushes Artist Paint Brushes for Acrylic Oil Watercolor Face Painting Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71iXYWKd1uL._AC_UL400_.jpg",
            "description": "100 Pcs Small Paint Brushes Bulk Disposable Flat Paint Brushes Set for Kids Crafts Classroom Nylon Hair Paintbrushes Artis..."
        },
        "totalReviews": 2,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 5.99,
            "priceFraction": "99",
            "beforePrice": 6.99
        },
        "asin": "B0C4D6K89X",
        "url": "https://www.amazon.com/dp/B0C4D6K89X",
        "position": 48,
        "description": "GOOD QUALITY – Our small paint brushes are artist quality with lightweight handle makes painting with precision easy when the details matter most, especially when being used by children. Our nylon haired brush head holds the paint incredibly well without dripping or constantly needing to be dipped back in, try them and you will see just how big of a difference quality really makes!\nVALUED PACK – 100Pcs of paintbrushes is not only convenient for using but also save your money in the long run. Children have a way of breaking and loosing things but with 100 paint brushes that’s not something you will ever worry about. great for classrooms, camps, painting party, arts and crafts and all kinds of kids painting projects.\nSMALL PAINT BRUSHES SET – These flat paint brushes have a 0.3in wide tip, 0.5in long brush hair and the total length is 6.7in, along with the quality brush tip makes these brushes perfect for all paints including acrylic, watercolor, oil, tempera, nails, enamel, ceramic, glass, and face paint. works on all surfaces as well such as rocks, wood, mirrors, canvas, paper, body.\nRETAINS FORM AFTER WASHING – These brushes wash easily and more importantly they retain their perfect form after washing. Wash in warm soapy water, use your hands to reshape the tip, and let them air dry. The tip will retain its form, the hair won’t shed, and the metal won’t rust. With proper care these brushes can be used hundreds of times\nWIDE APPLICATION – The bulk paint brushes for acrylic are suitable for kids, children, student, beginner or artist to create various artwork, Works well for wildlife, botanical, portraiture, doll, illustrations, miniature, model ships and airplanes, arts and craft, rock, leather, ceramic, nail and face art painting. Please feel free to contact us if you are not happy with the quality of our paint brushes, we will reply to you within 24 hours."
    },
    {
        "name": "Arts and Crafts for Kids Ages 4-8 8-12, 20 Pcs Unfinished Wood Slices with Gem Diamond Painting Stickers Kits Kids Wood Painting Craft Activities Kit Creative Art Toys Party Favors for Kids Boys Girls",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71T47PZfvQL._AC_UL400_.jpg",
            "description": "Arts and Crafts for Kids Ages 4-8 8-12, 20 Pcs Unfinished Wood Slices with Gem Diamond Painting Stickers Kits Kids Wood Pa..."
        },
        "totalReviews": 3,
        "rating": 5.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C4NHX23S",
        "url": "https://www.amazon.com/dp/B0C4NHX23S",
        "position": 49,
        "description": "DIY Crafts Kit for Kids: The combination of wood painting and diamond painting provides more options for kids crafts activities. Many accessories in our art supplies can make children enjoy themselves. They can use the wood slices and diamonds for design more cute and colorful wooden arts and crafts, which will give them hours of fun.\nAll Needs In One Set: Wood painting kits for kids ages 4-12, comes with 20 pieces wood slices, 2 sets of 12 colors of paint, 4 brushes, 2 gem stickers, a grid storage box with 10 colors diamonds, a glue, 2 diamond painting stickers, 2 diamond sticking pens, 2 plastic trays, 2 clay glue, diamond letter bags, red and white rope, and twine. No need to prepare more, just open the box, create kid's own wood arts & crafts!\nUnfinished Wood Slice Ornaments: Wood slices are rustic and made of natural pine wood with barks, lightweight and not easily broken. It is cut, dried, and polished to make the surface smooth for easy painting or writing. Wood rounds with small holes and using the ropes, easy to hang and decorate anywhere you want.\nPerfect Arts and Crafts Gifts: This creative art toys for kids ages 4-12, provide fun and happiness for your kids! Art kits will exercise child's ability in crafting and painting by making them by hand. Wood arts and crafts painting kit is a ideal gift for kids birthday party, kids creative activities, school art projects, family crafts, classroom party favors, and etc,.\nWide Applications: With a diameter between 3.15\"-4\" and thickness 0.39\", round wood slices can be used for creative art in various ways, suitable for painting, writing, carving, and decorating. Perfect Christmas decorations, home ornaments, wood coasters, gift tags, wood slices for centerpieces, wooden crafts, etc. A great arts and crafts supplies kit for kids, family and friends!"
    },
    {
        "name": "Amazon Basics Portable Foldable Photo Studio Box with LED Light, 1 Count (Pack of 1), Black, 25 x 30 x 25 Inches",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/911UKZb5yNL._AC_UL400_.jpg",
            "description": "Amazon Basics Portable Foldable Photo Studio Box with LED Light, 1 Count (Pack of 1), Black, 25 x 30 x 25 Inches"
        },
        "totalReviews": 3922,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 76.6,
            "priceFraction": "60",
            "beforePrice": 97.99
        },
        "asin": "B01GIL6EU4",
        "url": "https://www.amazon.com/dp/B01GIL6EU4",
        "position": 50,
        "description": "No assembly required with set-up in less than a minute; Collapses into a thin, portable, and durable portfolio case.\nMeasures 25'' x 30'' x 25'' to fit a variety of product sizes; Includes power supply, user manual, and pre-installed removable bright-white backdrop.\nHigh output built-in LED lights for handheld photography with a camera or smartphone. Lights are positioned for optimum contrast, and provide 5600k daylight balanced LEDs with high Color Rendering Index (CRI) for consistent color. An extra light provides directional light modelling like in a photo studio, giving better highlights, contrast, and shape to product images.\nA front 3-door system maximizes image angles while reducing outside reflections, and a top hole enables imaging from above.\nCompatible with Amazon Seller app; Shoot, edit, and directly upload catalog images to Amazon."
    },
    {
        "name": "Simetufy 12 Rocks Painting Kit, Glow in The Dark Rocks to Paint, Arts and Crafts for Kids, Smooth Flat Rocks with Art Supplies, Creative Outdoors Activity Kit for Boys Girls, Ages 4-6, 6-8, 8-12+",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/812qi60uBrL._AC_UL400_.jpg",
            "description": "Simetufy 12 Rocks Painting Kit, Glow in The Dark Rocks to Paint, Arts and Crafts for Kids, Smooth Flat Rocks with Art Supp..."
        },
        "totalReviews": 19,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C5WZXQ2H",
        "url": "https://www.amazon.com/dp/B0C5WZXQ2H",
        "position": 51,
        "description": "【The Kit Includes 】 12 natural gray river rocks, 6 glow-in-the-dark paints, 6 standard paints, transfer stickers, gold & silver glitter glue, 2 paintbrushes (fine tip and wider tip), googly eyes, sponge, and gem stickers. This kit contains it all to set your little artist up for a great art day.\n【Glow in the Dark】The kit includes glow-in-the-dark paints, so the art crafts you or your kids made can light up beautiful designs when the lights go out. Kids will love it! Start to create your rock painting with your kids, students, friends, and families, which develops hands-on ability and creativity.\n【Easy to Use】Whether you are a beginner or an experienced rock painter, drawing and designing these rocks is easy and enjoyable. The paint dried fairly quickly on the rock so it wasn’t hard to layer multiple colors. These rocks are smooth and have a perfect surface and shape. The paint stay on the rocks well after it dries.\n【Gift for All Ages】Simetufy rock painting kit is the perfect DIY gift for kids and adults to have fun with nature. A good outside activity to keep the kids busy and off the screens. Great for family craft night, Birthday gifts for kids, easter basket stuffers, Halloween decorations, etc. Suitable for ages 3 to 96.\n【Get Ready to Rock! 】Perfect outdoor activity for kids, suitable for party activities, and parent-child interaction. Spread kindness stones or hide them in your community. You may also have your craftwork in your home and garden. The paint washed off our hands easily (as well as off the brushes when you wanted to change colors).\n【Warm Tips & After Service】Cover the paint after use to prevent the paint from drying out; wash the brush after use and it can be reused. Feel free to message us through “contact sellers” if you have any questions."
    },
    {
        "name": "3D String Art Kit for Kids - 63 Pcs Birthday Gifts for Kids with 30 Multi-Colored LED Bulbs & 6 Balloons - Crafts for Girls and Boys Ages 6-12 - DIY Lantern Toys for Age 6 7 8 9 10 11 12 Year Old Girl",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/A18FpGX8-aL._AC_UL400_.jpg",
            "description": "3D String Art Kit for Kids - 63 Pcs Birthday Gifts for Kids with 30 Multi-Colored LED Bulbs & 6 Balloons - Crafts for Girl..."
        },
        "totalReviews": 13,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C611MSBT",
        "url": "https://www.amazon.com/dp/B0C611MSBT",
        "position": 52,
        "description": "All-Inclusive Kit: Our 63 Pcs 3D string art kit offers 6 balloons in 3 shapes - star, moon, and heart, along with 3 colors of gradient yarns, feathers, and beads. Kids can unleash their creativity by creating multiple styles of string art lanterns, allowing for endless customization and imaginative designs.\nGlow Up Your Creations: Illuminate your kids' artwork with our kit's multicolored 30-bulb LED string. It's lightweight, battery-operated, and hassle-free. No more tangled cords or heavy batteries. Add a touch of magic to any room with a mesmerizing glow. Feathers and beads make it a DIY dream catcher too, a comforting companion at night.\nKid-Friendly & Unleash Kids' Creativity: Our craft kit for kids features 3 shapes of 10-inch balloons, perfectly sized for children to handle and create with ease. With step-by-step instructions, children can follow along and unleash their artistic talents to make their own unique creations.\nLess Mess, Effortless Cleanup: The craft kit provides not only gloves but also a convenient plastic tablecloth to protect your workspace, making it easy to contain any mess and facilitating effortless cleanup. Additionally, each shape includes an extra backup balloon for practice and to prevent any potential mishaps.\nCrafted for Everyone, Perfect for Gifting: Present our craft kit in its captivating packaging. It's a perfect light-up gift for any occasion and age - birthdays, holidays, or simply a creative day at home. It's sure to impress both girls and boys as craft gifts, bringing joy and inspiration.\nParent-Child Bonding: Both kids and adult gloves are included, encouraging collaboration and shared creativity for a family project. Enjoy working together to create your stunning glowing lantern with our 3D string art kit. It's an experience that fosters communication, and teamwork, and strengthens the parent-child bond."
    },
    {
        "name": "klmars Bracelet Making Craft Kit for Girls,Jewelry Making Supplies Beads Charms Bracelets for DIY Craft Gifts Toys for Teen Girls Age 4 5 6 7 8 9 10 12",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Khfm8SGHL._AC_UL400_.jpg",
            "description": "klmars Bracelet Making Craft Kit for Girls,Jewelry Making Supplies Beads Charms Bracelets for DIY Craft Gifts Toys for Tee..."
        },
        "totalReviews": 2170,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 15.96,
            "priceFraction": "96",
            "beforePrice": null
        },
        "asin": "B091YSDCRX",
        "url": "https://www.amazon.com/dp/B091YSDCRX",
        "position": 53,
        "description": "Perfect Unicorn Mermaid Bracelet Making Gifts For Kids Girls, Charms Craft Supplies are great jewelry findings for your clip-on charms, dangle, earrings, bracelet, necklace pendants, keychain,\nSimple to Use - Unscrew to remove the end cap, After stringing in the beads, simply screw back the end cap tightly. NO TOOL, NO GLUE, NO MESS.\nGreat Gift Idea for Girls:making it a great gift item for girls who like DIY accessories. Also, it can be an entertaining party craft for girls.\nEverything you need– nothing left out, no more running around hardware stores trying to find the supplies kit.\nPackage include: 16x European big hole beads, 26x Charm and Pendants , 26x Colored beads, shamballa, rainbow, crystal beads 3x Snake chain bracelet and 3 Necklace Cords"
    },
    {
        "name": "MOISO Kids Crafts and Art Supplies Jar Kit - 550+ Piece Set - Make Bracelets and Necklaces - Plus Glitter Glue, Construction Paper, Colored Popsicle Sticks, Eyes, Pipe Cleaners",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81Clsj6GquL._AC_UL400_.jpg",
            "description": "MOISO Kids Crafts and Art Supplies Jar Kit - 550+ Piece Set - Make Bracelets and Necklaces - Plus Glitter Glue, Constructi..."
        },
        "totalReviews": 456,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 13.95,
            "priceFraction": "95",
            "beforePrice": 26.93
        },
        "asin": "B087G756LB",
        "url": "https://www.amazon.com/dp/B087G756LB",
        "position": 54,
        "description": "MASSIVE ARTS AND CRAFTS BUNDLE: Give children a platform to learn, create, and explore the depths of their imagination with this incredible 550 plus piece arts & crafts supplies kit, jam packed with tons of materials to make the most out of artful expression!\nCRAFTING AND JEWELRY MAKING: Give kids the greatest variety of artistic tools to encourage imaginative thinking and creative expression. Children can create beautiful bracelets, necklaces and other handmade jewelry with beads, buttons and stretchy string!\nFUN AND COLORFUL PIECES: Items include colorful pipe cleaners, pompoms, fun shaped sequins, googly eyes, foam letters, flowers, plastic beads, wooden sticks, paper scroll, 5 sticks of glue, plastic safety scissors, acrylic sparkly diamonds and a plastic storage bottle,etc.\nBRING FUN TO THE CLASSROOM: This is the perfect item to bring into any nursery, daycare, or classroom! Having a tool like this in the play area helps children freely express themselves and learn to cooperate and share with peers, further enriching their growth and development.\nEASY CLEANUP AND STORAGE: All of these incredible arts and crafts supplies come perfectly stored in a re-closable jar for easy storage. Having a designated unit to stow away all of the art materials makes cleanup a hundred times faster and easier for short child attention spans."
    },
    {
        "name": "Simetufy 20PCS Rocks for Painting, 5 Pcs 2''-3''/10Pcs 1.6''-2''/5 Pcs 1.2'' Rocks to Paint, Flat Rocks for Painting, Arts & Crafting, Natural River Rocks for Kids, Kindness Stones for DIY Painting",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/716xXht5tEL._AC_UL400_.jpg",
            "description": "Simetufy 20PCS Rocks for Painting, 5 Pcs 2''-3''/10Pcs 1.6''-2''/5 Pcs 1.2'' Rocks to Paint, Flat Rocks for Painting, Arts..."
        },
        "totalReviews": 19,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": 7.98
        },
        "asin": "B0C5WW4M67",
        "url": "https://www.amazon.com/dp/B0C5WW4M67",
        "position": 55,
        "description": "【Size & Quantity】You will get 20 pcs natural rocks for painting, which included 5 pcs large rocks (2-3 inches), 10 pcs medium rocks(1.6-2 inches), and 5pcs small rocks(1.2inches). Assorted sizes to meet your various creative needs.\n【Easy for Painting】Drawing and designing these rocks is easy and enjoyable. You may have your craftwork in your home and garden. The color of our rocks is gray, easy to show the color of acrylic paint, markers pens, chalk markers, alcohol inks, etc.\n【Smooth & Flat Rocks】Simetufy bulk natural painting stones are hand-selected products with flat shapes, smooth surfaces and edges, and no potholes or cracks, they perfect DIY rock painting for kids and adults to have fun with nature. Suitable for ages 4 to 96.\n【Education, Inspire & Share】Start to create your rock painting with your kids, students, friends, and families, developing hands-on ability and creativity. Make your kindness on rocks, then hide them around the town for people to find.\n【Warm Tips & After Service】Since the size of the natural stones above is measured by hand, the size and shape of the item you received could be slightly different. Feel free to message us through “contact sellers” if you have any questions."
    },
    {
        "name": "AyuqEjus Diamond Painting Kits for Kids,4 Pack Diamond Art for Kids, Arts & Crafts for Kids Ages 8-12,Gem Art 5.9\" X 5.9\" (Cat Tiger Dog)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/915VeF5NesL._AC_UL400_.jpg",
            "description": "AyuqEjus Diamond Painting Kits for Kids,4 Pack Diamond Art for Kids, Arts & Crafts for Kids Ages 8-12,Gem Art 5.9\" X 5.9\"..."
        },
        "totalReviews": 1,
        "rating": 5.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C8S7QCWH",
        "url": "https://www.amazon.com/dp/B0C8S7QCWH",
        "position": 56,
        "description": "4 PCS DIAMOND ART KITS:AyuqEjus diamond art kits contains:4 wax, 4 trays, 4 pen and 4 canvases(frame not including),4 packs of resin diamond particles,meet more of your needs.\nWONDERFUL GIFT:A great gift for birthdays, Christmas, Thanksgiving, New Years and other exceptional occasions. You can provide it to yourself to pass the time; as a reward for your children; as a surprise for your grandchildren; it can also be a gift for children to give to each other.\nEASY TO MAKE: Our diamond painting canvases measure 5.9 inches on a side and are beginner or kid friendly, a fantastic activity and experience for little ones!\nGREAT FAMILY ACTIVITY:During the production process, you will enhance concentration, hands-on ability and color recognition. It's extremely rewarding when it's done.Effectively promote communication, exchange and interaction between partners.\nEXCELLENT QUALITY:High-quality resin diamonds are not easy to fade, do not drop diamonds, and can be used with peace of mind. In case of quality problems, we promise to provide you with a worry-free return service."
    },
    {
        "name": "Cheffun Sea Animals Paper Craft Kit - Sea Animal Themes Toddler Arts and Crafts for Kids 4-6 6-8 4-8, Kids Arts & Crafts Ages 4-8 for Toddlers 3-4 Years, Kids Art and Craft Supplies Kit for Kids 6-9",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81i6hqpV5NL._AC_UL400_.jpg",
            "description": "Cheffun Sea Animals Paper Craft Kit - Sea Animal Themes Toddler Arts and Crafts for Kids 4-6 6-8 4-8, Kids Arts & Crafts A..."
        },
        "totalReviews": 153,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 13.98,
            "priceFraction": "98",
            "beforePrice": null
        },
        "asin": "B0BYDLJSCL",
        "url": "https://www.amazon.com/dp/B0BYDLJSCL",
        "position": 57,
        "description": "🦑CHEFFUN SEA ANIMALS CRAFT KIT - Our craft kit includes 9 pre-cut sea animal character papers, cute materials like pipe cleaners, googly eyes, pom poms, buttons, and more! Perfect for creating fish, whale, coral, ray fish, shark, jellyfish, squid, seal, crab, shell, and more!\n🦑MESS-FREE AND EASY TO USE - No more struggling with scissors! Our craft kit is easy to remove and doesn't require scissors. The kit comes with a glue stick, pipe cleaners, pom poms, paper strips, googly eyes, buttons, and pre-cut paper so your child can create their sea animal characters with ease.\n🦑PERFECT FOR AGES 3-8 - Our craft kit is perfect for kids ages 3-8 who love arts and crafts. It's a great way to keep toddlers and young children entertained and engaged in a fun activity that also helps develop their fine motor skills.\n🦑ARTS AND CRAFTS FUN - Our craft kit is perfect for both boys and girls who love arts and crafts. It includes everything your child needs to create their sea animal characters, and they'll love showing off their creations to family and friends.\n🦑 GREAT VALUE - Our craft kit includes everything your child needs to create their sea animal characters, and at a great price. It's the perfect gift for birthdays, holidays, or any occasion. Plus, with detailed instructions included, your child can get started right away!"
    },
    {
        "name": "Darice 500 Pcs Colored Popsicle Sticks for Crafts, 4.5\" Colorful Wooden Rainbow Craft Sticks Supplies, STEM DIY Art, Ages 3+",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81WD4vd1YYL._AC_UL400_.jpg",
            "description": "Darice 500 Pcs Colored Popsicle Sticks for Crafts, 4.5\" Colorful Wooden Rainbow Craft Sticks Supplies, STEM DIY Art, Ages 3+"
        },
        "totalReviews": 31,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 11.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C46VSHM5",
        "url": "https://www.amazon.com/dp/B0C46VSHM5",
        "position": 58,
        "description": "BULK SET: Package Includes 500 4.5” colorful popsicle sticks, neatly divided and packaged in multiple units.\nRAINBOW STICKS: Take crafting up a notch with colored wooden sticks. Colors include Red, Orange, Yellow, Green, Blue & Purple.\nUSAGE VARIETY: Serves a wide application purpose and you can use these fun sticks to your heart’s desires.\nCRAFT SUPPLIES: Popsicle sticks for crafts are perfect for all do it yourself project and a favorite preschool classroom essential.\nNATURAL WOOD: Composed of natural wood, rounded edges and a smooth finish. Darice Wood Sticks are non-toxic and safe for little hands."
    },
    {
        "name": "Art Craft Glitter, 3mm Heart Shaped Sequins Confetti for Nail Art,Slime Supplies, Resin Craft, Home Decoration DIY Cards - 0.35oz (Macaron Mixed Colors)",
        "leftInStock": "Only 20 left in stock - order soon.",
        "image": {
            "url": "https://m.media-amazon.com/images/I/51W8DnfQhoL._AC_UL400_.jpg",
            "description": "Art Craft Glitter, 3mm Heart Shaped Sequins Confetti for Nail Art,Slime Supplies, Resin Craft, Home Decoration DIY Cards -..."
        },
        "totalReviews": null,
        "rating": null,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 5.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0CD6LDJFR",
        "url": "https://www.amazon.com/dp/B0CD6LDJFR",
        "position": 59,
        "description": "☆Color & Shape: silver shining star glitter, high-quality for brighter and clear color\n☆Small Package: packed with 0.35 oz(10 g) in each bag to avoid waste\n☆Perfect for Art Craft: fine 0.11 in (3mm) plastic confetti for home made DIY crafts; ideal for decorating any surface to sparkle\n☆Other Applications: add the tiny holographic star flake pieces in slime for glossy nail arts, shimmering dresses and other customize purposes\n☆Use with Creativity: apply the glitter on everything, phone cases, personal belongings, shaker cards, break the limit of your imagination and boast your master pieces"
    },
    {
        "name": "8Pcs Christmas Diamond Painting Coasters, Diamond Art Coasters with Holder, DIY Diamond Painting Kits for Adults, Kids & Beginners, Diamond Art Kits Craft Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81B7ySljSSL._AC_UL400_.jpg",
            "description": "8Pcs Christmas Diamond Painting Coasters, Diamond Art Coasters with Holder, DIY Diamond Painting Kits for Adults, Kids & B..."
        },
        "totalReviews": 1,
        "rating": 1.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C9CKYCMK",
        "url": "https://www.amazon.com/dp/B0C9CKYCMK",
        "position": 60,
        "description": "❆YOU WILL GET❆ 8 pieces of Christmas diamond painting coasters, 8 pieces of cork pads, 1 piece of iron coaster holder, 18 packs colored diamond dots, 1 piece of clay glue, 1 piece of point drill pen and 1 piece of diamond tray, Perfect diamond painting kits for adults kids, offer hours of fun and create a sparkling artworks!\n❆upgraded premium material:❆Our diamond painting coasters are made of high quality .Compared with other ordinary diamond painting coasters with holder, we use a one-piece thickened wood base. The pattern and numbers are clear and easy to read. It has strong adhesion, Christmas diamond art kits is not easy to fall off.\n❆diy gift ❆ Different Christmas patterns with vibrant colors, Christmas cartoon diamond painting coasters, those beautiful artworks with functionality are definitely the best gifts to give someone on housewarming and Christmas. Gorgeous addition to Christmas party, dining table, kitchen, living room or bedroom.\n❆no more damage & mess❆ 4 inch Christmas diamond painting coaster are wide enough that you don’t have to worry about accidental coffee stains. Thick wood base protects dining and coffee tables from rings created by hot drinks; furniture countertop from scratches or worn, and not sticking to your glassware.\n❆about after-sales❆ After receiving the diamond art kits, check the dimond painting coasters and accessories first. If there are less diamonds or damage, you can contact us through customer service, we will provide solutions within 24 hours."
    },
    {
        "name": "iBayam Art Supplies, 149-Pack Drawing Kit Painting Art Set Art Kits Gifts Box, Arts and Crafts for Kids Girls Boys, with Drawing Pad, Coloring Book, Crayons, Pastels, Pencils, Watercolor Pens & Cakes",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81qjdOQaFaL._AC_UL400_.jpg",
            "description": "iBayam Art Supplies, 149-Pack Drawing Kit Painting Art Set Art Kits Gifts Box, Arts and Crafts for Kids Girls Boys, with D..."
        },
        "totalReviews": 16,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C1N8PP7Y",
        "url": "https://www.amazon.com/dp/B0C1N8PP7Y",
        "position": 61,
        "description": "🎨【All-in-one Art Set】 Our drawing art set includes 33 watercolor pens, 12 colored pencils, 12 oil pastels, 12 crayons, 12 watercolor cakes, and other art tools, like the palette, sharpener, eraser, and brush pen. It's worth mentioning that we have special 10 sheets/ 20 pages coloring book, 10 sheets drawing pad, and 43 paper clips. What your kids want, there are all in this art kit, giving them everything they need to explore their creativity and create stunning artwork.\n🎨【Endless Possibilities】 With a wide range of art supplies, including watercolors, pencils, paints, crayons, and accessories, this 149 pieces art set provides endless hours of creative fun and exploration. By engaging in various art activities, children can unleash their imagination and enhance their fine motor skills while developing a love for art. Bring your kids’ imagination to life and enjoy the world of art.\n🎨【Versatile Walking Artist】 Whether your child is a beginner or an aspiring little artist, this comprehensive drawing painting set is perfect for all skill levels and various art techniques like sketching, coloring, painting, graffiti works, and more for kids, students, boys, girls, teens, adults, painting workers, artists. It comes neatly organized in a lightweight case, making it easy to take your creativity wherever you go, encouraging self-expression and boosting your confidence.\n🎨【Promotes Artistic Development】 This coloring stuff encourages the kids’ imagination and creativity by providing endless possibilities for drawing, painting, and coloring activities. Perfect for arts and crafts projects at home, school, or on the go, allowing kids to express themselves artistically wherever they are, keep your child entertained for hours as they experiment with different mediums, colors, and techniques.\n🎨【Great Gift Ideas】 Our art supplies are made with the finest materials, ensuring vibrant colors, smooth application, and long-lasting results. You can create professional-looking artwork with confidence. Whether it's a birthday, holiday, party, Children's Day, Christmas Day, or just a special treat, this art set is an excellent gift option for any aspiring artist. Let their imagination soar with this fantastic arts and crafts kit."
    },
    {
        "name": "HULASO Arts and Crafts for Girls Ages 6-12 Make Your Own Flower Bouquet with Buttons and Felt Flowers, DIY Activity Supplies Vase Art and Craft Kits Birthday Gifts for Girls 6 7 8 9 10 11 12 Year Old",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81pHTlueIKL._AC_UL400_.jpg",
            "description": "HULASO Arts and Crafts for Girls Ages 6-12 Make Your Own Flower Bouquet with Buttons and Felt Flowers, DIY Activity Suppli..."
        },
        "totalReviews": null,
        "rating": null,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C8SY75YL",
        "url": "https://www.amazon.com/dp/B0C8SY75YL",
        "position": 62,
        "description": "【Comes with All Craft Supplies Your Kids Need】This button felt bouquets craft Kit comes with large buttons *100 , small buttons *100 , carnation petals *50, four Leaf clover petals *50, 2 sheets of gem stickers, fluffy slime*16, iron wires*2, double-sided tape *1, decoration flowers*2 and quality glass base *2.\n【Gift-Ready Package & Unique Gift】Don’t worry about the packaging! The beautiful box is ready for wrapping and giving. A unique gift for Christmas, holidays or birthday. Children will improve their hands-on skills and stay away from TV and video games to get beautiful flowers decoration, they can also give flowers to their mother, grandma or teacher s after they finish the craft.\n【Safety and Art Education】Our art and craft kit is made of high-quality materials, safe and non-toxic, allowing children to use it with confidence. This product is a combination of artistic creation and manual labor, which can enhance children's artistic aesthetics and handcrafting abilities.\n【Flower Decoration & Be a Gift Again】The flowers and decorations in our tool kit are colorful and very beautiful. After completing the handicraft, kids can place the vase on bookshelves, tables, windows, bed cabinets, and other places to decorate your own house, which is both warm and meaningful. Kids can also give flowers to their mother, grandma or teacher s after they finish the craft.\n【Only for You】Quality is our top priority, any product problem please feel free to contact us, we will definitely solve the problem for you. Enjoy your Shopping now!"
    },
    {
        "name": "Diamond Painting Kits for Kids - Arts and Crafts for Kids Ages 8-12 - 5D Diamond Gem Art by Number Full Drill Dots - DIY Art & Craft Supplies for 6 7 8 9 10 Year Old Girl Boys Birthday Gifts (4Pcs)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/911r1XLADcL._AC_UL400_.jpg",
            "description": "Diamond Painting Kits for Kids - Arts and Crafts for Kids Ages 8-12 - 5D Diamond Gem Art by Number Full Drill Dots - DIY A..."
        },
        "totalReviews": 33,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 11.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BZH2HHMV",
        "url": "https://www.amazon.com/dp/B0BZH2HHMV",
        "position": 63,
        "description": "Package includes 4 pre-printed canvas, 4 diamond painting stylus, 4 tray, 4 wax square, 1000+ colorful gems.\nBased on the same concept as mosaics and paint-by-numbers, diamond art is easy and quick. No glue, no mess!\nDiamond painting is enjoyable activity, fun crafts you can make with your kids.\nUnleash your kids' creativity! Great for hand-eye coordination, fine motor skills, pretend play, and self-confidence.\nCreate your own unique sparkly diamond painting right away! Great for birthdays, parties, after school fun, summer projects and holidays!"
    },
    {
        "name": "Brown Wrapping Paper, Craft Paper, Kraft Paper Roll 17.8\"x 100ft (1200 Inch) for Gift Wrapping, Floor Covering, Bulletin Board, Arts Crafts, Bouquet Flower, Poster, Packing Paper for Moving Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71dOx9wrcvL._AC_UL400_.jpg",
            "description": "Brown Wrapping Paper, Craft Paper, Kraft Paper Roll 17.8\"x 100ft (1200 Inch) for Gift Wrapping, Floor Covering, Bulletin B..."
        },
        "totalReviews": 280,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BQTYYVZH",
        "url": "https://www.amazon.com/dp/B0BQTYYVZH",
        "position": 64,
        "description": "Your Best Choice of Brown Kraft Wrapping Paper, Craft Paper, and Packing Paper. This kraft paper roll size is 17.8” x 1200” (100ft), made of recycled paper material. Better alternative of cellophane wrap, plastic bubble wrap and foam cushioning. Recyclable, environmentally friendly, degradable, renewable green packaging materials, can be used for all kinds of product packaging, protecting fragile items, storing belongings securely.\nThick and Durable Paper. Made with industrial grade heavy duty paper, Vanhench brown wrapping paper roll is sturdy and durable, does not rip or tear easily. The kraft paper roll can be used as parcel packing paper, great protection for shipping, packing and moving, better alternative to newsprint paper sheets and construction paper for arts and crafts paper. Meets your needs for everyday use.\nPerfect Craft Art Supplies. Unleash your creativity with this unwaxed and uncoated brown craft art paper, it can be used for arts and crafts, drawing supplies, coloring, painting, flower wrapping, gift wrapping, bouquet wrapping, packing, protecting floors and more. Use these brown paper rolls for acrylic paint, oil paints, chalk, crayon, markers, felt pens, finger painting, origami, watercolor and tempera paint.\nVanhench Huge Wrapping Paper Supply. Comes in size 17.8 inches wide and 100 feet long roll, fit to 17.8\" paper roll dispenser/cutter. Can be cut down to any size or shape. With this paper roll, you will have near endless bulk supply brown paper and at your disposal and will allow you to cut and slice it as needed.\nIdeal Wrapping Paper for home, school and office supplies. The must have paper roll item in your packing, boxing, moving, floor covering, wall art, table runner, shipping, sketching, coloring, drawing and painting supplies. Use it for wrapping Christmas, birthday, mother day, valentines day gifts or wedding gifts. Great as wrapping paper, craft paper, poster paper, packing paper for moving, kraft paper, brown paper roll, flower wrapping paper, bouquet wrapping paper, bulletin board paper."
    },
    {
        "name": "8 Pcs Halloween Diamond Paintings Coasters Kits with Holder, DIY Jack and Sally Coaster Diamond Art Kits,Full Drill Rhinestone Painting Kits for Adults & Kids,Beginners Art Craft Supplies",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81iwE8qVhNL._AC_UL400_.jpg",
            "description": "8 Pcs Halloween Diamond Paintings Coasters Kits with Holder, DIY Jack and Sally Coaster Diamond Art Kits,Full Drill Rhines..."
        },
        "totalReviews": null,
        "rating": null,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 16.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C98VXW6W",
        "url": "https://www.amazon.com/dp/B0C98VXW6W",
        "position": 65,
        "description": "Jack and Sally"
    },
    {
        "name": "Mega Arts and Crafts Supplies Kit for Kids - Boys and Girls Age 4 5 6 7 8 Years Old - Toddler Art Set Activity Materials Bag - Great for Preschool, Kindergarten, and Homeschool DIY Crafting Projects",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/A1hb5q5rCWL._AC_UL400_.jpg",
            "description": "Mega Arts and Crafts Supplies Kit for Kids - Boys and Girls Age 4 5 6 7 8 Years Old - Toddler Art Set Activity Materials B..."
        },
        "totalReviews": 711,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.97,
            "priceFraction": "97",
            "beforePrice": null
        },
        "asin": "B087T6F6D2",
        "url": "https://www.amazon.com/dp/B087T6F6D2",
        "position": 66,
        "description": "ULTIMATE CRAFT BAG: Comes with everything your girls and boys need to starting crafting. All conveniently stored in a handy & reusable PVC bag with handles. With easy storage and clean up, it’s perfect for all kinds of crafts!\nENORMOUS ASSORTMENT: Materials included are 150 pipe cleaners, 50 metallic pipe cleaners, 245 assorted size pom poms, 5 jumbo pompoms, 95 glitter pom poms, 4 glitter glue pens, 1 safety scissor, 200 adhesive googly eyes (in assorted colors and sizes), 30 wooden colorful craft popsicle sticks, 100 craft matchsticks, 30 foam letter & number stickers, 30 glitter foam sticker shapes, 50 colorful craft feathers and 1000 sequins/spangles. (Some items are packed by weight—quantities are approx.)\nEASY TO STORE & CARRY: Clean up time is a breeze! Each craft item comes neatly packed in small zipper bags, all conveniently stored in a reusable PVC bag that allows your kids to store and transport them without any hassle. Take them on-the-go for car rides, camping, vacations, friend’s houses, after school and more!\nBRAIN-BOOSTING FUN: Creativity promotes fine motor skills, problem-solving and even emotional wellness. Whether you need items for your classroom, daycare art center, prek science projects, elementary craft stations or beyond, we've got you covered!\nNON-TOXIC MATERIALS: When you set your kids up at the craft table, you want them to dive in and have fun! The last thing you want to have to worry about is safety. Our products are made from non-toxic materials so your kiddos can get crafty without worry over exposure to toxic chemicals."
    }
]