{
    "query": "Art and Craft Supplies",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Create Unique Art with this Paint Your Own Mandala Stones Kit - Complete Starter Kit",
            "path": "https://shopee.sg/Paint-your-own-Mandala-stones-Kit-Complete-Starter-Kit-Children-art-craft-activity-kit-Creative-skills-i.54456685.10568183909",
            "image": "https://down-sg.img.susercontent.com/file/c6e563404843cbe83a92a965de82089a",
            "price": 2390000,
            "location": "SG",
            "rating": 0,
            "sold": 1,
            "description": "Unleash your creativity with this Paint Your Own Mandala Stones Kit, perfect for creating unique pieces of art that will wow friends and family. This complete starter kit includes 4 large rocks, 5 acrylic paints, 2 high-quality paint brushes, 5 dotting tools of varying thickness, and a 24-page book with step-by-step instructions and photography on how to create stunning pieces. **Paint could look dried up, kindly mix with few drops of water for a minute before using."
        },
        {
            "title": "Sakura Zentangle White Tile-Tool Set A | Arts & Crafts Drawing & Doodling",
            "path": "https://shopee.sg/Sakura-Zentangle-White-Tile-Tool-Set-A-Home-Stationery-Arts-Craft-Drawing-Doodling-i.190961827.5004938767",
            "image": "https://down-sg.img.susercontent.com/file/966aec3369f9b312a4079f58a64426a0",
            "price": 2214000,
            "location": "Malaysia",
            "rating": 5,
            "sold": 1,
            "description": "Create amazing art with the Sakura Zentangle White Tile-Tool Set A! This set includes a Pigma Micron 01 (Black), Pigma Micron 03 (Black), Pigma Micron 05 (Black), Pencil (Black), Tortillion, and 5 Zentangle Tiles (White) 89mmx89mm. It is easy to learn, relaxing and fun, and the ink dries quickly and does not bleed through the thinnest paper. Be sure to replace the cap tightly after use to prevent the ink from leaking, and take care when handling products with a sharp tip. Terms and conditions apply, please read carefully before purchase."
        },
        {
            "title": "500pcs Art & Craft Matchsticks DIY Wooden Sticks for Kindergarten Children",
            "path": "https://shopee.sg/Matchstick-Wooden-Sticks-Kindergarten-Children-Art-Craft-DIY-500pcspkt-i.27846050.3339489534",
            "image": "https://down-sg.img.susercontent.com/file/b7e8465f38324a58fbf8321b4825082e",
            "price": 450000,
            "location": "SG",
            "rating": 5,
            "sold": 3,
            "description": "Get creative with these 500pcs Art & Craft Matchsticks! Made from high-quality wood, these matchsticks are perfect for DIY projects, art and craft activities, and more. Suitable for children aged 3 and up, these matchsticks come in a convenient OPP Bag for easy storage and transport. Note: The quantity may vary slightly due to weight."
        },
        {
            "title": "50pcs Hollow Gear Laser Cut Wooden Craft Art Decor Embellishments",
            "path": "https://shopee.sg/50pcs-Mixed-Hollow-Gear-Laser-Cut-Wooden-Wood-Craft-Art-Decor-Embellishment-i.140625866.2476086884",
            "image": "https://down-sg.img.susercontent.com/file/6d9fab34db9faee1b6feb41fa5c1f3c5",
            "price": 323000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 1,
            "description": "Create beautiful decorations with these 50 pieces of laser cut wooden craft embellishments! Perfect for home wall hangings, wedding favors, gift tags, card making, scrapbooking, plaques and other art projects. Made from high quality wood, these pieces can be decorated with stains, inks, paint and more. Each piece measures approximately 0.98 - 1.97 inches. Get creative and start crafting!"
        },
        {
            "title": "Create Your Own Masterpiece with 20x20cm DIY Canvas Oil Painting By Numbers Art & Craft Set",
            "path": "https://shopee.sg/SG-Ready-Stock-20x20cm-NEW-DIY-Canvas-Oil-Painting-By-Numbers-Art-Craft-Children-Birthday-Goodies-Christmas-Gift-i.89705380.6771718002",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfp-lfij0yrrx60rd0",
            "price": 399000,
            "location": "SG",
            "rating": 4.934065934065934,
            "sold": 23,
            "description": "Transform any space into a work of art with this 20x20cm DIY Canvas Oil Painting By Numbers Art & Craft Set! This set comes with a printed art canvas, a guided picture, a set of acrylic paints, a set of 2 nylon brushes, and 2 sets of screws and hooks. Perfect for children's birthdays, Christmas, or any other special occasion, this set is sure to bring out the artist in everyone. Note: Please allow +/- 1cm measuring deviation due to manual measurement. Colors may vary due to differences in monitor and display effect."
        },
        {
            "title": "150pcs Kids Art Set - Drawing and Painting Set - Crayons, Markers, Watercolors, Pencils",
            "path": "https://shopee.sg/SG-Seller-150-pcs-Art-Set-for-Kids-Drawing-and-Painting-Set-Craft-tool-Color-Crayons-Markers-Water-Color-Pencil-i.335595182.11257718177",
            "image": "https://down-sg.img.susercontent.com/file/7c3532b67ebafeaa04674b60185c6c94",
            "price": 900000,
            "location": "SG",
            "rating": 5,
            "sold": 3,
            "description": "Get creative with this 150-piece Kids Art Set! Perfect for children ages 3 and up, this set includes 24 color crayons, 36 color markers, 24 color oil pastels, 24 color pencils, 12 color powder pigments, 20 plastic paper clips, 1 ruler, 1 pencil, 1 rubber, 1 pencil sharpener, 1 plastic scissors, 1 pigment brush, 1 pigment tray, 1 glue, 1 white plastic, 1 stapler, and more. Everything you need to get your little artist started!"
        },
        {
            "title": "Fimo Slices for Slime & Nail Art Crafting Supplies",
            "path": "https://shopee.sg/Slime-Supplies-Fimo-Slices-Nail-Art-Craft-Supplies-i.236457540.7760268599",
            "image": "https://down-sg.img.susercontent.com/file/b7bc463e1ae293f115f054a59bf911ce",
            "price": 200000,
            "location": "SG",
            "rating": 5,
            "sold": 12,
            "description": "Get creative with our Fimo Slices! Each pack contains 25g of mystery mixed slices, perfect for slime and nail art crafting. Minimum order of $12 and get extra freebies! Start creating your masterpiece today!"
        },
        {
            "title": "[Local Seller] DIY Art Craft Supplies Set for Kids Toddlers - Create Fun Projects with Pipe Cleaners, Eyeballs & More!",
            "path": "https://shopee.sg/Local-Seller-DIY-Art-Craft-Sets-Supplies-For-Kids-Toddlers-Modern-Kid-Crafting-Supplies-Kits-Include-Pipe-Cleaners-Ey-i.431209658.15690648719",
            "image": "https://down-sg.img.susercontent.com/file/b294363247360418445183e9b4a706e1",
            "price": 1200000,
            "location": "SG",
            "rating": 0,
            "sold": 5,
            "description": "Get creative with this DIY Art Craft Supplies Set for kids and toddlers! This modern kid crafting supplies kit includes a variety of materials such as pipe cleaners, googly eyes, fur balls, sequins, buttons, wooden popsicle sticks, safety scissors and paper jam. Let your children explore their imaginations and develop their innovative abilities while having fun! The materials are easy to use and safe for your children. Get your set today and let your kids create amazing projects at home or school!"
        },
        {
            "title": "32pc Set Plastic Rod Paint Brushes - Acrylic, Oil & Watercolour Painting Tool",
            "path": "https://shopee.sg/32pcsSet-Plastic-Rod-Flat-Paint-Brushes-Acrylic-Oil-Watercolour-Painting-Tool-Craft-i.96459080.3341585229",
            "image": "https://down-sg.img.susercontent.com/file/e8c3cb8eac5321322d6e195e8abc8d9c",
            "price": 419000,
            "location": "Mainland China",
            "rating": 4.8977272727272725,
            "sold": 11,
            "description": "Get creative with this 32pc set of plastic rod paint brushes! Perfect for acrylic, oil and watercolour painting, these brushes are ideal for painting classes, training, games, parties, art, miniatures, scale models, face and body painting. Featuring synthetic nylon hair and a long service life, these brushes are easy to clean and convenient to carry. Get yours today!"
        },
        {
            "title": "30PCS Kids Paint Sponges - Early Learning Painting Brushes Stamps Foam Art Craft Drawing Tools for Toddlers & Kids",
            "path": "https://shopee.sg/SG-Seller-Kids-Paint-Sponges-Early-Learning-Kids-Toddlers-Point-Brushes-Stamps-foam-Art-Craft-Drawing-Tools-30PCS-G-i.255292169.13492148665",
            "image": "https://down-sg.img.susercontent.com/file/8b8e2bc279b80c3817eb4c569f7a3d21",
            "price": 579000,
            "location": "SG",
            "rating": 4.888888888888889,
            "sold": 2,
            "description": "Unleash your kids' creativity with this 30-piece kids paint set! Featuring different design paint sponges and rollers, this set is perfect for early learning and ideal for age 3+. The colorful sponges are easy to clean and operate, and the washable paint pad (sold separately) is perfect for mess-free fun. Get your kids started on their artistic journey with this 30-piece set!"
        },
        {
            "title": "🎁Educational Art n Craft Toy Set for Kids - Goodie Bag Gift for Children's Day - Stay Home Activity",
            "path": "https://shopee.sg/EVA-Foam-Art-n-Craft-Educational-toy-Kids-Goodie-Bag-Children-Day-Gift-Stay-home-Activity-i.8121841.4726607008",
            "image": "https://down-sg.img.susercontent.com/file/048da80087a7d04057a628eae52c664b",
            "price": 117000,
            "location": "SG",
            "rating": 4.902439024390244,
            "sold": 8,
            "description": "🤩Stock up on this educational art n craft set for kids - perfect for a goodie bag gift for Children's Day or a stay home activity! Includes 5 pieces of EVA foam (each measuring 18.5 x 2.6cm). Minimum purchase of 5 pieces or below 5 pieces if total purchase amount is more than $5 with other items from our shop (excluding shipping fee). PM us if you need lesser than that."
        },
        {
            "title": "Marie's Acrylic Colour Waterproof Paint - 50ml Arcylic Colors for Art Supplies, Stationery, Crafts & Student Projects",
            "path": "https://shopee.sg/NEW-ARVL-Maries-Acrylic-Colour-Waterproof-Paint-Arcylic-Colors-50ml-Cat-Arklirik-Art-Supplies-Stationery-Craft-Studen-i.550052911.21835085639",
            "image": "https://down-sg.img.susercontent.com/file/0403e0be6613a18d6c05502854e4cdd9",
            "price": 529000,
            "location": "Malaysia",
            "rating": 5,
            "sold": 0,
            "description": "Create stunning works of art with Marie's Acrylic Colour Waterproof Paint! This 50ml set contains 32 vibrant colors perfect for all types of painting. Perfect for paper, fabric, wood, metal and more, this set is ideal for art projects, stationery, crafts and student use. Get inspired and unleash your creativity with Marie's Acrylic Colour Waterproof Paint! Welcome to Colourhands Studio for all your canvas painting needs and more. Shop now and get creative!"
        },
        {
            "title": "Assorted Fimo Slices, Nail Art and Craft, Resin Art Supplies",
            "path": "https://shopee.sg/Slime-Supplies-Fimo-Slices-Nail-Art-and-Craft-Resin-Art-i.236457540.5962445965",
            "image": "https://down-sg.img.susercontent.com/file/cdc1397d62ebc0be2c6a5822a0bab45f",
            "price": 1200000,
            "location": "SG",
            "rating": 5,
            "sold": 1,
            "description": "Get creative with this selection of 25g of assorted Fimo slices, nail art and craft, and resin art supplies. Perfect for adding a unique touch to your projects!"
        },
        {
            "title": "12 Colors Acrylic Painting Pigment Paint Brush Set - Perfect for DIY Art Craft & Drawing",
            "path": "https://shopee.sg/JULA-12-Colors-Acrylic-Painting-Pigment-Paint-Brush-Set-DIY-Art-Craft-Drawing-Tool-i.129924052.2299263591",
            "image": "https://down-sg.img.susercontent.com/file/26abd496eae076a24efc1c24f8181f30",
            "price": 186000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Get creative with this 12 Colors Acrylic Painting Pigment Paint Brush Set! Perfect for artwork, art projects, school projects, and more, this set includes a paintbrush and 12 colors of acrylic paint for you to express your imagination. Acrylics can be used on both smooth and textured surfaces, giving you more flexibility with your projects. The paintbrush is sent randomly. Ideal for parties, pubs, makeup, glow, and more, this skin-friendly, washable, and UV-resistant set is perfect for your next project!"
        },
        {
            "title": "Diamond Gem Art Craft Kit - Create Beautiful Mermaid, Unicorn, Dinosaur and Butterfly Artworks!",
            "path": "https://shopee.sg/Diamond-Gem-Art-Craft-Kit-i.14962.7715802818",
            "image": "https://down-sg.img.susercontent.com/file/a1b56a73e7a74f2f282b2fb999466791",
            "price": 800000,
            "location": "SG",
            "rating": 5,
            "sold": 0,
            "description": "Get creative with this Diamond Gem Art Craft Kit! Perfect for ages 5 and up, this fun and easy-to-use set includes a picture board, gems, tool, tray and wax to create a blinging masterpiece. Featuring 4 designs - Mermaid, Unicorn, Dinosaur and Butterfly - this kit is sure to provide hours of creative fun! Follow the easy number guide and create a beautiful artwork to show off!"
        },
        {
            "title": "Journamm 80pcs Vintage Paper for Phone Decoration | Craft Paper for Junk Journal, Scrapbooking & Labeling",
            "path": "https://shopee.sg/Journamm-80pcs-Cute-Vintage-Paper-for-Phone-Decoration-Stationery-Supplies-Craft-Paper-Junk-Journal-Label-Scrapbooking-Material-i.392853638.10605791396",
            "image": "https://down-sg.img.susercontent.com/file/34fa49ae93edc07f390135a564b591d2",
            "price": 200000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Get creative with Journamm's 80pcs of vintage paper! Perfect for phone decoration, crafting, junk journaling, labeling, and scrapbooking. Each paper measures 46*68mm and weighs 22g. Follow us to receive exclusive coupons and discounts. We strive to offer the best quality and most sincere service. Buy now and leave us a 5-star review if you're satisfied!"
        },
        {
            "title": "20pc Assorted Color Resin Flatback Cabochon Embellishments - Mermaid Tail, Shell, Starfish DIY Crafts",
            "path": "https://shopee.sg/20-Pieces-Lots-Mixed-DIY-Flatbacks-Resin-Flat-Back-Mermaid-tail-shell-starfish-Cabochon-Buttons-Scrapbooking-Slime-Charm-DIY-Embellishment-Craft-i.238364946.7834932100",
            "image": "https://down-sg.img.susercontent.com/file/e95d047c1daa851b1ca4a42392e8fa3c",
            "price": 376000,
            "location": "Mainland China",
            "rating": 4.947368421052632,
            "sold": 3,
            "description": "Create unique crafts with these 20pc Assorted Color Resin Flatback Cabochon Embellishments! Perfect for making all types of jewellery, decorations, phone cases, scrapbooking, card making, hair accessories, and other art & craft projects. Each package includes mermaid tails, shells, and stars in assorted colors, randomly picked from many different styles. Get creative and make something special today!"
        },
        {
            "title": "208pcs/set Crayola Masterworks Art Set - Coloring and Painting Supplies for Kids - Arts and Crafts Gift",
            "path": "https://shopee.sg/208pcssetCrayola-Masterworks-Art-color-penspencilmakerColoring-and-Painting-SuppliesArts-and-CraftsGift-for-Kids-i.140736052.5138395529",
            "image": "https://down-sg.img.susercontent.com/file/fd1dfc02a729b3a10ba89e207aaf8f60",
            "price": 3002000,
            "location": "Mainland China",
            "rating": 4.75,
            "sold": 0,
            "description": "Unleash your child's creativity with this 208-piece Crayola Masterworks Art Set! It includes crayons, colored pencils, and markers, all safe and nontoxic for kids ages 3 and up. The art case keeps supplies organized and protected for easy portability. Inspire creativity and encourage self-expression with this awesome arts and crafts set - the perfect birthday or holiday gift for any kid!"
        },
        {
            "title": "Colouring Crafts with Transparent Resin Dyes | Epoxy UV Resin | Art DIY",
            "path": "https://shopee.sg/Transparent-Resin-Dye-Pigment-Colouring-Epoxy-UV-Resin-Art-Craft-DIY-i.251530660.13773957493",
            "image": "https://down-sg.img.susercontent.com/file/1e2b08cc3bf77dc8894923abe9976eed",
            "price": 350000,
            "location": "SG",
            "rating": 4.818181818181818,
            "sold": 3,
            "description": "Craft your own unique creations with our Transparent Resin Dyes! All are translucent except for white, which can be used to turn your resin into a solid or pastel colour. Mix and match the dyes to create new colours! Each bottle is 6cm tall and contains approximately 10ml of dye. By purchasing from us, you're supporting small and local businesses. Please note that exchanges are only accepted within 14 days of purchase and only for unused products. Shipping for replacement items is covered by us, but buyer must cover shipping fee if item is used. Processing time for orders is 1-2 days."
        },
        {
            "title": "Assorted Craft Buttons - Multi Colours & Sizes - Perfect for Arts & Crafts Projects",
            "path": "https://shopee.sg/Ready-stock-craft-Buttons-Assorted-Sizes-Multicolours-Hobby-Crafts-Fun-Creative-Cute-Adorable-Patterns-Handicraft-i.121903432.14283124090",
            "image": "https://down-sg.img.susercontent.com/file/5ebd409547e552570c8550f32e9044eb",
            "price": 1000000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Add a touch of creativity to your projects with our Assorted Craft Buttons! These fun and colourful buttons come in a variety of sizes and colours, perfect for any arts and crafts project. Whether you're making a dress, a card, a scrapbook or a friendship keepsake, these buttons are sure to make your project stand out! Choose from regular packs with sizes from 8mm to 25mm, big packs with sizes from 18mm to 30mm, large packs with sizes from 30mm to 40mm, printed multicolour 15mm and 30mm, star shape multicolour 10-19mm, flower shape multicolour 10-20mm, silver multi design and gold multi design. Customise your button craft for bonding workshop, children party or friendship keepsake - chat with us to find out more!"
        }
    ]
}