{
    "query": "Art and Craft Supplies",
    "region": "Singapore",
    "total": 6983,
    "results": [
        {
            "title": "Children Handmade Creative Art Painting Toys Undersea Aquarium Clay diy Kindergarten Work Material Package",
            "path": "Children-Handmade-Creative-Art-Painting-Toys-Undersea-Aquarium-Clay-diy-Kindergarten-Work-Material-Package-i.419217874.22727080136",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-sw3qk9aiaknvb0",
            "price": 551000,
            "location": "Mainland China",
            "rating": 3,
            "sold": 2,
            "description": "Welcome To My Store, Please Click [Follow] To Receive Coupons.\n\n💝Product Material: Clay/Plastic\n\n💝Art Material Package Use:\n1. Let Children Learn Art Knowledge Step By Step In Play, Improve Their Ability To Perceive Beauty, Create Beauty.\n2. Experience The Joy And Sense Of Accomplishment Of Artistic Creation.\n3.Through Painting And Imagination, Let Children Develop Different Creative Works And Cultivate Children's Creativity.\n4. Exercise Children's Hand-Eye Coordination And Enhance Creative Thinking.\n\n💝Purchase Instructions:\n1. All The Products Are Material Packages, Need Children To Create By Themselves, Parents Can Also Accompany Children To Create.\n2. This Product Does Not Contain Coloring Tools, You Need To Buy It Yourself.\n3.If You Need To Make A Video, You Are Welcome To Contact Customer Service For It."
        },
        {
            "title": "HDY 3D Pen Toys Kids Digital Intelligent 3D Printing Pen High Temperature DIY Print Drawing Pens Graffiti with Printing Supplies PLA Filament Painting Doodle Arts & Crafts 儿童3D打印笔 Children USB Cable Draw Tool Birthday Gift for Boys Girls",
            "path": "HDY-3D-Pen-Toys-Kids-Digital-Intelligent-3D-Printing-Pen-High-Temperature-DIY-Print-Drawing-Pens-Graffiti-with-Printing-Supplies-PLA-Filament-Painting-Doodle-Arts-Crafts-3D-Children-USB-Cable-Draw-Tool-Birthday-Gift-for-Boys-Girls-i.101833097.3154085499",
            "image": "https://down-sg.img.susercontent.com/file/37595321bcc5f87a93718ca60595b57e",
            "price": 399000,
            "location": "Mainland China",
            "rating": 4.602150537634409,
            "sold": 7,
            "description": "The products are all in stock, if you like, you could place order and we will arrange shipment for you as soon as possible\n\nProduct Name: Kids DIY 3D Printing Pen\nRecommended age: Over 5 Years Old\n\n【Product features】\n☆Creative 3D Printing Pen\nThis intelligent 3D printing pen for kids to create toys by themselves, which is very beneficial to develop kids’ hands-on skills and mental development ability.\n☆National Standard PCL Filament\nThe printing supplies are made of high quality materials and with multiple colors, kids can draw whatever they image.\n☆Friendly Filament to Touch\nThe filament going out is in low temperature, which is very friendly to your skin and you could even draw on your skin.\n☆Speed Control Temperature Adjustment\nWhen you input or output the filament, you could press the Speed Control button to control the speed and draw in a proper speed. And the temperature can be adjusted at any time.\n\n【Packing List】\n3D Printing Pen*1\nUSB Cable*1\n5m Filament*3 (Random Color)\nUser Manual*1\n\n【Q&A】\n1.How many days I can receive parcel?\nNormally, we send out parcel at the day you order, need 8-15 days to arrive.\n2.How about the product quality?\n100% original material, pass CCC and Europe test. Good for kids.\n3.How about the seller guarantee?\nOur shop insure that the product is 100% safe and good condition. If it have any situation, we can help you to figure it out. The warranty is available.\n\n【Precautions】\nPlease use this product under the supervision of an adult. All packaging and packaging components must be removed before the child is allowed to play. Wipe the toy with a damp cloth after use to keep it clean. Please stay away fire.\n\n【Worry-free Purchase】\nIf you receive any quality problems, you can rest assured that we will unconditionally replace you with new quality-assured products. If you have any questions, you can contact us at any time, we will provide you with professional.\n\nWelcome to HDY Official Store where we strive to provide our customers an array of products that satisfy demand for quality and efficiency. Buy our products from Shopee Mall in a worry-free manner as we guarantee 100% authenticity. Shopping can't get any easier than this, so start today!"
        },
        {
            "title": "50ml Simulation Cream Glue Children's Toys Handmade diy Design Material Phone Case Hairpin Frame Surrounding Beauty Creative Material Children's Gift",
            "path": "50ml-Simulation-Cream-Glue-Childrens-Toys-Handmade-diy-Design-Material-Phone-Case-Hairpin-Frame-Surrounding-Beauty-Creative-Material-Childrens-Gift-i.915290312.22736439579",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-lf41kyz15dm72d",
            "price": 178000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 35,
            "description": "Place Of Origin: Zhejiang Province\nMaterial: Resin\n\nNote:\n1, Each Bottle Of Cream Glue Will Match To Give 1 Flower Mouth, Buy A Few Bottles Will Give A Few Flower Mouth\n2, The Suit Part Please Note The Color Number In The Order, Or Contact Customer Service To Inform The Color Number.\n\nPrecautions:\n1, This Product Is Prohibited To Eat\n2, Avoid Direct Sunlight, You Need To Close The Lid Tightly After Use\n3, After Doing It Well, It Needs To Be Placed In A Cool And Ventilated Place To Dry Naturally, And The Coloring Layer Will Dry For About 24 Hours, And The Coloring Thickness Will Take About 72 Hours\n4, If It Is A diy Phone Case, The Silicone Phone Case Cannot Be Used, Because Of The Characteristics Of The Glue, The Silicone Case Is Not Strong\n5, If It Is Not Easy To Squeeze, You Can Soak It With Hot Water, Or Rub It With Your Hand And Heart To Heat It Will Be Soft\n6, It Is Normal If The Lid Is Opened A Little Watery Flow Out, As Long As It Is Upside Down And Put It Upside Down For A While\n\nAll Orders Will Be Shipped Within 1-2 Days, Please Pay Attention To The Changes In The Status Of The Order. If You Are In A Hurry, Please Communicate With The Store Xiaoer In Advance\n\nIf There Is Any Damage To The Goods Received, Please Contact The Store Xiaoer Immediately, We Will Arrange For Re-Sending According To The Situation, Or Refund Processing.\n\n[Follow This Store, You Can Get Coupons]\n\n[More Full Discount Coupons Are Waiting To Be Received, Get Coupons Before Shopping]"
        },
        {
            "title": "DIY Toy Book Children's Cartoon kuromi Melody Creative Quiet Book Decompression Toy Book Semi-Finished Product Changing Material Package",
            "path": "DIY-Toy-Book-Childrens-Cartoon-kuromi-Melody-Creative-Quiet-Book-Decompression-Toy-Book-Semi-Finished-Product-Changing-Material-Package-i.477440506.23568018505",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lguig96r9ahwf3",
            "price": 245000,
            "location": "Mainland China",
            "rating": 4.565217391304348,
            "sold": 77,
            "description": "Tips: This is a DIY kit, not a finished product, you need to cut and make it yourself.\nThe Material Package Contains:Drawings、Cotton、Double Sided Tape、Transparent tape(Scissors Need to Be Brought by Yourself)\n\nStyle 1# is mini, about 6*7CM, other styles are normal size,about 9*12CM\n\nPackage Includes: 1*DIY Toy Book"
        },
        {
            "title": "【Office】50 Sheets Shrink Films Kit Shrinky Art Film Paper Heat-Shrink Sheets for DIY Craft Ornaments Pendants Earrings Keychains Accessories, 7.9 * 5.7 Inches",
            "path": "Office50-Sheets-Shrink-Films-Kit-Shrinky-Art-Film-Paper-Heat-Shrink-Sheets-for-DIY-Craft-Ornaments-Pendants-Earrings-Keychains-Accessories-79-57-Inches-i.277026990.14225132535",
            "image": "https://down-sg.img.susercontent.com/file/4a279ff239c93018824a569f3f4aadb9",
            "price": 1589000,
            "location": "Mainland China",
            "rating": 4.7555555555555555,
            "sold": 43,
            "description": "Features:\nHigh quality 50 * heat shrink sheets, transparent color. 20 * 14.5cm / 7.9 * 5.7in each sheet size, 0.2mm thickness.\nThere is no sanding on both sides, you need to polish the heat shrink sheet yourself. A protective film is pasted on one side, which needs to be torn off when using.\nYou can draw your favorite patterns on the heat shrink sheet, cut it out with scissors, it will shrink after heating.\nCan be used for making pendants, keychains, earrings, necklaces, bookmarks and other DIY accessories.\nUse your imagination and create your artistic work, enjoy your time at home.\n\nSpecifications:\nColor: Transparent/Translucent(optional)\nTransparent: There is no sanding on both sides\nTranslucent: One side frosted and the other glossy\nQuantity: 50 Sheets\nSize(1 Sheet): 20 * 14.5cm / 7.9 * 5.7in\nThickness(1 Sheet): 0.2mm\nPacking List:\n50 * Heat Shrink Sheets"
        },
        {
            "title": "DIY Arts and Crafts Supplies Kit Set Activity Craft Materials with Carrying Box Handmade Educational Gift for School Kindergarten Home Craft Art Supplies",
            "path": "DIY-Arts-and-Crafts-Supplies-Kit-Set-Activity-Craft-Materials-with-Carrying-Box-Handmade-Educational-Gift-for-School-Kindergarten-Home-Craft-Art-Supplies-i.277026990.12506585451",
            "image": "https://down-sg.img.susercontent.com/file/e400ac8ca5f6aa8de3ec684069f7f5e5",
            "price": 1592000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 15,
            "description": "Features:\nHandmade DIY materials, 2000+ piece kit.\nStudents can use their imagination to create their own unique art works.\nGive students the greatest variety of artistic tools, students can create beautiful handmade arts and crafts.\nPackage includes wood sticks, cute eyes, pompoms, beads, paper, safety scissors, pipe cleaners, sequins, buttons, plastic carrying box, etc.\nExcellent for classrooms or home projects.\n\nSpecifications:\nPackage Size: 25 * 19 * 13cm / 9.8 * 7.5 * 5.1in\nPackage Weight: 526g / 18.6oz\nPacking List:\n1 * DIY Materials Kit"
        },
        {
            "title": "🇸🇬[SG Stock] Complete DIY Art Supplies for Kids All in One Crafting School Kindergarten Home Arts Set Crafts Folding Box",
            "path": "SG-Stock-Complete-DIY-Art-Supplies-for-Kids-All-in-One-Crafting-School-Kindergarten-Home-Arts-Set-Crafts-Folding-Box-i.650404568.16920786142",
            "image": "https://down-sg.img.susercontent.com/file/fb151ae7f8c4860c86e8ae04fce32341",
            "price": 1331000,
            "location": "SG",
            "rating": 4.833333333333333,
            "sold": 16,
            "description": "Description:\n- Explore your creativity: Let your imagination run wild create a multitude of projects out of crafting material.\n\n- Develop innovative ability: It helps to promote children's brain development and creativity; enhance imagination, concentration and hands-on ability.\n\n- Indoor activity: These projects is easy and fun! Kids will enjoy themselves when create with friends and families!\n\n- Decor as you like: Use your imagination to make your projects, no fixed template.\n\n- Gift: Give this DIY craft to little girls/boys for christmas, birthday, and holiday gifts.\n\nSpecification:\nMaterial: Wooden+Plastic\n\nToolBox Size: 32cm x 19cm x 14cm\nTub Size: 19.5cm x 12cm\n\nPackage Includes:\n1 x Art Supply Box \nor\n1 x Art Tub\n\n(Item Includes: Misc clips, toy eyes, scissor, coloured wooden sticks, feathers, colored paper, etc.)\n\n🚚DELIVERY：\n1. We will send out within 2 working days after placing the order.\n\n📣NOTICE: \n1. Please allow 1-2cm of variances due to manual measurements.\n2. Colour variations in devices or monitor screens may not reflect actual product colour.\n\n🔺FEEDBACK:     \n1. If you have any problem with your order, please contact us, we will try our best to provide satisfactory solution ASAP.  \n2. Product carton maybe out of shape due to shipment handling but the item is in good condition.\n3. There maybe slow reply outside office hours. Thank you for your patience as we will reply at our earliest availability.\n\nThank you for shopping with us."
        },
        {
            "title": "✅[SG] Mica Pigment Powder High-Quality Mica Pigments for Epoxy Resin DIY Art & Craft Jewelry Nails Slime Epoxy Resin Dye",
            "path": "SG-Mica-Pigment-Powder-High-Quality-Mica-Pigments-for-Epoxy-Resin-DIY-Art-Craft-Jewelry-Nails-Slime-Epoxy-Resin-Dye-i.267712007.19623311039",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134202-7qvex-lgm16g66chdxed",
            "price": 128000,
            "location": "SG",
            "rating": 4.951219512195122,
            "sold": 197,
            "description": "\n\n\nMica Pigment Powder\nHigh-Quality Mica Pigments for Epoxy Resin DIY\nArt & Craft Jewelry Nails Slime Epoxy Resin Dye\n\nDescription:\n- Natural MICA Pigment Powder.\n- Finely ground stone from the Mineral Mica Pigment\n- 50 colours are vibrant and shimmery.\n\n\n- Pearl colour dyes natural cosmetic grade powders provide a dazzling beautiful colour selection for DIY projects such as:\n✅ DIY Epoxy Resin Art & Crafts\n✅ Candles Making\n✅ Soap Making\n✅ Toys\n✅ Decorative Materials\n✅ Bath bombs\n✅ Handmade Soap dye\n✅ Slime Pigment\n✅ Nail Art\n✅ Non-Toxic\n✅ So much more...\n\nSpecification:\nType: Mica Pigment Powder\nColours: 50 Colours\nVolume: 3g per bottle individually packaged\n\n* Please be advised that the colours on your screen will be slightly different as different desktop or mobile screen display colours and settings are different.\n\nWhy Buy from ArtFarm Singapore?\nWe Guaranteed ALL Our Products and Honor Your Support.\nYES, if you found out ANY Items that are not in good condition, WE WILL Replace them for you immediately. We just need you to just take a picture and send us in the chat.\n\nWe will make sure we do it right for you.\nJust write to us in the chat and send us your item pictures for verifications.\n\n\n\n\n\n\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐\n✅  Good offer not to be missed.\n✅  Locally stock up for fast purchases.\n✅  Don't have to wait for shipment from overseas.\n✅  If items are damaged during shipping, so much trouble again.\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐\nWe are a Local Art & Craft Supplier located at our new office in KB-1, Kaki Bukit Ave 3.\nWe ran roadshows in Parkway, Katong, Bedok, Novena, Takashimaya, Tanglin Mall, Bugis, Junction8, NEX, CompassOne,  Rivervale, Beauty World, HeartlandMall, IMM, JCube, Anchorpoint, Jem, Jurong East & West, Tampines, Woodlands, Thomson, City Square, Bukit Timah, Queenstown, Biopolis, The Star, Suntec, Marina Square etc.\nWe supply to many retailers in Singapore and Malaysia Johor.   🇸🇬  🇲🇾\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐"
        },
        {
            "title": "Montessori Busy Board for Toddlers - Wooden Sensory Toys - Toddler Learning Activities for Fine Motor Skills Travel Toy - Educational Toys for Kids",
            "path": "Montessori-Busy-Board-for-Toddlers-Wooden-Sensory-Toys-Toddler-Learning-Activities-for-Fine-Motor-Skills-Travel-Toy-Educational-Toys-for-Kids-i.410931893.11036111235",
            "image": "https://down-sg.img.susercontent.com/file/1b93805392baa87898fd79d2093ffdf3",
            "price": 519000,
            "location": "Mainland China",
            "rating": 4.894736842105263,
            "sold": 4,
            "description": "Description:\nBusy activity board toys allow children to tie and zip their way into independent dressing life skills.\nSpecially designed for 1-2 years old babies learning how to zip, buckle, laces etc motor skills.\nHelps children to use their hands for precise movements,encourages children to enjoy using their senses.Training your baby's finger ability.\nMade of natural wood, the busy board is flexible with no hard corners.Safe to play.\nSmall toy great for traveling like flight on plane or trip by car. Great gift for 1-2 years old children.\nSpecification:\nMaterial: Wooden\nSize:39x29.5x1.5cm/15.35x11.61x0.59inch\nPackage Includes:\n1 Piece Busy Board\nNote:\nPlease allow slight dimension difference due to different manual measurement."
        },
        {
            "title": "diy Handmade Three-Dimensional Painting Decorative Mosaic Creative Ornaments Home Decorations Children's Educational Material Package Art And Handicraft Set Work Materials",
            "path": "diy-Handmade-Three-Dimensional-Painting-Decorative-Mosaic-Creative-Ornaments-Home-Decorations-Childrens-Educational-Material-Package-Art-And-Handicraft-Set-Work-Materials-i.419217874.13293083193",
            "image": "https://down-sg.img.susercontent.com/file/c02ff26c186a0ba3b9e1844b269c74b2",
            "price": 1620000,
            "location": "Mainland China",
            "rating": 4.3,
            "sold": 6,
            "description": "Welcome to my shop, please click [Follow] to receive coupons.\n\n💝Product material: solid wood/glass, etc.\n\n\n💝The white frame is wooden, the size is 20 * 20cm\n\n💝After the mosaic patch glue is dry, use the caulking agent."
        },
        {
            "title": "Cheap cream glue goo card big set hand account sticker diy handmade material bag goo bag cheap set children's and girls' toy reward gift Children's Day gift",
            "path": "Cheap-cream-glue-goo-card-big-set-hand-account-sticker-diy-handmade-material-bag-goo-bag-cheap-set-childrens-and-girls-toy-reward-gift-Childrens-Day-gift-i.915290312.22066341833",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfk-lg3k0it2z6rqa0",
            "price": 1158000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 9,
            "description": "Note: \n1、The storage box comes in pink and purple, and the default color is the pink box. If a baby likes purple, you can add it to the order note or contact customer service\n2、Cream Glue Cuckoo Set Product Because Each Product Has A Lot Of Quantity And Cannot Guarantee That Each Product Color Style Is Consistent With The Picture (Including Sticker Pattern, Resin Accessories, Cuckoo Shape, Cream Glue Color, Hairpin Color, Bead Chain Color, Etc.).The Quantity Will Be Sufficient\nAll Orders Will Be Shipped Within 1-2 Days, Please Pay Attention To The Changes In The Status Of The Order. If You Are In A Hurry, Please Communicate With The Store Xiaoer In Advance\n\nIf There Is Any Damage To The Goods Received, Please Contact The Store Xiaoer Immediately, We Will Arrange For Re-Sending According To The Situation, Or Refund Processing.\n\n[Follow This Store, You Can Get Coupons]\n\n[More Full Discount Coupons Are Waiting To Be Received, Get Coupons Before Shopping]\n\n[Write A Good Review When You Receive The Goods, And Give A Store Coupon]"
        },
        {
            "title": "Yuykcei Epoxy Resin Pigment -26 Colour Epoxy Resin Dye - Highly Concentrated Epoxy Resin Colorant for Resin Colour Art, DIY Jewelry Making Supplies - AB Resin Colouring for Paint, Crafts - 10ml Each",
            "path": "Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
            "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
            "price": 2148000,
            "location": "Mainland China",
            "rating": 4.851063829787234,
            "sold": 0,
            "description": "26Colors Epoxy Resin Pigment:Total 26 beautiful translucent colors liquid epoxy pigment,red,fuschia,lemon yellow,brown,sky blue,orange,rose red,pink,yellow,azure,sapphire blue,purplish red,purple,blue,green,beryl green,fluorescence green,golden yellow,grass green,emerald green,peacock blue,cherry red,coffee, violet,white,black with bottled package,each resin colorant 10ml/0.35oz.\nExcellent Choice for Resin Projects: The resin dye mix well into resin, and these epoxy resin color pigments are very concentrated,High concentration of epoxy resin colour pigments, just a drop and you will be shocked by the strong dyeing effect.\nSAFETY & WIDE USE - Our epoxy oily colour dye are all non-toxic, no harsh chemicals, cruelty free.These resin pigments can be widely used on resin jewelry and crafts decorations, jewelry making, paint, garment accessories, or other DIY making.\nEasy To Use: It’s quite easy to squeeze the epoxy resin pigment out of the bottle with specially designed nozzle, transparent and soft bottles you can control the amount easily.Beginner friendly and the experienced/veteran can enjoy it as well.\nNOTE: Liquid resin dye will get best color effect mixed with EPOXY RESIN. Just mix them well and wait it cured, no catalyst needed. lf you have any questions or issues regarding the epoxy resin coloring please do not hesitate to send the seller a message through Amazon and we will respond within 24 hours."
        },
        {
            "title": "Guka Sticker Set Girl Children Stationery Gupan Handbook Material Full Handmade diy Gift Pack",
            "path": "Guka-Sticker-Set-Girl-Children-Stationery-Gupan-Handbook-Material-Full-Handmade-diy-Gift-Pack-i.891301032.18668008086",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-zxl37tzqjskv60",
            "price": 4860000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Welcome To The Store~~ ️\n ►About Us◄ We Will Release New Exquisite Goods From Time To Time, And Strive To Give Customers The Best Shopping Experience. If You Don't See The Products You Like, You Are Welcome To Leave A Message!\n🥇Resolutely Do Not Sell Garbage, Inferior Goods\n🥈We Pay Great Attention To After-Sales Service, Product Quality\n\nName: Guka Sticker Set\nColor Color: Advanced Configuration-427 Pieces Of Luxury Card Set+Storage Box, Advanced Configuration-427 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-507 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-592 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-674 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-750 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-832 Luxury Gu Card Set+Three-Layer Storage Box\nMaterial: ppc\nStyle: Cartoon\nCraft: Sticker\nApplicable Gift-Giving Occasions: Other\nApplicable Gift-Giving Relationship: Juniors, Children, Classmates\nApplicable Festivals: Children's Day\nWhether It Is A Gift: Yes, Personal Gift\nWhether Cross-Border Export Special Supply Source: No\nWhether IP Authorization: No\n\n✨✨✨Pre-purchase Notice\n\n►►►Follow Polite Attention: Follow The Store, Receive Information, And Receive Coupons~ \n►►►About Free Shipping: You Can Enjoy Free Shipping When You Reach The Marked Free Shipping Threshold~ \n►►►About Shipping: Spot Goods, Can Be Shipped The Next Day After Placing The Bid~ \n►►►About Arrival: Under Normal Circumstances, 6-10 Days To Taiwan (For Reference Only)~ \n►►►About After-Sales: If You Have Any After-Sales Questions After Picking Up The Goods, You Can Contact Us At Any Time~ \n►►►Real-name Authentication: You Need To Complete The Double Certification Of Shrimp Skin And Yili Commission, Otherwise The Goods Cannot Be Received~ \n►►►Due To The Resolution Of The Computer Screen, Brightness, Contrast, Etc., The Real Color May Be Slightly Different From The Picture.Hope To Know \n►►►The Product Dimensions Are All Measured By Hand, Please Allow 1-2CM Difference!Please Understand \n►►►After After Shipment, If The Order Logistics Status Displays The \"Shopee Logistics Center\" For A Long Time, And The Transfer Logistics And Distribution Is Being \"Not Updated, It May Be Due To Being Sampling By The Customs, It Is Recommended To Go To The EZWAY (Yili Commission) APP To Find The Corresponding Order, Click\" The Declaration Is Consistent \"(There May Be Cases Where The Declaration Amount And Order Amount Are Different, Which Will Not Affect It, And It Is Good To Click The Declaration Normally); If There Is No Relevant Declaration Information,, Please Continue To Pay Attention To Logistics News \n\nIf You Like It, Remember To Follow The Fans, Pay Attention To It Politely!New Products And Promotions Continue!\n\n🌈[Tip]: Be Sure To Choose Home Delivery To Buy Large Items Or Multiple Items To Avoid Over-Material Delivery In Store.If The Size Of Multiple I"
        },
        {
            "title": "American Black Walnut Wood Raw Wood Square Premium DIY Plate Material Handmade Material Sculpting Materials Customization/Wood Block wood material Carving Wooden DIY craft",
            "path": "American-Black-Walnut-Wood-Raw-Wood-Square-Premium-DIY-Plate-Material-Handmade-Material-Sculpting-Materials-CustomizationWood-Block-wood-material-Carving-Wooden-DIY-craft-i.469283559.20447361480",
            "image": "https://down-sg.img.susercontent.com/file/e62accf73e521a793e75e58366369913",
            "price": 972000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Material: log\nAmerican black walnut wood raw wood square premium DIY plate material handmade material sculpting materials customization"
        },
        {
            "title": "30 Pcs Retro Letter Sheet Material Paper Junk Journal Planner Scrapbooking Vintage Decorative Diy Craft Background Paper",
            "path": "30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
            "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
            "price": 210000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 4,
            "description": "Material: Paper\nSize: Approx 110*150mm\nQuantity: 1 pack/30pcs\nCode number: 02688\nApplication for decoration diary, notebook, planner, album, letter, gift box, bottle, cup, scrapbook, cellphone and so on.\nAll items are on hand and ready to ship."
        },
        {
            "title": "20 Pcsbox DIY Real Dried Flowers For Nail Decoration Art Craft Making Jewellery Simulation Decoration Holiday Party Supplies",
            "path": "20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
            "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
            "price": 350000,
            "location": "Mainland China",
            "rating": 4,
            "sold": 0,
            "description": "100% Brand New And High Quality !\n\nspecification:\n\ncolor: As Picture Show\n\nmaterial: Dried Flower\n\nflower Diameter:About 0.7-0.8cm\n\nsuit For:Floating Aromatherapy Epoxy Handmade Accessories\n\n\nNatural dried flowers vary in size. Please pay attention to natural products. The size, shape and color of each flower are different.\n \nWarm reminder: natural dried flowers are inevitably scattered, each flower has a different shape and color\nCan be used for DIY glass cover, nail art, handmade jewelry.\n \nNoted: Dried flowers can be put in glued, but not soaked in water.\n \nPackaging include:\n \n1 box * 20PCS dried flowers"
        },
        {
            "title": "2mm Thin Basswood Sheet Unfinished Wood Piece for Crafts Building Model DIY Sand Table Materials Decor Board model making scenery diorama wargame scene grass painted architecture",
            "path": "2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
            "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
            "price": 658000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 3,
            "description": "Description:\nWood Board for diy Sand Table Model Building Materials Crafts Decorative\nGreat accessory for model making, sand table scenery, diorama wargame scene\nPerfect for grass or other painted model architecture scenery building\nLightweight materials, easy to carry\nMade of basswood, durable\nSize Chart:\nThickness: 2mm \nSize:approx. \n50x200mm/ 2x7.87inch, Wight: about 12.5g\n100x100mm/ 3.94x3.94inch, Wight: 11.5g\n100x200mm/ 3.94x7.87inch, Wight: 21g \n150x150mm/ 5.9x5.9inch, Wight: 26g\n 200x200mm/ 7.87x7.87inch, Wight: 48g\n200x450mm/ 7.87x17.72inch, Wight: 111g(5 Pieces)\nPackage Includes:\n5/10 Pieces Basswood Sheets\nNote:\nColor might be slightly different due to the color calibration of each individual monitor.\nPlease allow slightly measuring deviation due to manual measurement."
        },
        {
            "title": "2-in-1 Dual Head Marker Pen Set / color pencils for kids / Art and craft materials for children / color pencil",
            "path": "2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
            "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
            "price": 910000,
            "location": "SG",
            "rating": 4.78125,
            "sold": 10,
            "description": "✅ READY TO DISPATCH WITH 24 HRS.\n🔥 30/60 Colors Kid Drawing Sets\n🔥 Made of environmentally friendly and healthy raw materials. They are non-toxic and tasteless and have no harm to the body, They can be used with confidence.\n🔥 A wide range of uses, including: coloring pages, learning rainbow colors, idea development in office use, sketching, drawing, layering, blending, polishing, etc,\n🔥 This set is suitable for primary school students and even college students who like to Draw.\n🔥 Fast Creativity - These coloring sets provide a stylish and natural wood look for your toddler or older kids, making the color more interesting, a great complement to the teen art and craft collection.\n🔥 Satisfactory guarantee: Our products are equipped with gift boxes, which can organize your coloring pencil series. It is the best gift for children on birthday and Christmas."
        },
        {
            "title": "Resin Mixer,Handheld Electric Epoxy Stirrer, Tool for DIY Epoxy Resin Crafts Making tools",
            "path": "Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
            "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
            "price": 521000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 3,
            "description": "Powerful Epoxy Mixer】With high speed rotation of 14000 rpm motor,our small and efficient electric wand can mix epoxy resin fast and well for your epoxy glitter tumblers,no more need to mix the epoxy by hand slowly\n【Easy to use】After put the stirrer into the cup with epoxy,simply press and hold the power button on the end to start mixing,Works efficiently and quiet,time saving.\n【Easy to clean】The stainless steel shaft and spiral head is easy to wipe, rinse, or just wash clean with fresh water (do not immerse ABS handle body in water)\n【Battery Operated】Our hand mixer is powered by two AA batteries (not included),Simple one-touch switch with a powerful motor but low noise level. Cordless mixer handheld, no need to worry about messy wires.\n【Fashion Design】Our resin stirrer is styled in matte black surface and a shiny black stripe,ergonomic handle is very comfortable to grip and hold\n\npackage: 1pcs tools（Batteries not included）"
        },
        {
            "title": "【MEET】10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories Jewelry Toy DIY Resin Handmade Materials",
            "path": "MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
            "price": 90000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "❤[Store Manager Description]:\nProduct Name: DIY Resin Jewelry\nMaterial: Environmentally Friendly Resin\nQuantity: 10g\nUses: Jewelry DIY, Mobile Phone Case DIY, Hairpin DIY~~~~~\nNote:\n1. This Product Is Not Edible\n❤[Shop Description]\n1. All The Items That Can Be Ordered In The Store Are In Stock. After You Place An Order, We Will Try Our Best To Prepare And Send It Out As Quickly As Possible;\n2. Normal Shipments On Weekends/National Holidays;\n3. If You Have Any Questions, Feel Free To Click On The Top Right To Chat~\n\nBecause The Product Dimensions Are All Measured Manually, There May Be Slight Errors, Please Bear With Me😊\n\n❤[Evaluation Description]\n1if You Are Satisfied With Our Products After Receiving The Baby, Remember To Give Us A \"Five-Star\" Praise, We Need Your Affirmation❤🧡💛💚💙\n2if You Have Any Other Questions In Use Or Have Other Questions, Please Do Not Let Us Know With Bad Reviews, You Can [Chat] Ask First, We Will See The Message And We Will Solve It For You As Soon As Possible~\n\nIf You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘If You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘"
        }
    ]
}