{
    "query": "Toys and Games",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Charades for Kids Peggable - No Reading Required Family Game",
            "path": "https://shopee.sg/Pressman-Charades-for-Kids-Peggable-No-Reading-Required-Family-Game-i.173728060.7720650047",
            "image": "https://down-sg.img.susercontent.com/file/9d1ed2b2020273de12d8a3a5a5a80ee9",
            "price": 756000,
            "location": "Mainland China",
            "rating": 4.816666666666666,
            "sold": 9,
            "description": "Get kids of all ages moving and laughing with Charades for Kids! This family game is designed for kids with three levels of clues to challenge children of all ages. Each card has a picture clue, so no reading is required. Act out a toothbrush, a cat or a bumble bee! Older children can read the simple words and phrases and act out actions like eating spaghetti or playing guitar! This game includes 150 charades cards, a sand timer, a game die, and complete instructions. Fun for 3 or more players, ages 4 and up. Get the family together for a hilarious game of Charades for Kids!"
        },
        {
            "title": "Lil' Curators Magnetic Pattern Block Book Road Trip Game - Educational IQ Challenge for Kids ",
            "path": "https://shopee.sg/Lil-Curators-Travel-Magnetic-Puzzle-Magnetic-Pattern-Block-Book-Road-Trip-Game-Jigsaw-Kids-Challenge-IQ-Education-i.22406436.16462259182",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qveg-lguob5k13iww7c",
            "price": 575000,
            "location": "SG",
            "rating": 4.900763358778626,
            "sold": 143,
            "description": "Challenge your child's intelligence and creativity with Lil' Curators Magnetic Pattern Block Book Road Trip Game! This fun and educational game includes 7 pieces of shapes with 30 questions and answers each, for a total of 96 questions and answers. Featuring puzzles and questions, this game makes an ideal travel game with its small and convenient size, perfect for taking on trips. It also features diversified patterns to keep kids interested. The pieces are made of natural wood, with bright colors, non-toxic and odorless. This pre-school education toy is a great way to exercise logical thinking, fully tap the potential of children's creativity, and improve practical ability and hand-eye coordination. Perfect for family entertainment, this challenging and fun game is sure to be a hit with kids of all ages!"
        },
        {
            "title": "31/15 pcs Magnetic Wood Fishing Toys Set - Educational Games For Kids",
            "path": "https://shopee.sg/3115-pcs-Magnetic-Wood-Fishing-ToysEducational-Games-For-Kids-i.498758120.10398206516",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-ue980crklciv3f",
            "price": 323000,
            "location": "Mainland China",
            "rating": 4.733333333333333,
            "sold": 95,
            "description": "Enhance your child's creativity and imagination with this fun and educational 31/15 pcs Magnetic Wood Fishing Toys Set. Featuring a variety of colorful marine animals, this set is designed to help develop children's hand coordination ability, logical thinking, and knowledge. The perfect gift or clip set for every classroom, nursery, garden, home and more, this set is suitable for children over 3 years old. Includes 1 x 15 piece fishing game toy set and 1 x 31 piece fishing game toy set. Get yours today!"
        },
        {
            "title": "10Packs Magic Pop King Cat Games - Perfect for Outdoor Events, BBQ, and Parties! GoCHEEP",
            "path": "https://shopee.sg/10Packs-Kids-Bomb-Bags-Magic-Pop-King-Cat-Games-Board-Games-Firesparkle-Outdoor-Events-BBQ-Party-GoCHEEP-i.229054296.7431640727",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-23010-gwvkx4trgmmv09",
            "price": 196000,
            "location": "SG",
            "rating": 4.875,
            "sold": 41,
            "description": "⭐️Bring Excitement to Your Kids with Magic Pop King Cat Games!⭐️"
        },
        {
            "title": "Hawker Wars / The Singaporean Dream Card Games - Original and Expansion Sets",
            "path": "https://shopee.sg/Hawker-Wars-The-Singaporean-Dream-Card-Games-Original-Expansion-i.12568.1973287454",
            "image": "https://down-sg.img.susercontent.com/file/1d0f68dcc0dab0a96387de93bc9e5562",
            "price": 2000000,
            "location": "SG",
            "rating": 4.969335604770017,
            "sold": 23,
            "description": "Enjoy the best of Singapore's iconic hawker culture and food with Hawker Wars, a fun and interactive party game! Compete to cook some of Singapore's most delicious hawker dishes by drawing ingredient and action cards. Trade ingredients in the Black Market, cook dishes, and earn points. The first player to reach the target number of points wins! For 2 to 4 players, with a play time of 15-20 minutes. Each set includes 104 hand-drawn cards (4 Hawker Cards, 53 Ingredient Cards, 17 Dish Cards, 25 Action Cards, 5 Event Cards) and 1 instruction sheet. The Singaporean Dream by SGAG is also available, an interactive card game where you can sabo, complain and pay your way to be the perfect Singaporean! With 6 Personality Cards, 18 Dream Cards, 24 Cash Cards, and 56 Action Cards, it's suitable for"
        },
        {
            "title": "We're Not Really Strangers Card Game - Interactive Adult Card Game & Icebreaker Party Game for Couples",
            "path": "https://shopee.sg/SG-STOCKWere-Not-Really-Strangers-Card-Game-an-Interactive-Adult-Card-Game-and-Icebreaker-Party-Game-Couple-Game-i.419346754.10297207556",
            "image": "https://down-sg.img.susercontent.com/file/a5948ffdf5b49fef069bdef92a67c135",
            "price": 958000,
            "location": "SG",
            "rating": 4.826530612244898,
            "sold": 31,
            "description": "📣[Re stock come in around 24th Sep 2022] Welcome to THREETOYS! We are local seller and all products listed are ready stock in Singapore. 🚛 Delivery: All orders will be shipped out within 24 hours and usually take 1-3 working days to delivery depending on the location. Courier company is J&T with tracking number. Self collection available near Farrer Park. 📖 Specification: We're Not Really Strangers Card Game - an interactive adult card game and icebreaker party game for couples, with three carefully crafted levels of questions and wildcards to help deepen existing relationships and create new ones. Two ways to play: Play safe or Play to grow (win). Optimized for 2 players (ages 12 and up), but can be played with up to 6 people. 📦 Includes:"
        },
        {
            "title": "Kong Ming Lock Traditional Wooden Interlocking Burr 3D Puzzles Game Educational Toys Arts & Crafts - Improve Your Logic Thinking!",
            "path": "https://shopee.sg/Design-IQ-Test-Kong-Ming-Lock-Traditional-Wooden-Interlocking-Burr-3D-Puzzles-Game-Educational-Toys-Arts-Crafts-i.164767620.7815231954",
            "image": "https://down-sg.img.susercontent.com/file/fda6c3dc4aebb5aa0bfda950152fda8e",
            "price": 210000,
            "location": "Mainland China",
            "rating": 4.818181818181818,
            "sold": 10,
            "description": "Improve your logic thinking with this Kong Ming Lock Traditional Wooden Interlocking Burr 3D Puzzles Game Educational Toys Arts & Crafts! This wonderful intellectual toy for spare time playing contains mysterious mathematical and physical principles. It is easy to take apart and difficult to reassemble, and can help develop intelligence, hand-eye coordination skills, improve dexterity, foster logic thinking, and prevent Alzheimer's. Made with bamboo and wooden material, this puzzle game is suitable for ages 3 years and up. Get yours now and start having fun!"
        },
        {
            "title": "Tabletop Foosball & Pool Table Games - Fun Toys for Kids & Family - Mini Soccer, Pool, & XXL Foosball Tables",
            "path": "https://shopee.sg/Tabletop-Foosball-Pool-Table-Desktop-Game-Fun-Toys-Games-For-Kids-Family-Games-Mini-Soccer-Mini-i.329310952.6961858274",
            "image": "https://down-sg.img.susercontent.com/file/16e88f11be0794a65d40cc5d533098e4",
            "price": 2390000,
            "location": "SG",
            "rating": 4.809290953545232,
            "sold": 28,
            "description": "[SG READY STOCK! FAST SHIPPING!] Get the whole family together for some fun with these tabletop foosball and pool tables! Choose from a variety of sizes and styles, including mini foosball tables (50cm & 69cm), mini pool tables (51cm & 69cm), extra large pool tables (69cm & 69cm Long Legs), and XXL foosball tables (118cm). All tables are made from wood and are designed for ages 4 and up. All foosball tables come with 2 balls, while all pool tables come with 15 color balls, 1 cue ball, 1 triangle, 2 cue sticks, and 1 chalk. Philip head screwdriver required for assemble (not included). Get your game on now!"
        },
        {
            "title": "Kids Fishing Game Toys - Perfect Christmas Gift for Kids",
            "path": "https://shopee.sg/Christmas-Gifts-Kids-fishing-game-toys-i.178175797.7643257581",
            "image": "https://down-sg.img.susercontent.com/file/f3c421a000aec622d9dcbb90b88a504b",
            "price": 662000,
            "location": "SG",
            "rating": 4.827814569536423,
            "sold": 21,
            "description": "Enjoy parent-child bonding with our Fishing Toys! Made of eco-friendly plastic, this set of fishing toys is perfect for cultivating manipulative skills, concentration, eye-hand coordination, and more. With its vibrant colors, you can be sure that your kids will be having fun while developing their skills. Package includes 1 set of Fishing Toys. Note: without original color box, we will use PE or bubble bag to pack it well and protect it well. If the item is damaged, please contact us first before leaving feedback. Due to hand measure, the size may have 1-4 cm error. Due to different monitor, the color may have difference."
        },
        {
            "title": "Connect 4 Classic Grid Board Game - Challenge a Friend to Rule the Grid!",
            "path": "https://shopee.sg/1-Set-Connect-4-In-A-Line-Board-Game-Childrens-Educational-Toys-for-Kid-Sports-Entertainment-i.173728060.3300354281",
            "image": "https://down-sg.img.susercontent.com/file/864cdbae65ec63b1c5ee9a6072bcc14c",
            "price": 194000,
            "location": "Mainland China",
            "rating": 4.871244635193133,
            "sold": 90,
            "description": "Challenge a friend to rule the grid in Connect 4 Classic Grid! Line ‘em up and go for the win! Choose the gold discs or the red discs and drop them into the grid. When you get 4 discs in a row, you win. It’s simple, fast, and fun. Master the grid with 3 different ways to play - classic, Frenzy, and the Pop Out game. Stay one step ahead of your opponent and block their attempts to get to 4-in-a-row first. Enjoy the fun and strategy of Connect 4 Classic Grid today!"
        },
        {
            "title": "🎠SG Stock🎠 Desktop Pool Table Game - Fun Family Games for Kids Mini Soccer Tabletop Foosball Children Gift Toys",
            "path": "https://shopee.sg/SG-StockPool-Table-Desktop-Game-Fun-Toys-Family-Games-Games-For-Kids-Mini-Soccer-Tabletop-Foosball-Children-gift-toys-i.610125895.12092016450",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-0lt0w4fedclv0c",
            "price": 2701000,
            "location": "SG",
            "rating": 4.833333333333333,
            "sold": 2,
            "description": "Singapore local seller - Ships within 48 hours! 🚚 Get your kids the perfect gift with this amazing tabletop pool table game! Made of non-toxic durable materials, this game is sure to provide hours of fun for your family. The two person dolls are made of ABS material, and the handles have a non-slip texture for a good grip. Plus, it comes with two fixed integrators for easy score tracking. Buy now and get your kids the perfect gift for any occasion!"
        },
        {
            "title": "Improve Hand-Eye Coordination with Ball in A Cup Game - Mini Wood Toy",
            "path": "https://shopee.sg/Ball-in-A-Cup-Game-Catch-Ball-Games-Cup-Ball-Game-Mini-Wood-Toy-Hand-Eye-Coordination-Educational-Toys-i.428619551.22517035770",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-23010-ogxydcn1o1lvfd",
            "price": 191000,
            "location": "SG",
            "rating": 5,
            "sold": 76,
            "description": "🇸🇬 Singapore Local Seller 🇸🇬"
        },
        {
            "title": "Creative Interactive Fidget Toy Set for Kids - Memory Trainer, Tetris Game Console, Water Game Machine, Vintage Hamster Game & More!",
            "path": "https://shopee.sg/New-childrens-puzzle-creative-interactive-game-baby-memory-training-machine-Fidget-toy-set-baby-toysHamster-Game-educational-toys-for-kidsEarly-Education-Interactive-ToyTetris-Game-ConsoleVintage-i.233695609.13955853335",
            "image": "https://down-sg.img.susercontent.com/file/030b8fb80ee0dcaf14acad73b717da30",
            "price": 146000,
            "location": "Mainland China",
            "rating": 4.7844827586206895,
            "sold": 7,
            "description": "Our low-priced baby educational toys have everything you need for your little one! This set includes a memory trainer, a Tetris game console, a water game machine, a vintage hamster game, and more! Perfect for developing hand-eye coordination, creative thinking, and imagination. Great for both home and outdoor play, these toys are safe and durable. Get your child the perfect gift today and help them exercise their memory and learning abilities!"
        },
        {
            "title": "Bingo Set - Family & Party Games with Cage Balls, Cards, Counters, Chips & Chance Toys",
            "path": "https://shopee.sg/SG-Ready-Stocks-Bingo-Set-Traditional-Lottery-Family-Party-Games-Cage-Balls-Cards-Counters-chance-toys-i.329310952.4861857706",
            "image": "https://down-sg.img.susercontent.com/file/bc7da8c34eefab982adc260855bf3f89",
            "price": 617000,
            "location": "SG",
            "rating": 4.857142857142857,
            "sold": 63,
            "description": "Enjoy the classic game of Bingo with this deluxe set! This complete set includes 18 black and white Bingo cards, 150 Bingo chips in 5 colors, 2 Bingo boards, a black powder coated wrought iron cage, and 75 white plastic numbered balls. Easy to read with brightly-white balls featuring jumbo-sized numbering for easy reading. Portable size with the cage measuring 21cmx 18cm (including the base) to holds more than the average amount of Bingo balls and for ease of portability. Perfect for parties, barbeques, and family game nights. Bingo can help improve cognitive abilities, like concentration, alertness, memory and encourages socializing with others. Get your Bingo Set today!"
        },
        {
            "title": "Simon Electronic Memory Game - Fun Handheld Console with Lights and Sounds for Kids",
            "path": "https://shopee.sg/Simon-Game-Console-Electronic-Memory-Game-Kid-Handheld-Game-With-Light-And-Sound-For-Childrens-Gifts-i.375470019.8486707339",
            "image": "https://down-sg.img.susercontent.com/file/34751515bf30085047c5c1f551b25a50",
            "price": 215000,
            "location": "Mainland China",
            "rating": 4.946428571428571,
            "sold": 1,
            "description": "Let the fun begin with Simon Electronic Memory Game! This handheld console is designed with lights and sounds to challenge your kids to repeat the patterns and advance to higher levels. It's perfect for team competitive play with friends and makes a great gift for kids aged 8 and above. With Repeat Mode, Built-in Suspension, and Classic Simon Game, you'll have endless hours of fun! Includes 1 Simon Classic Game Console measuring 5*5*2 cm/1.97*1.97*0.79in and weighing 50g. Note: Due to lighting effects and shooting angles, there may be color differences in the product. Please be aware of manual measurement tolerance."
        },
        {
            "title": "Who Is It? Classic Family Guessing Game for Kids - Fun and Educational Board Game Toy Gift",
            "path": "https://shopee.sg/Who-Is-It-Classic-Board-Game-Funny-Family-Guessing-Games-Kids-Children-Toy-Gift-i.173728060.3302642349",
            "image": "https://down-sg.img.susercontent.com/file/3a1b3b98ed1969fb6dcc65a4f007c52d",
            "price": 1069000,
            "location": "Mainland China",
            "rating": 4.69,
            "sold": 3,
            "description": "Challenge your family and friends to a fun game of guessing! Who Is It? is a classic board game that makes kids think and encourages them to ask questions to narrow down the possibilities. Players secretly select one character and try to be the first to guess who their opponent picked. With easy-to-learn rules and a fun guessing game, this is a great game for parents and kids to play together. Includes 1 set of board game pieces. Made of durable ABS material and measures 24x25cm/9.45\"x9.84\". Perfect for family game night!"
        },
        {
            "title": "Whack A Mole Arcade Game - Interactive Family Fun for Kids & Adults! ",
            "path": "https://shopee.sg/SG-STOCK-Whack-A-Mole-Childhood-Arcade-Toy-Game-Interactive-Family-Kids-i.80530538.15531909608",
            "image": "https://down-sg.img.susercontent.com/file/77e23744be7c6bd1f2827e2c63229693",
            "price": 2003000,
            "location": "SG",
            "rating": 4.85,
            "sold": 18,
            "description": "Get ready for some serious family fun with our Whack A Mole Arcade Game! This classic game comes with two toy hammers, LED screen to indicate the score, and two game modes to choose from: Practice Mode (2 levels) and Arcade Mode (tokens are provided, up to 21 levels). This game is perfect for both kids and adults alike, and will bring hours of entertainment! Batteries operated: 3 X AA SIZE (NOT INCLUDED). Plus, this product is eligible for our exclusive gift wrapping service - simply add on this service at a nominal fee under our 'Add-on Deals' in this listing if needed. Get your Whack A Mole Arcade Game today!"
        },
        {
            "title": "Exciting Air Powered Rocket Launcher Toy For Kids Outdoor Games - Perfect Gift For Children's Day!",
            "path": "https://shopee.sg/Rocket-Launcher-Air-Powered-Rocket-Fun-Toy-For-Children-Kids-Outdoor-Game-Childrens-Day-Gift-i.365198552.9465301996",
            "image": "https://down-sg.img.susercontent.com/file/c10c3831c97b674f6dac732bf172bc9d",
            "price": 850000,
            "location": "SG",
            "rating": 4.931034482758621,
            "sold": 12,
            "description": "Get your kids excited with this air powered rocket launcher! With a maximum range of 30 meters, this rocket launcher is perfect for outdoor games and fun. Comes with 3 rockets made of soft foam material that are easy to fly without harming people or furniture during landing. Reliable ABS material makes it safe and non-toxic, so parents can rest assured. Get your kids this fun and exciting rocket launcher for Children's Day!"
        },
        {
            "title": "Fidget Toy Baby Toys - Memory Training & Interactive Game - Whack a Mole, Hit Hamster & More!",
            "path": "https://shopee.sg/Fidget-toy-baby-toys-New-childrens-puzzle-creative-interactive-game-baby-memory-training-memory-game-machine-Whack-a-mole-Hit-Hamster-Game-Hand-Play-Knock-Hit-Hamster-Game-i.361966096.8737615121",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-u0ex82a924kv4d",
            "price": 199000,
            "location": "Mainland China",
            "rating": 4.80327868852459,
            "sold": 26,
            "description": "Get your little one ready for a fun and educational experience with this Fidget Toy Baby Toys Set! This set includes a memory trainer, creative interactive game, and a Whack a Mole, Hit Hamster Game. It's designed to help improve hand-eye coordination, creative thinking, and memory skills. Made of ABS material, it's safe and durable for repeated use. An ideal gift for children's day, birthday parties, or other holidays, this set is perfect for both indoor and outdoor play. Get it now and let your child have hours of fun!"
        },
        {
            "title": "Electric Eyes Fast Reaction Training Music Rhythm Soft Material Parent-Child Interactive Game Two-Player Battle Toys - Improve Hand-Eye Coordination",
            "path": "https://shopee.sg/Electric-Eyes-Fast-Reaction-Training-Music-Rhythm-Soft-Material-Parent-Child-Interactive-Game-Two-Player-Battle-Toys-i.189569740.22703799999",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-ikvftsvn1gjv85",
            "price": 3337000,
            "location": "Taiwan",
            "rating": 0,
            "sold": 0,
            "description": "Catch The Random Dropping Stick and Train Your Hand-Eye Coordination with this Electric Eyes Fast Reaction Training Music Rhythm Soft Material Parent-Child Interactive Game Two-Player Battle Toy! This fun game is made of foam soft material and comes with No. 3 - Carbon Zinc Battery x3. With the 54x33x4.5cm package size and BSMI-M63551 commodity inspection bureau font size, you can be sure that this game is safe and secure. Please note that the color of the accessories is subject to the manufacturer's shipment and that carbon zinc batteries should be used for toy products. The video is for reference only and the actual product may differ."
        }
    ]
}