{
    "query": "Books and Stationery",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Chinese writing stickers,buku,note, calligraphy training book stationery notebook hand account book hand account book pen hand account book set [1/6 regular script] Flower small regular script regular script adult groove practice copybook regular script s",
            "path": "Chinese-writing-stickersbukunote-calligraphy-training-book-stationery-notebook-hand-account-book-hand-account-book-pen-hand-account-book-set-16-regular-script-Flower-small-regular-script-regular-script-adult-groove-practice-copybook-regular-script-s-i.664648885.22537916565",
            "image": "https://down-sg.img.susercontent.com/file/tw-11134201-23030-a0an4r9o6jov14",
            "price": 718000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Brand: Yuxuan Pavilion\nCopybook Classification: Hard Pen Groove\nCalligraphy Font: Italic\nCopybook Content: Tang Poetry And Song Poetry\nCopybook Calligrapher: Other\nPlease \"Like\" Our Products And Follow Us.^_^\n\n❤The Whole Spot Can Be Wholesaled, Large Items Or More Than 5 Pieces, Please Choose Home Delivery To Place An Order, And The Volume Cannot Be Shipped\n❤Overseas Stores Ensure Product Quality And After-Sales Service. If You Have Any Questions After Receiving The Goods, Please Contact Customer Service In Time To Deal With Them. We Will Definitely Handle Them Properly For You. Do Not Inform You Of Bad Reviews. Thank You~\n\n❤About Shipping❤:\nShips Within 48 Hours After Placing The Bid (Including Holidays/National Holidays)\nGenerally 7-10 Days To Deliver,\nSometimes It Will Be Fast, Sometimes Slow, Please Understand.\nIf The Urgent Order Cannot Wait, Please Do Not Place An Order,\nMay Delay Your Time \n\n❤Shopping Instructions❤:\n❤For Any Product Questions, Please Use Chat To Contact Us\n❤There Is A Certain Color Difference Due To The Difference Between Different Computers And Mobile Phone Displays, Please Consider Carefully If You Mind. \n\n❤Reminder❤: \n❤The Product Dimensions Are All Measured By Hand, There Will Inevitably Be Errors!Please Understand! \n❤The Store Supports Supermarket Pick-Up And Payment, And Be Sure To Pick Up The Goods When Placing An Order (Small Business, Please Understand.) \n❤All Goods Support Wholesale, Wholesale Price Is Lower, Welcome To Use Chat To Contact Us Oh. \n❤If You Have Good Suggestions Or Deficiencies In This Store, You Can Directly Contact Our Store Customer Service, We Will Sincerely Accept Suggestions Or Correct Mistakes"
        },
        {
            "title": "INSTORE1 Business Notebook Office School Stationery Diary Book Agenda Organizer Thickening Memo Notepad",
            "path": "INSTORE1-Business-Notebook-Office-School-Stationery-Diary-Book-Agenda-Organizer-Thickening-Memo-Notepad-i.397126376.21090465980",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcs-liudor8wtle741",
            "price": 705000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Hi, welcome to our store! We are a leading store that sells all kinds of home and living products. Our products are of outstanding quality and variety. Please buy now and we will treat you like family\n \nItem Type:Notebook\nStye: Simple\nMaterial: Paper\nSheet: 128sheets=256pages\nSize: 145x100mm/179x127mm\nPackage includes:1pc Notebook\n1. Please note the photo does not show actual size, please refer to Description for size details.\n2. Please allowed 1-3mm differences due to manual measurement, thanks.\n3. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n4. Due to the light and screen setting difference, the item's color may be slightly different from the pictures.\nBusiness Notebook Student Sketchbook Memo Notepad Journal Book Diary Book Agenda Organizer Weekly Monthly Planner Taking Notes Thickening Stationery Student School Office Simple 4 Color\n \nHello there! Our chat support is open from Monday to Saturday (9:00-18:00). If you have any concerns, please feel free to message us! Before checking out, make sure the variations you want to order, shipping addresses, phone numbers, and other information are correct or not."
        },
        {
            "title": "European Vintage Code Book A5 Locked Notebook Student Diary Handbook Stationery",
            "path": "European-Vintage-Code-Book-A5-Locked-Notebook-Student-Diary-Handbook-Stationery-i.304229883.20855346011",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-p8v7lbm1oriv4d",
            "price": 1172000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Style: Vintage\nBinding method: glue staple binding\nCover material: imitation leather\nCover Hardness: Soft Side Copy\nFormat: A5\nNumber of pages: 100sheets/200page\nApplicable occasions: general, schedule planning, American excerpts\nEuropean retro password notebook\n\nBeautifully routed rounded corners, strong and durable\n\nRibbon bookmarks for easy marker finding\n\n2 kinds of packaging to choose from, ordinary packaging and gift box packaging\n\n#Journal\n#notebook\n#retro\n# password book\n#student\n#Stationery"
        },
        {
            "title": "HUBERT Business Notebook 5 Color Stationery Taking Notes Journal Book Diary Book Agenda Organizer Memo Notepad",
            "path": "HUBERT-Business-Notebook-5-Color-Stationery-Taking-Notes-Journal-Book-Diary-Book-Agenda-Organizer-Memo-Notepad-i.457159071.18191040323",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdr-ljfu7mpwdow9dd",
            "price": 544000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Follow our store and prioritize shipping your treasures! I hope you understand that our store specializes in automotive parts and 3C products. Please rest assured to purchase!\n \nItem Type:Notebook\nStye: Simple\nMaterial: Paper\nSize: 145*105mm\nSheet: 40sheets=80pages\nPackage includes:1pc Notebook\n1. Please note the photo does not show actual size, please refer to Description for size details.\n2. Please allowed 1-3mm differences due to manual measurement, thanks.\n3. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n4. Due to the light and screen setting difference, the item's color may be slightly different from the pictures.\nBusiness Notebook Student Notebook Memo Notepad A7 Notebook Journal Book Diary Book Agenda Organizer Weekly Monthly Planner Taking Notes Thickening Stationery Student School Office Simple 5 Color\n \nIf you have any products you need, please feel free to contact us and we can help you find them .Happy shopping times always pass quickly,BEST WISH"
        },
        {
            "title": "JENNIFERDZ Notebook Antique Creative Retro Thread-bound Book Tassel Stationery Sketchbook Chinese Style Sketch Blank",
            "path": "JENNIFERDZ-Notebook-Antique-Creative-Retro-Thread-bound-Book-Tassel-Stationery-Sketchbook-Chinese-Style-Sketch-Blank-i.85948343.16484679480",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg3-lg44vgkcchtv64",
            "price": 608000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Dear, welcome to my shop!\n \n100% brand new\nSize: 15.3x17.7 cm / PCS (small)\nWeight: 0.2 kg\nQuantity: 1*Notebook\nMaterials: 75-page GMS kraft paper; 250g cover\nNote:Color may be little different due to monitor, thank you.\nNotebook Journal Sketch Blank Notepad School Sketchbook Book Diary Stationery Chinese Style Thread-bound Tassel Retro Wire-bound Kraft Paper Thick Vintage Antique Ancient Creative\n \nBest wishes!"
        },
        {
            "title": "HUBERT Oil Painting Notebook Stationery Student Weekly Monthly Planner Diary Book Agenda Organizer Thickening Memo Notepad",
            "path": "HUBERT-Oil-Painting-Notebook-Stationery-Student-Weekly-Monthly-Planner-Diary-Book-Agenda-Organizer-Thickening-Memo-Notepad-i.457159071.18481920019",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg9-ljaq5v3wnke8bc",
            "price": 734000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Follow our store and prioritize shipping your treasures! I hope you understand that our store specializes in automotive parts and 3C products. Please rest assured to purchase!\n \nItem Type:Notebook\n\nMaterial: Paper\nColor: As Shown\nSize: 140*140mm\nPackage includes:1pc Notebook\n1. Please note the photo does not show actual size, please refer to Description for size details.\n2. Please allowed 1-3mm differences due to manual measurement, thanks.\n3. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n4. Due to the light and screen setting difference, the item's color may be slightly different from the pictures.\nOil Painting Notebook Student Notebook Memo Notepad Journal Book Diary Book Agenda Organizer Weekly Monthly Planner Taking Notes Thickening Stationery Student School Office Portable\n \nIf you have any products you need, please feel free to contact us and we can help you find them .Happy shopping times always pass quickly,BEST WISH"
        },
        {
            "title": "Peach A5 B5 American 10-hole loose-leaf coil book Office stationery notebook",
            "path": "Peach-A5-B5-American-10-hole-loose-leaf-coil-book-Office-stationery-notebook-i.889055763.19389972742",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdh-li5xp6e92gks97",
            "price": 724000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "🌈🍑Welcome To [Peach Cultural And Creative Market]🍑🌈\n\n🪄Product Details🪄\nName: 10 Hole Loose-Leaf Notebook\nSize: 145 * 210mm (A5)/190 * 260mm (B5)\nMaterial: PP+Paper\nStyle: 2 Sizes Available/8 Styles Available/60 Sheets Per Book (120 Pages)\n(All Products Are Carefully Selected By Us, In Order To Provide Customers With Quality Assurance And Affordable Prices💕）"
        },
        {
            "title": "[Dianyuejia] A4/A5 Release Book Cute Double-Sided Handbook Paper Storage Sticker Tape Illustrated Stationery B02",
            "path": "Dianyuejia-A4A5-Release-Book-Cute-Double-Sided-Handbook-Paper-Storage-Sticker-Tape-Illustrated-Stationery-B02-i.601634327.22340165803",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-cnf410ascplv2b",
            "price": 810000,
            "location": "Taiwan",
            "rating": 0,
            "sold": 0,
            "description": "Product Specifications\n●Material: Paper\n●Specifications: 40 Sheets/Book\n●Style: A Total Of 3 Optional\n●Size: A4/A5 (As Pictures Show)\n●Origin: China\n💗Small Yellow Shovel Needs To Be Purchased By Yourself\n\nProduct Introduction\n◆Double Wire Ring Binding, Can Be 360°Flip, Flat And Comfortable\n◆A4, A5 Two Sizes, Large Capacity With A4, Portable For Going Out With A5\n◆The Inner Pages Are Made Of Double-Sided Release Paper, With Excellent Paper Quality, Thick And Durable\n◆Each Book Contains 40 Inner Pages, Which Can Be Used On Both Sides\n◆Large Capacity, Long-Lasting Use\n💗Warm Reminder: Release Paper Is Blank Inner Pages, Without Stickers, Tape\n\n-⚠️There Is A Time Limit For The Order To Be Shipped. If The Chat Notification Is Out Of Stock And There Is No Reply, We Will Send It First. When You Receive The Goods, Please Go To Chat And Contact Us, We Will Refund You Online!\n-⚠️Once The Order Has Entered The Processing State, It Shows [The Seller Will Ship It After Confirming The Order], Which Means That It Has Been Printed And Packaged, Please Do Not Apply For Cancellation At Will!\n-⚠️Due To The Limited Manpower, We Cannot Keep The Goods On The Valet And Notify The Replenishment One By One. We Will Replenish The Goods Almost Every Day. If You Like It, Please Add A Shopping Cart Or Follow It According To The Love. Shopee Will Notify You When It Is Replenished!\n-⚠️Ships Every Day From Monday To Friday, Orders Will Be Sent On The Same Day Before Noon (Large Events Depending On The Number Of Orders), And Closed On Saturdays And National Holidays!\n\n💗Notice Before Buying💗\n⭐The Invoices In The Whole Museum Are Issued By Shopee On Behalf Of The Electronic Invoices. You Can Choose Two Or Three Copies At Checkout, Please Check Them In The Mailbox!\n⭐The Product Pages Are All Provided With Size Charts, Please Measure Carefully Before Placing An Order Before Placing An Order, And Customer Service Only Provides \"Suggested Size \", But The Decision Is In Consumer.\n⭐It Is Normal For Thread Ends Of Goods, Small Stains Within 2cm, A Little Mixed Yarn, Jumping Needles, Etc., Non-Defective, Please Accept The Buyer To Bid Again!\n⭐Due To The Process Of Cutting, Sewing, Etc. In Production, Each Detail Is Manually Crafted, And There Will Be Some Differences In The Same Size, But It Does Not Affect The Wearing\n⭐The Color Of The Product Will Have Some Errors Due To The Computer And Mobile Phone Settings Used By Individuals, Please Refer To The Actual Color.\n⭐Do Not Accept Due To Personal Factors (Color Difference.I Don't Like It.Not Suitable For Other Problems) Return!\n⭐Please Check For Defects As Soon As You Receive The Product. If The Clothes Have Been Cut Or Launched, We Will Not Accept Returns!\n⭐Underwear And Socks Are Personal Underwear, Because Of Hygiene Concerns, They Also Guarantee That Each Customer Buys New Products, And Cannot Be Returned After They Are Sold!\n\n- Return Item Must Be In New Condition And Complete Packaging.\n- If You Want To Return It, Please Send It Back"
        },
        {
            "title": "MAYWI Bookmarks Gift PVC Ocean Series Creative Stationery Book Markers",
            "path": "MAYWI-Bookmarks-Gift-PVC-Ocean-Series-Creative-Stationery-Book-Markers-i.293608815.22049910175",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfn-ljuugrs7s2muc8",
            "price": 455000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Brand \nType: Ocean Series Bookmark\nMaterial: PVC\nColor: as picture shows\nLength: About 10cm\nStyle: Cartoon Animal\nPackage includes: 1 x bookmarks\n\nNotice:\n1. Due to the light and screen difference, the item's color may be slightly different from the pictures.\n2. Please allow 1-2cm differences due to manual measurement.\n3.Thank you for your kindly understanding!\nBookmarks Cartoon Animal Style Book Markers School Supplies Stationery Ocean Series Funny Creative PVC Seal Octopus Gift"
        },
        {
            "title": "chunrong Cartoon Animal 3D Bookmark Reading Book Stationery Student School Supplies Gift",
            "path": "chunrong-Cartoon-Animal-3D-Bookmark-Reading-Book-Stationery-Student-School-Supplies-Gift-i.89889487.22275007494",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qveo-ljnukqpsdp6c31",
            "price": 730000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Specifications:\nMade of quality PVC material, they are waterproof and reusable and not easy to broken.\nCartoon animals of octopus, turtle, seal and shark design, these bookmarks are useful office and school supplies.\nThey can be used as birthdays, souvenirs, business gifts for your friends, family, bookworms and book lovers.\nThe bookmarks are three-dimensional designed, lively, and make reading more attractive, interesting, and novelty.\n \nItem Name: 3D Bookmark\nMaterial: PVC\nFeatures: Three-dimensional, Cartoon Pattern, Stationery\nOctopus Size: 9.2cm x 4.6cm/3.62\" x 1.81\" (Approx.)\nTurtle Size: 9.2cm x 6.5cm/3.62\" x 2.56\" (Approx.)\nSeal Size: 10cm x 4.5cm/3.94\" x 1.77\" (Approx.)\nShark Size: 10cm x 5cm/3.94\" x 1.97\" (Approx.)\n \nNotes:\nDue to the light and screen setting difference, the items color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\n \nPackage Includes:\n1 x 3D Bookmark"
        },
        {
            "title": "YB3 Genshin Impact Bookmark Creative Book Clip Metal Stationery Cute Cartoon Wanderer Xiao Hutao Office Student Supplie",
            "path": "YB3-Genshin-Impact-Bookmark-Creative-Book-Clip-Metal-Stationery-Cute-Cartoon-Wanderer-Xiao-Hutao-Office-Student-Supplie-i.322751424.21579740476",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve9-lgpvxd81sd7ef9",
            "price": 459000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 1,
            "description": "◑◑◑◑◑【Product Information】◑◑◑◑◑\n\n✦Genshin Impact Metal Bookmark\n✦Material:Metal\n✦Color:As Shown\n✦Size:9×6cm\n✦Weight:15g\n\n✦Package :1 PC \n\nTips:\nPlease find the voucher on the page.\nAll the items are ready Stock .\nWe don't allow cancellation after the parcel has been sent out. Thank you.\n\nNote:\n1. Please read the size information before choosing the size, thank you. Unit: cm, 1 inch = 2.54cm\n2. The picture only shows the sample, due to the light, environment, camera, various effects, the picture is slightly different from the real thing\n3. Manual measurement will have an error of 1-3cm, please understand.\nThank you!\n\nFeedback:\n1. We appreciate your choosing us and encourage us to do better. Your feedback and evaluation are very important to us.\n2. If you are satisfied with our products or services, please leave us a 5 star rating.\n3. However, if you have any questions or concerns about your order, please do not hesitate to contact us before receiving any feedback, we will do our best to solve the problem for you.\n    yubangcar3.sg"
        },
        {
            "title": "JIANWU 160 Pages/book Introduction To First Love Series Mini Portable Pocket Book Notebook Creative DIY Journal Decor Stationery",
            "path": "JIANWU-160-Pagesbook-Introduction-To-First-Love-Series-Mini-Portable-Pocket-Book-Notebook-Creative-DIY-Journal-Decor-Stationery-i.705065790.23249352584",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf6-ljmbjo8ece5wcf",
            "price": 313000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "\n\n\n\n\n\n\n\n\n\n\n***********************************************************************************************************\nWhy buy from us?\n \n[ 100% original ]\nWe promise all our products are 100% original from manufacturer &amp;amp;amp;amp;amp;amp;amp;amp;amp; we are authorised distributors for most famous brand\n \n[ Ready Stock ]\nWe are china seller and have ready stock on hand\n \n[ Fast Shipping ]\nWe promise to send out the stocks within 3 days when we receive otherwise please inform us any delay shipment from service providers, we will solve it with our best\n \nNote:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement"
        },
        {
            "title": "notebook ☍English homework book exercise book A5B5 stationery school supplies primary school students junior high school",
            "path": "notebook-English-homework-book-exercise-book-A5B5-stationery-school-supplies-primary-school-students-junior-high-school-i.407547812.21749143387",
            "image": "https://down-sg.img.susercontent.com/file/e5002057de682c56c28ca50b38162430",
            "price": 2600000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "? Dear fairy, Hello, welcome to our shop. If you like our shop, you can recommend it to your friends!\n\nPay attention to the gift, pay attention to the shop, you can get a coupon\n\n♦ Generally, pre-sale goods can be delivered within 15 days, except for individual goods. Please consult customer service for specific delivery time before placing an order\n\n♦ We provide cash on delivery service, but please don't refund at will. Please go to pick up the goods, otherwise it will cause loss to us and the goods\n\n1. Please note the color and size of your order, thank you\n2. Due to different measurement methods, 1-3cm error is allowed, and the error range is not a quality problem!\n3. Due to different lighting and display, it may be different from the picture color, please take the real object as the standard!\n4. Customer service responded that the business hours are am10:00-pm20:00 every day, and orders are settled before 19:00 every day.\n\n\nBefore purchase, please consider clearly, thank you`\n\nThe original factory out of the warehouse, goods are inspected before shipment, if there are thread defects, please understand the non quality problems, if there are any problems after picking up, please inform us immediately, be responsible, do not directly negative comments, we help you solve the problem.\n\nThink the store's commodity service is good, please give five-star praise and encouragement!\n\n10 packs (required for the beginning of school) \nA5 English book \nA5 language text\nA5 exercise book"
        },
        {
            "title": "Cute Cartoon A5 Coil Notebook Spiral Book Kuromi Cinnamoroll Notebook Journal Diary Book Student Stationery",
            "path": "Cute-Cartoon-A5-Coil-Notebook-Spiral-Book-Kuromi-Cinnamoroll-Notebook-Journal-Diary-Book-Student-Stationery-i.457170532.22027350597",
            "image": "https://down-sg.img.susercontent.com/file/vn-11134201-23020-b1s8poifdunv53",
            "price": 400000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 1,
            "description": "🛒Welcome to KugoMall !  \n\n📦Ready Stock in China✔️\n🚚We will ship within 1-2 working days ,take 7-15 workdays to arrive you.✔️\n\n📣Product Information\n🔹Size : A5\n🔹Material : Paper\n🔹Quantity : 1pcs\n🔹Specifications : 60sheets\n\n⚠️⚠️Note:\nDue to the shooting environment, some products will appear slight color difference;\nManual measurement may result in 1-2cm error. Please refer to the actual object"
        },
        {
            "title": "Stationery book protective film protective cover transparent waterproof A4/16K/22K environmental protection material",
            "path": "Stationery-book-protective-film-protective-cover-transparent-waterproof-A416K22K-environmental-protection-material-i.278742849.7457023877",
            "image": "https://down-sg.img.susercontent.com/file/171fb0fe24b08a911bb61e637f907c63",
            "price": 648000,
            "location": "Mainland China",
            "rating": 4.871559633027523,
            "sold": 2,
            "description": "Size:\n\nA4 length 300 * width 210mm\n\n16K length 260 * width 190mm\n\n22K length 210 * width 150mm\n\n18K length 244 * width 170mm\n\n35K l 190 * W 130mm\n\nreminder\n\nThe goods can be delivered to the store about 7-10 days after placing an order\n\nPlease inform us immediately if there is any problem after delivery,\n\nDon't make negative comments directly. We have many ways to help you solve the problem.\n\nIf you have any questions, please ask customer service, customer service has been online for you.\n\nFeel that the goods and service are not bad, please give five star praise and encouragement.\n can get prosperous (A4) 10 free name stickers \n can get prosperous (16K) 10 free name stickers \nCan Dewang (22K) 10 free name stickers\nA4/16K each 10 free pencil case + name stickers\n16K/22K each 10 free pencil case + name stickers\nA4/16K /22K each with 10 free gifts\nA4/16K/22K each with 20 free gifts\nYou can get Wang (18K) 10 Soviet education version to send name stickers\n Get Wang (36K) 10 free gifts Post \nA4/20pcs+16K/10pcs\nA4/10pcs+16K/20pcs\nA4 20pcs to send name sticker\n16K 20pcs to send name sticker\n18K 20pcs to send Name stickers \n22K 20 free name stickers\nHuanggang Little Champion\nA4+16K+18K+22K 10 each\n16K 30 free gifts\nA4/22K each 10+16K/20 gift"
        },
        {
            "title": "TWO 1XLuminous Night Flying dragon Bookmark Label Read Maker Book Stationery SG",
            "path": "TWO-1XLuminous-Night-Flying-dragon-Bookmark-Label-Read-Maker-Book-Stationery-SG-i.308453752.23572529582",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf7-liqrwawfda0w49",
            "price": 241000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Feature：\nBrand new and high quality\nIt is a great gift for your lover, family and friend\nColor:As picture\nMaterial:Copper\nSize:As picture 11.5cm\nPackaged:1pc\nConversion:1 inch=25.4mm or 1mm=0.0393inch\nNotice:\n1. Please allow 1-3mm error due to manual measurement.\nPlease make sure you do not mind before you bid.\n2. The colors may have different as the difference display, please understand."
        },
        {
            "title": "Steve A5 Thickened Loose-leaf Coil Notebook Cute Comics Student Workbook Notepad Jouranl Book School Supplies Stationery",
            "path": "Steve-A5-Thickened-Loose-leaf-Coil-Notebook-Cute-Comics-Student-Workbook-Notepad-Jouranl-Book-School-Supplies-Stationery-i.327652618.22506448911",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-kaaerpwk83jv5d",
            "price": 842000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Specifications: A5\nContent paper pages: 60\nText paper size: 142*205MM\n\n🚚-About delivery- 🚚\n✔When ordering, please confirm that the name, phone number and address of the consignee are correct.\n✔The seller does not have the right to modify and add any information of the order.\n✔All products in the store are in stock, we will pack and ship the products in 12-48 hours after receiving the order，and take 7-15 days to arrive..\n\n\n🌈-Benefits For Our Store Fans-🌈\n✔Follow the store to receive coupons.\n✔You can know the various discount activities of the store at any time.\n\n☎-About after sales-☎\n📫If you find that there are miss items, wrong products, defective products or slow logistics after receiving the order. Please contact our customer service as soon as possible, please don't rush to negative reviews, we will try our best to be every Customer Satisfaction!\n💬Customer service is online 9:00-18:46. When we receive the message, we will reply you as soon as possible, except for holidays!\n◾If you are satisfied with our products and services, please give us a five-star review!\n◾If there is any problem with the product, such as (missing, defective), please contact us and we will deal with it! \n🌟Real color may slightly different from pictures due to computer screen's resolution, brightness, contrast etc. Hope understanding.\n\n📣📣📣\nThank you for coming, I wish you Have a happy shopping!"
        },
        {
            "title": "2 Sheets Flower Series Stickers PET Waterproof Plant Sticker DIY Scrapbook Decoration Material Stationery",
            "path": "2-Sheets-Flower-Series-Stickers-PET-Waterproof-Plant-Sticker-DIY-Scrapbook-Decoration-Material-Stationery-i.161916446.23345474072",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvef-lhzx0z1go1ym80",
            "price": 103000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 3,
            "description": "2 Sheets Flower Series Stickers PET Waterproof Plant Sticker DIY Scrapbook Decoration Material Stationery\n \n \nMaterial: PVC\nStyle: 8 styles\nInside page size: 150*100mm\nPackage size: 180*102mm\nSpecification: 2 sheets\nWeight: 11g"
        },
        {
            "title": "JENNIFERDZ School Elegant Patterns 40 pcs/pack Blank Paper Bookmark Reading DIY Stationery Novelty Book Mark",
            "path": "JENNIFERDZ-School-Elegant-Patterns-40-pcspack-Blank-Paper-Bookmark-Reading-DIY-Stationery-Novelty-Book-Mark-i.85948343.15701303878",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvez-lftmgfmrqoj907",
            "price": 401000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "<div><p>Quantity:40pcs\nSize:14*5cm\nPackage include:40pcs Bookmarks\nName:Bookmark\nMaterial:Paper</p></div>"
        },
        {
            "title": "JENNIFERDZSG Translucent Bookmark Read Accessories Students Stationery Book Page Marker Landscape Decoration Bookmark INS Style Reading Assistant",
            "path": "JENNIFERDZSG-Translucent-Bookmark-Read-Accessories-Students-Stationery-Book-Page-Marker-Landscape-Decoration-Bookmark-INS-Style-Reading-Assistant-i.368313728.18982230931",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdw-ljllrpsmmdj2c0",
            "price": 217000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Hello, all our products are in stock.\n \nDear master, I have been waiting for you here for a long time! Let me introduce myself first~\n \nPackage Size:55*140MM\nMaterial:PVC\nColor:As picture\nQuantity:5 pcs set \nPackage include:1 SET bookmark\nNote:\nPhoto color might be a little different from the actual product due to color display of different monitors. \nMeasured by hand,maybe about 1~2cm difference.Thanks for your understanding.\nTranslucent Bookmark Note Marker Reading Assistant Page Label Book Page Marker Page Holder INS Style Landscape Aesthetics Decoration Bookmark School Supplies Students Stationery Marker of Page Stationery Kids Gift Read Accessories\n \nOur purpose is not to make money, but to let everyone use good products. We are happy to see that many people use our products and their lives become better~\n \nThank you for coming!"
        }
    ]
}