[
    {
        "name": "Amazon Basics 24 Count AA & AAA High-Performance Batteries Value Pack - 12 Double AA Batteries and 12 Triple AAA Batteries",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/712WeaMoOYL._AC_UY218_.jpg",
            "description": "Sponsored Ad - Amazon Basics 24 Count AA & AAA High-Performance Batteries Value Pack - 12 Double AA Batteries and 12 Tripl..."
        },
        "totalReviews": 4159,
        "rating": 4.75,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.82,
            "priceFraction": "82",
            "beforePrice": null
        },
        "asin": "B094D3K2W9",
        "url": "https://www.amazon.com/dp/B094D3K2W9",
        "position": 3,
        "description": "IN THE BOX: 24-count value pack with 12 AA and 12 AAA high-performance 1.5 volt alkaline batteries\nDEVICE COMPATIBLE: Ideal for game controllers, toys, flashlights, digital cameras, clocks, and more\nADAPTIVE POWER: Delivers the amount of power needed for a specific device\nEASY USE & STORAGE: Batteries arrive ready to use; stock extras for later use and backup\nSINGLE USE: These batteries are NOT rechargeable; for rechargeable options, check out Amazon Basics rechargeable batteries"
    },
    {
        "name": "Bluetooth Speaker, IPX5 Waterproof Speaker with HD Sound, Up to 24H Playtime, TWS Pairing, BT5.3, Portable Wireless Speakers for Home/Party/Outdoor/Beach, Electronic Gadgets, Birthday Gift (Black)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81djh1gfUwL._AC_UY218_.jpg",
            "description": "Sponsored Ad - Bluetooth Speaker, IPX5 Waterproof Speaker with HD Sound, Up to 24H Playtime, TWS Pairing, BT5.3, Portable ..."
        },
        "totalReviews": 1588,
        "rating": 4.45,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 26.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BRKPVZB4",
        "url": "https://www.amazon.com/dp/B0BRKPVZB4",
        "position": 4,
        "description": "[Immersive Sound Experience & Dual Connectivity] Experience unparalleled sound quality with this wireless Bluetooth speaker's 2 drivers and advanced technology that delivers powerful, well-balanced sound with minimal distortion. Connect two speakers together to create an immersive stereo sound experience and fill any room with powerful sound. Perfect for gaming, music, and movie playback.\n[Tough & Weather-Resistant] Engineered to handle rough use and adverse weather conditions, this speaker features a durable design and an IPX5 rating for protection against water splashes and spills. It's an ideal choice for outdoor events, and is perfect for use at parties, at the pool, on the beach, while camping or hiking, and more.\n[Long-lasting Playtime & Extended Bluetooth Connectivity] Experience extended playtime with up to 24 hours per charge and extended wireless range with Bluetooth 5.3, reaching up to 100 feet from your device. The multicolor lights on the speaker can also be turned off with a simple button press to save the battery and adapt to your needs. Keep in mind that the actual playtime can vary depending on volume level, audio content, and usage.\n[Vibrant Light Effects] Bring a new level of excitement to your party with the dynamic multi-color light show that syncs to the beat of the music, you can easily customize the light effects to suit your preference by simply pressing the Light button. Make any gathering more memorable with these visually stunning light effects that will elevate the atmosphere.\n[Everything You Need] The package includes 1 waterproof Bluetooth speaker, 1 Type-C charging cable, and a quick start guide, all backed by lifetime technical support. The built-in microphone allows for hands-free phone calls and you can also play music from other devices using the AUX jack (not included). It's a perfect gift for music lovers and tech enthusiasts alike."
    },
    {
        "name": "Yesimla USB C Adapter Cable Kit, Multi Charging Cable Case Convertor USB C to iOS Device/Type C/Micro/USB A Adapter, Data Transfer Contains Card Slot for Traveling, Use as Phone Holder (Black)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61Ayk50i-cL._AC_UY218_.jpg",
            "description": "Yesimla USB C Adapter Cable Kit, Multi Charging Cable Case Convertor USB C to iOS Device/Type C/Micro/USB A Adapter, Data ..."
        },
        "totalReviews": 1569,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 9.99,
            "priceFraction": "99",
            "beforePrice": 12.99
        },
        "asin": "B09NSKJYX6",
        "url": "https://www.amazon.com/dp/B09NSKJYX6",
        "position": 5,
        "description": "【Safe Charging and Data Transfer】: The mini digital gadget has four different ports for conversion, charging, transmission and more. Contains USB C cable with 3 USB adapters got all you need to charge and transfer data for Android/IOS devices.\n【All-in-One Charging Solution】:No fumbling for the right connector through a tangled mess. This portable storage box has all you need to charge and sync your device. The storage case protects the ends of the cables, and prevents them from getting tangled in your bag\n【Durable Material】:All the adapters made of a scratch resistant aluminum alloy. The internal copper wire is larger and thicker than normal cables, which helps increase charging speed and transfer data for cell phones, tablets, laptops and other devices.\n【Compact & Portable】This digital travel cable kit in 3.2*0.4 inches, it is easy to be taken in pocket, wallet and handbag\n【Multi-functional Storage Case】: This 9 in 1 cable case with 3 storage slots, 2 for nano SIM cards, 1 for micro SIM card storage (SIM card is not included) and a SIM eject tool, help you swap and store your SIM cards easily. The carry case is also a phone holder"
    },
    {
        "name": "16 inch Screen Magnifier for Cell Phone 3D Magnifier Screen Enlarger for Movies,Videos,Reading,Gaming-Screen Amplifie with Foldable Phone Stand Holder. Compatible with All Smartphones-White",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71LK-Fd3t6L._AC_UY218_.jpg",
            "description": "16 inch Screen Magnifier for Cell Phone 3D Magnifier Screen Enlarger for Movies,Videos,Reading,Gaming-Screen Amplifie with..."
        },
        "totalReviews": 529,
        "rating": 3.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B091XV998R",
        "url": "https://www.amazon.com/dp/B091XV998R",
        "position": 6,
        "description": "[3D HD SCREEN AMPLIFIER]：Adopt high-definition zoom optical technology,increase the screen size by 2-4 times and no slipping, makes the picture more clear,less cause eye damage from radiation, please use in low light environment,this will give you a much better viewing experience.\n[PULL-OUT DESIGN]:HD Foldable 3D Blu-ray easy to carry, HD screen magnifier Storage type rotating folding design. Super slim when folded and also can be carried around in your bag. Suitable for indoor, camping, journey, leisure, anywhere.\n[EYE PROTECTION]: Magnifier can prevent visual fatigue caused by reading novels and watching movies and videos for a long time.\n[COMPATIBILITY]：This Phone Screen Amplifier works with all makes and models of smartphones (iphone, Samsung, Google, Huawei, etc.).Just put the phone into the screen amplifier, you can easily enjoy the home theater-like effect.\n[BEST PRESENT]: Do not need battery, this screen magnifier is convenient to use. The phone enlarger is a wonderful gift for Mother's Day,Father's Day,your family, friends, movie lover,parent, children, use all the time, everywhere, larger viewing angle,watch clearly, protect the eyes.\n›"
    },
    {
        "name": "ONXE LED USB Clock Fan with Real Time Display Function,Stocking Stuffers for Men Christmas Gadgets,1 Year Warranty (Clock",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/611kQoDpXfL._AC_UY218_.jpg",
            "description": "ONXE LED USB Clock Fan with Real Time Display Function,Stocking Stuffers for Men Christmas Gadgets,1 Year Warranty (Clock"
        },
        "totalReviews": 3064,
        "rating": 4.15,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 14.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B010M9KRHO",
        "url": "https://www.amazon.com/dp/B010M9KRHO",
        "position": 7,
        "description": "PVC soft fan blades are safe to use and the gooseneck is flexibly bent. Gently adjust the flexible neck to the position you need to keep cool in any position.\nIdeal for desktops and laptops, simply plug in any USB port on your laptop or PC without installing a driver.\nGently adjust the flexible neck to positon the cool breeze anywhere you wish.\nThe Temperature clock fan is a USB fan with a special blade that creates an LED clock face!"
    },
    {
        "name": "KuccHero Outdoor Bluetooth Speaker, LED Atmosphere Speaker Portable Waterproof Party Speaker, BT5.0, Electronic Gadgets Gifts for Men Women, Wall Mount&Hook&Stake (Black-1PCS)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/715jNNuRzHL._AC_UY218_.jpg",
            "description": "KuccHero Outdoor Bluetooth Speaker, LED Atmosphere Speaker Portable Waterproof Party Speaker, BT5.0, Electronic Gadgets Gi..."
        },
        "totalReviews": 2414,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": true,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 49.96,
            "priceFraction": "96",
            "beforePrice": null
        },
        "asin": "B09KGQF4PP",
        "url": "https://www.amazon.com/dp/B09KGQF4PP",
        "position": 11,
        "description": "[4-IN-1 MULTIFUNCTION SPEAKER] The LED atmosphere Bluetooth speaker can bring crisp clear music and exciting lighting effects anywhere. It can work as a portable Bluetooth speaker, an LED night light, an atmosphere lamp, and an LED lantern. Besides a handy carrying handle, the portable speaker also comes with a height-adjustable stake, a hook, and a wall mount. You can have it stand in your yard or beach, hang it on your camping tent, trees, or terraces, or mount it on a wall\n[SEPARATE ATMOSPHERE LAMP, 3 LIGHTING MODES] The LED lantern speaker lets you choose from 3 lighting modes or turn the light off. In light mode, the realistic dancing flickering tiki torch creates a lively campfire atmosphere; In candlelight mode, the breathing light creates a romantic atmosphere and helps users fall asleep quickly and soundly; In full brightness mode, the night light Bluetooth speaker adds 360° of uniform light to your space\n[LOUD 360° HD SOUND] Featuring state-of-the-art DSP technology and dedicated drivers, the 360° LED party speaker can deliver crystal clear and 360° room-filling sound in seconds. With the latest Bluetooth 5.0 technology, you can quickly connect to your smartphone, tablet, or other Bluetooth devices up to 82ft away. You can also play music from your existing audio device using a 3.5mm AUX cable. Enjoy hours of music and light on a single charge\n[PAIR UP TO 100 SPEAKERS] Easily fill rooms and open spaces with crisp, well-balanced sound and create a 360° HD stereo immersive surround sound system. Liven up your party and enjoy crisp, synchronized sound everywhere by connecting up to 100 KUCCHERO outdoor Bluetooth speakers via Bluetooth\n[GREAT GIFTS FOR FRIENDS AND FAMILY] The portable lantern Bluetooth speakers add romance and elegance to your space and the sleek lantern design makes them a nice home decoration. They are great gifts for men, women, girls, and boys. Great for adding fun illumination, crisp music, and a romantic atmosphere to birthdays, holidays, parties, outdoor activities, and Christmas"
    },
    {
        "name": "Amazon Basics Electric Can Opener, Black",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/710Z3AvzcRL._AC_UY218_.jpg",
            "description": "Sponsored Ad - Amazon Basics Electric Can Opener, Black"
        },
        "totalReviews": 23106,
        "rating": 4.25,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.97,
            "priceFraction": "97",
            "beforePrice": null
        },
        "asin": "B07T6NNKJ4",
        "url": "https://www.amazon.com/dp/B07T6NNKJ4",
        "position": 12,
        "description": "Electric can opener for opening standard-sized cans\nPowerful stainless steel blade smoothly and safely opens cans with no snagging\nAutomatic stop, on/off, and release/locking mechanisms\nWide, non-slip base keeps the opener in place on your countertop\nMagnetic lid holder prevents lid from dropping into the can\nModern, compact design with durable plastic housing"
    },
    {
        "name": "PowerTRC USB 3\" Diameter Powered Plasma Ball | USB or (2 X AA) Powered | Science Toy | Electronic Plasma Light Gadget | Desk Toy | Classroom Accessory",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/41Nq4mfs+zL._AC_UY218_.jpg",
            "description": "PowerTRC USB 3\" Diameter Powered Plasma Ball | USB or (2 X AA) Powered | Science Toy | Electronic Plasma Light Gadget | De..."
        },
        "totalReviews": 139,
        "rating": 4.25,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B01BU8VFNG",
        "url": "https://www.amazon.com/dp/B01BU8VFNG",
        "position": 13,
        "description": "Electrifying Fun | Surprise your friends and family with this fun gadget. Place it in your car, desk or at home. Observe the colorful lights as it reacts to your touch or sounds. The science here is just shockingly fun!\nIdeal Present | Great Gift idea for Birthdays, Parties, After School Fun, Summer Projects, Christmas Gift For Kids Or All Other Holidays for science lovers of all Ages!\nSafe & Fun | Made of durable ABS plastic material. 100% safe and non-toxic. ASTM & CPSC Tested and Certified.\nUSB POWERED (Included) and/or BATTERY OPERATED (3x AAA not included)\n100% Satisfaction Guaranteed.\n›"
    },
    {
        "name": "Gadget Guard Apple Iphone 14 Plus &13 Pro Max Compatible Screen Protectors- Glass Pro-Active, 2 Pack - Easy-Align Installation Tool Included",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71BztPvl00L._AC_UY218_.jpg",
            "description": "Gadget Guard Apple Iphone 14 Plus &13 Pro Max Compatible Screen Protectors- Glass Pro-Active, 2 Pack - Easy-Align Installa..."
        },
        "totalReviews": 3,
        "rating": 3.95,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 29.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C8QQ8HTD",
        "url": "https://www.amazon.com/dp/B0C8QQ8HTD",
        "position": 14,
        "description": "Lifetime Replacements: This is the last screen protector you’ll ever need! If your Gadget Guard product cracks or breaks, we will replace it for free (just pay shipping and handling). All products registered on GadgetGuard.com are eligible for replacements as long as your device is in production.\nEffortless Installation: We solved the number one problem in screen protection – the installation. With our Easy-Align Tool, installing your screen protector is so simple that even your grandma can do it!\nUnmatched Durability: Gadget Guard Pro-Active Double Tempered Glass is crafted with aluminosilicate (SIO2:Al203), the same material used in space shuttle windows. It offers DOUBLE the strength and edge-chip resistance compared to traditional glass.\nUncompromised Clarity: Despite its exceptional strength, Pro-Active glass does not compromise on visual quality. Enjoy crystal-clear clarity and vibrant colors, ensuring an immersive viewing experience without sacrificing protection.\nUltra-Thin yet Sturdy: Pro-Active glass maintains a slim profile, with a total thickness of just 0.51 mm. It consists of 0.33 mm aluminosilicate glass for resilience and 0.18 mm optically clear adhesive for a seamless user experience."
    },
    {
        "name": "FANGOR 1080P HD Projector, WiFi Bluetooth Projectors, Max 230”Projection Screen Portable Home Theater Video Movie Proyector With Tripod, Compatible with HDMI, VGA, USB, Laptop, iOS & Android Phone",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81ucEY8tfiL._AC_UY218_.jpg",
            "description": "FANGOR 1080P HD Projector, WiFi Bluetooth Projectors, Max 230”Projection Screen Portable Home Theater Video Movie Proyecto..."
        },
        "totalReviews": 7216,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 189.98,
            "priceFraction": "98",
            "beforePrice": 279.98
        },
        "asin": "B07ZNSPZWX",
        "url": "https://www.amazon.com/dp/B07ZNSPZWX",
        "position": 15,
        "description": "❤【NATIVE 1080P FULL HD RESOLUTIONS】 With native resolution of 1920*1080 and contrast ratio of 10000:1, the Fangor-506 1080p Projector provides sharp and detailed HD images. Combining an innovative high-refraction 6 layers glassed lens, ensuring the best video experience.\n❤【WIRELESS WiFi CONNECTION】 Latest WiFi connecting function is compatible with IOS and Android system. You do not need converting cable such troublesome thing, just once-time WiFi connection and you can connect your device with the Portable home bluetooth projector whenever you want to use it.（Attention: Make sure both your phone and the 1080p wifi bluetooth projector are connect to the same wifi network )\n❤【BLUETOOTH & SURROUND SPEAKER】 Build-in stereo surround speaker, 1080p hd projector restored every detail sound effect to let you enjoy the pleasure sounds in different scenes. with Bluetooth, you can connect your ideal Bluetooth speaker wirelessly at any time.(Note: smartphone not support to connect with fangor native 1080P wifi projector to transfer data by bluetooth)\n❤【COMPATIBLE DEVICES】This outdoor movie projector is very versatile and has HDMI, AV, VGA, SD Card port, which allows you to use it with Laptop, PCs, Chrome Book, Tablets, MICRO SD Card, USB Flash Drive. (Music, Pictures, Video), Pad, Phone, Android Smartphones.(Due to copyright issue , Videos like Netflix,amazon prime , Disney and Hulu are not support to play it directly by mirror screen with phone , must be connected TV stick to Play it )\n❤【RELIABLE CUSTOMER SERVICE SUPPORT】Fangor provides 30 days guarantee for return(warranty for free replacement or refund) and 1-year tech support, If you have any problems, please contact us immediately and get a 24H Service Reply by \"\"Order-Get Help\" from the Amazon Station Message. (PS: if you have missed any parts or received the broken item in the package, we will send a new one to you for free)\n›"
    },
    {
        "name": "Tile Pro 1-pack. Powerful Bluetooth Tracker, Keys Finder and Item Locator for Keys, Bags, and More; Up to 400 ft Range. Water-resistant. Phone Finder. iOS and Android Compatible, Black.",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/41m+zvEulRL._AC_UY218_.jpg",
            "description": "Tile Pro 1-pack. Powerful Bluetooth Tracker, Keys Finder and Item Locator for Keys, Bags, and More; Up to 400 ft Range. Wa..."
        },
        "totalReviews": 11329,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 27.99,
            "priceFraction": "99",
            "beforePrice": 34.99
        },
        "asin": "B09B2WLRWX",
        "position": 16,
        "url": "https://www.amazon.com/dp/B09B2WLRWX",
        "description": "POWERFUL TRACKER - Tile helps you keep track of your things. The Tile Pro streamlined shape hangs great on keys, bags or luggage. Use our free app to find them.\nFIND NEARBY -- Use the Tile app to ring your Tile when it’s within Bluetooth range, or ask your Smart Home device to find it for you.\nFIND FAR AWAY -- When outside of Bluetooth range, use the Tile app to view your Tile’s most recent location on a map.\nFIND YOUR PHONE- Double press the button on your Tile to make your phone ring, even when it’s on silent.\nNOTIFY WHEN FOUND -- Enlist the secure and anonymous help of the Tile Network to help find your things. If your lost Tile is found, If your Tile is lost, add your contact information so you can be reached when someone scans the QR code on your lost Tile.\nANDROID, IOS & SMART HOME COMPATIBLE - Find your things with the free Tile app on both iOS and Android devices. Tile also works with Amazon Alexa, Hey Google and Siri\nTECH SPECS: Water-Resistant (IP67 rated), Up to 1-year replaceable battery, Up to 400 ft / 120 m Bluetooth range\nUPGRADE TO A PREMIUM PLAN: Get proactive Smart Alert notifications when you leave something behind, and with Item Reimbursement, if we can’t find your Tiled item, we reimburse you."
    },
    {
        "name": "Pankoo 12x60 Monocular Telescope High Powered with Smartphone Adapter Tripod and Portable Bag, Larger Vision Monoculars for Adults with BAK4 Prism & FMC Lens, Suitable for Bird Watching Hiking Travel",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/713s2oytU4L._AC_UY218_.jpg",
            "description": "Sponsored Ad - Pankoo 12x60 Monocular Telescope High Powered with Smartphone Adapter Tripod and Portable Bag, Larger Visio..."
        },
        "totalReviews": 122,
        "rating": 4.55,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 129.98,
            "priceFraction": "98",
            "beforePrice": null
        },
        "asin": "B0BLZ3S2YN",
        "url": "https://www.amazon.com/dp/B0BLZ3S2YN",
        "position": 17,
        "description": "【12x High Power Wide Angle Monocular】12X magnification and 6.5° wide field of view monocular, which provides a more comfortable and larger view, clearer details, adding up to incomparable watching experience. Perfect for Hiking, Camping, Bird watching, Wildlife, Sports, Concerts, Travel, Scenery Watching.\n【25mm Large Eyepieces & 60mm Large Objective Lens】 Pankoo 12x60 Monocular is equipped with larger eyepiece and objective lens than ordinary monocular, which secures more light transmission and a brighter and larger field of view. Share the beauty of nature, wildlife at the distance of as far as 325ft/1200 yds with your friends or relatives.\n【Large BAK-4 Prism & Premium FMC Lens Coating】Pankoo 12x60 Monocular features advanced Fully Multi-Coating technology and large BAK4 prism lens, to increase the amount of light transmission and reduce unnecessary light reflection, and provide clear, high-contrast, color-accurate images at the same time. Whether you wear glasses or not, this monocular can provide the nice view during your outdoor adventures and you won't be dizzy even after watching for a long time.\n【High-quality Smartphone Adapter & Tripod】Our monocular comes with high quality smartphone holder and sturdy tripod which can be adjusted to two diffrent angles and 3 kinds of length as you like. Professional design, easy to install, ensuring clearer, brighter and shakeless images. Compatilble with all kinds of smartphone including but not limited to iPhone, Samsung, Sony, Google, LG, HTC etc.\n【Perfect Gift, Satisfactory Service】Comes with a sturdy portable case, made of premium material, it can protect the monocular from shocking, shaking, scratching and maximize its lifespan. Excellent design and portability, perfect GIFT for friends and family. If you are not 100% satisfied with our products, please contact us and you will get the amazing service."
    },
    {
        "name": "Bluetooth Speaker, IPX5 Waterproof Speaker with HD Sound, Up to 24H Playtime, TWS Pairing, BT5.3, Portable Wireless Speakers for Home/Party/Outdoor/Beach, Electronic Gadgets, Birthday Gift (Black)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81djh1gfUwL._AC_UY218_.jpg",
            "description": "Bluetooth Speaker, IPX5 Waterproof Speaker with HD Sound, Up to 24H Playtime, TWS Pairing, BT5.3, Portable Wireless Speake..."
        },
        "totalReviews": 1588,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 26.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0BRKPVZB4",
        "url": "https://www.amazon.com/dp/B0BRKPVZB4",
        "position": 21,
        "description": "[Immersive Sound Experience & Dual Connectivity] Experience unparalleled sound quality with this wireless Bluetooth speaker's 2 drivers and advanced technology that delivers powerful, well-balanced sound with minimal distortion. Connect two speakers together to create an immersive stereo sound experience and fill any room with powerful sound. Perfect for gaming, music, and movie playback.\n[Tough & Weather-Resistant] Engineered to handle rough use and adverse weather conditions, this speaker features a durable design and an IPX5 rating for protection against water splashes and spills. It's an ideal choice for outdoor events, and is perfect for use at parties, at the pool, on the beach, while camping or hiking, and more.\n[Long-lasting Playtime & Extended Bluetooth Connectivity] Experience extended playtime with up to 24 hours per charge and extended wireless range with Bluetooth 5.3, reaching up to 100 feet from your device. The multicolor lights on the speaker can also be turned off with a simple button press to save the battery and adapt to your needs. Keep in mind that the actual playtime can vary depending on volume level, audio content, and usage.\n[Vibrant Light Effects] Bring a new level of excitement to your party with the dynamic multi-color light show that syncs to the beat of the music, you can easily customize the light effects to suit your preference by simply pressing the Light button. Make any gathering more memorable with these visually stunning light effects that will elevate the atmosphere.\n[Everything You Need] The package includes 1 waterproof Bluetooth speaker, 1 Type-C charging cable, and a quick start guide, all backed by lifetime technical support. The built-in microphone allows for hands-free phone calls and you can also play music from other devices using the AUX jack (not included). It's a perfect gift for music lovers and tech enthusiasts alike."
    },
    {
        "name": "7-in-1 Electronic Cleaner Kit,Keyboard Cleaner,Laptop Cleaner Kit for Monitor, Cell Phone, Bluetooth,Headset, Lego, Airpods, Laptop Camera Lens (Blue)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61mR62UW3fL._AC_UY218_.jpg",
            "description": "7-in-1 Electronic Cleaner Kit,Keyboard Cleaner,Laptop Cleaner Kit for Monitor, Cell Phone, Bluetooth,Headset, Lego, Airpod..."
        },
        "totalReviews": 215,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 10.99,
            "priceFraction": "99",
            "beforePrice": 16.98
        },
        "asin": "B0B7MLB5K2",
        "url": "https://www.amazon.com/dp/B0B7MLB5K2",
        "position": 22,
        "description": "⌨【Cleaning Kit】7-in-1 cleaning kit includes a variety of accessories, nylon bristles,flocking sponge, plastic nib,keycap puller,high-density brush,suede removable cleaning cloth,screen cleaner solution spray,to meet various cleaning needs\n⌨【Multifunctional】Flocking sponge can clean the dust in the wireless charging box of the earphone, high-density brush can clean the dirt on the sound hole of the earphone,plastic nib can clean the stubborn dust in the corner,suede detachable cleaning cloth can clean the LCD screen, clean with water and support repeated use\n⌨【Soft brush】Specially selected nylon brush, soft bristles will not hurt the keyboard,high pore strength, more labor-saving friction, durable\n⌨【Easy key removal】Using a simple key puller, it is no longer laborious to replace the keycap, and the removal of the keycap is cleaner and more thorough\n⌨【Multipurpose】Deep clean every corner of keyboard and earphones, suitable for most wireless bluetooth, cameras, digital products, keyboards, car interiors, car vents, printers, phones, calculators, speakers, TVs, computers in the market And other home and office appliances, the soft brush set keeps your electronics clean and prolongs the life of your electronics"
    },
    {
        "name": "Perytong Sleep Headphones Wireless, Bluetooth Sports Headband Headphones with Ultra-Thin HD Stereo Speakers, unisex, Perfect for Sleeping,Workout,Jogging,Yoga,Insomnia, Air Travel, Meditation",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81FxnijzD0L._AC_UY218_.jpg",
            "description": "Perytong Sleep Headphones Wireless, Bluetooth Sports Headband Headphones with Ultra-Thin HD Stereo Speakers, unisex, Perfe..."
        },
        "totalReviews": 49343,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B08R7439SN",
        "url": "https://www.amazon.com/dp/B08R7439SN",
        "position": 23,
        "description": "【Sleep Headphones & Sports Headband 2 in 1】Perytong Bluetooth headband allows you to listen to music without having to wear additional headphones, and protect you from being disturbed by your mess hair and sweat. Built-in microphone to let you won't miss any callings. Wireless sleep earbuds perfectly suitable for gym, workout, running, yoga, sports, other outdoor activities and take a nap indoors or in the office as a sleep mask with bluetooth headphones.\n【Thin Speakers Perfect Headphones for Sleeping】Headband headphones bring you peaceful sleep all night, built-in 2 ultra-thin speakers, devices control module is in the middle of sleep headband, no press the ears. Noise cancelling headphones are comfortable enough to wear while lying down or sleeping on your side. The sleeping bluetooth headphones match for devices that support bluetooth 5.2. Sleep earphones compatible with Android and ios or any other smartphones,Tablets.\n【Longer Service Time and Premium Audio】Sleeping headphones bluetooth 5.2 HiFi advanced sound technology wireless bluetooth headphones offer an upgraded rechargeable lithium battery, charge about 2-2.5 hours provide more than 10 hours of playing time. Quality chipsets ensure clear sound and lossless music even during sports. Built-in microphone and volume control buttons which enable users to answer hands-free phone calls and handle previous/next song without having to use your phone.\n【Comfortable, Breathable and Washable Headband】Sports headphones headband are extremely soft and lightweight, which is made of durable braided cord and offers a breathable mesh lining, will easily stretch to fit all head sizes, also incredibly soft. The bluetooth headband headphones are washable, simply remove the speakers and clean the band. Useful for wearing an eye mask for sleeping so the light-blocking feature is helpful. The headband wide range is 9.8-10.6 inches.\n【Satisfaction Sercive Guarantee】We provide sleep headphones bluetooth hassle-free service and offer friendly, easy-to-reach support (just contact us if you have any questions). Take bluetooth headband tech gadgets creates you a private space, special ear muffs for sleeping not only make your sleep better but also enjoy your music time. Such a great bluetooth headband for men women is a unique gift idea."
    },
    {
        "name": "BUBM Double Layer Electronic Accessories Organizer, Travel Gadget Bag for Cables, USB Flash Drive, Plug and More, Perfect Size Fits for iPad Mini (Medium, Black)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81fuKpzg4LL._AC_UY218_.jpg",
            "description": "BUBM Double Layer Electronic Accessories Organizer, Travel Gadget Bag for Cables, USB Flash Drive, Plug and More, Perfect ..."
        },
        "totalReviews": 2950,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 17.99,
            "priceFraction": "99",
            "beforePrice": 23.99
        },
        "asin": "B014R4IGHS",
        "url": "https://www.amazon.com/dp/B014R4IGHS",
        "position": 24,
        "description": "KEEP ALL IN PLACE: Double layer Nylon interior compartment, enough roomy to hold various items like cables, flash disk, USB drive, Power, Headphone and etc. Dimensions: L9.8\"* W7\"* H1\"\nEXCELLENT PROTECTION: Well padded semi flexible covers offer excellent protection for your electronic accessories. Tips: This Gear Organizer fits for iPad Mini without a cover (7.9-inch) but not enough for iPad Air & Microsoft Surface.\nPREMIUM QUALITY: Medium, double layer, made of heavy-duty, durable and waterproof nylon material(No accessories Included). Zippers closure ensure your item secure.\nEASY TO CARRY: Lightweight and spacious design greatly carry everything you need when you are on the go. Perfect size easily fits into your briefcase, luggage, backpack.\nMULTIPURPOSE: Also can be as Cosmetic Carrying Bag. Most versatile organization system designed to hold items firmly in place, Endless configurations Perfect companion for your laptop bag or travel case."
    },
    {
        "name": "AMAZTIM Fitness Tracker-100M Waterproof,50Days Extra-Long Battery 3D Curved Glass Full Metal Smart Watch,Health&Fitness Watch with 24H Heart Rate/Sleep Monitor,1.47\" HD AMOLED Display,70 Sports Modes",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/715iQYuE-uL._AC_UY218_.jpg",
            "description": "Sponsored Ad - AMAZTIM Fitness Tracker-100M Waterproof,50Days Extra-Long Battery 3D Curved Glass Full Metal Smart Watch,He..."
        },
        "totalReviews": null,
        "rating": null,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 99.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C6FB4DXV",
        "url": "https://www.amazon.com/dp/B0C6FB4DXV",
        "position": 25,
        "description": "⌚3D Curved Glass-AMAZTIM X1 is the first 3D curved smartwatch. The combination of the flexible beauty of the curved glass and the Corning Gorilla screen provides resilience against various screen hazards.TC4 Titanium unibody bimetallic body, military-grade materials, and fully enclosed design make it the toughest and most durable watch available. Successfully passed 15 MIL-STD-810H certifications, including salt spray, rain, impact tests, etc. Our fitness watch thrives in any harsh environment.\n⌚100M Waterproof(10ATM/IP69K)- AMAZTIM X1 adopts a military-grade solid and corrosion-resistant titanium body, fully enclosed and ultra-thin shell so that its waterproof level reaches 10ATM & IP69K, you can confidently wear it during swimming. Our waterproof smart watches for men have proven their resilience under extreme conditions by passing drilling, crushing, and hot steam washout tests, making our fitness tracker for men ideal for use in environments with high temperatures and pressure.\n⌚50Day+ Ultra-Long Life Battery - AMAZTIM X1 is equipped with 100% pure cobalt-based battery (military grade) ensuring optimal performance and longevity, twice as much as that of conventional smartwatches. At the same time, a super power-saving AI algorithm breaking the industry is adopted to minimize power consumption, enough to last up to 2 weeks under normal use, and can continue to use sports mode, health index measurement, and other functions for up to 50+ days in power-saving mode.\n⌚AMOLED Display-①Clearer vision under the sun -First anti-glare technology on the glass, giving the watch clarity and excellent visibility when outdoors;②Clearer- screen with up to 100%RGB color gamut, brightness of 1000NIT,gives you clear and vivid visual experience;③Always-on displays-You no longer need to lift your wrist or touch the screen to check the time, the display never sleeps;④More energy-saving LED display can control how each pixel illuminates, it is more energy-efficient than LCD.\n⌚Health Monitoring /70 Exercise Modes - AMAZTIM X1 collects health data with its advanced real-time monitoring function. helps you monitor All-day sleep,24-hour heart rate, and real-time blood oxygen. The fitness band includes a pedometer to keep track of the calories burned throughout the day. Supports up to 70 sports modes and 6 Intelligent Sports Recognition, AMAZTIM X1 smart watch collects data with pinpoint precision and accuracy, ensuring that every workout is counted."
    },
    {
        "name": "PazleGee Multi Functional USB Adapter Kit Travel Gadgets Charge Card with Type-C/Type-A/Micro-USB/Lightning, Wheat Straw Fast Charging Foldable Cable Storage Box Gift",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61+py8zgLaL._AC_UY218_.jpg",
            "description": "PazleGee Multi Functional USB Adapter Kit Travel Gadgets Charge Card with Type-C/Type-A/Micro-USB/Lightning, Wheat Straw F..."
        },
        "totalReviews": 31,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 10.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B0C4YDF413",
        "url": "https://www.amazon.com/dp/B0C4YDF413",
        "position": 26,
        "description": "The Multi-Functional USB Adapters provide different types of charging connectors to accommodate various devices. These electronic gadgets may include USB Type-C, micro USB, Lightning Adapter, and other common standards. With such a kit, you can charge smartphones, tablets, cameras, portable gaming consoles, or other devices that rely on different charging ports using a single USB port.\nThe material is made from TPE and wheat straw. Natural wheat straw is biodegradable, reducing hard-to-decompose plastic waste and promoting environmental friendliness. Additionally, the wheat straw also gives the product unique characteristic colors.\nThis compact cable kit has a size of 3.35*2.95 inches, making it easy to carry in a pocket, wallet, or handbag.\nThe versatility of the multi-charging cable fast charge makes it a practical solution for individuals who frequently need to connect and charge different devices. This incharge cable eliminates the need for carrying multiple individual adapters or cables, reducing clutter and simplifying connectivity options while on the go.\nPackage Includes: Type-C to C Cable x 1, Type-C to Lightning x 1, Type-C to Micro USB x 1, Type-C to A Adapter x 1, Card Removal Tool x 1. Note: This cable card does not contain a memory card or SIM card. It helps with USB-C to Lightning adapter, USB-C to Lightning adapter, Lightning to USB-C adapter, USB to Micro USB adapter, USB-C to Micro USB adapter, Lightning to USB-C adapter, Lightning to USB-C adapter, Type-C to Lightning adapter, Type-C to Micro USB adapter, Micro USB to USB adapter,.."
    },
    {
        "name": "Portable Charger Power Bank 10000mAh【2 Pack】Ultra Slim Design Portable Phone Charger with Type C Input & 2 Output Backup Charging External Battery Pack for Smart Phone, Android Phone,Tablet etc.",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61Vnm8O7EgL._AC_UY218_.jpg",
            "description": "Portable Charger Power Bank 10000mAh【2 Pack】Ultra Slim Design Portable Phone Charger with Type C Input & 2 Output Backup C..."
        },
        "totalReviews": 8027,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 22.95,
            "priceFraction": "95",
            "beforePrice": 29.95
        },
        "asin": "B08XBN7HRT",
        "url": "https://www.amazon.com/dp/B08XBN7HRT",
        "position": 27,
        "description": "【Small & Slim】2 Pack 10000mAh Power Bank using high-quality Li-polymer electric core and Ultra Slim Design, weighing just 181g and only 14mm thick. Grippy design is easy to hold, easy to toss into a bag and incredibly portable. Adopts our advanced intelligent controlling IC, higher quality, safer and more reliable, powerful and longer-lasting life after 100% checked and continuous aging test;\n【Dual Output & Input】2 usb output ports, can fast charge 2 devices at the same time, The portable charger can fully refill the battery itself in 6-8 hours at 5V 2.1A and meet the charging needs of mobile phones, tablets and other electronic devices;\n【Universal Compatibility】The power bank supports iwatch, Airpods, Samsung Galaxy, most other Smart cell phones, Tablets, Bluetooth devices and more. It can charge 6 to 8 times to eliminate the anxiety of your battery exhaustion. Suit for travel, and other indoor outdoor activities;\n【4 LED Lights & Certified Safe 】 Four led lights show the current remaining power of the item(25%~50%~75%~100%), easily press the power button to turn it on or off. Built-in smart protection system, the USB battery pack ensures complete protection for you;\n【24 Months Support Services 】AONIMI 10000mAh portable battery charger, Micro USB cables, user manuals. AND 24 month warranty policy and 24 hours friendly customer service. easy-to-reach support! Any question, please kindly contact us."
    },
    {
        "name": "USB Charging Station with Outlets Upoy, Outlet Extender 1875W, Charging Cube Dual USB Ports Total 3.1A, C Port Block with 3 Wall Outlets, Power Adapter 3 Prong, Tech Gadget for Multiple Electronics",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61Cw91suLYL._AC_UY218_.jpg",
            "description": "USB Charging Station with Outlets Upoy, Outlet Extender 1875W, Charging Cube Dual USB Ports Total 3.1A, C Port Block with ..."
        },
        "totalReviews": 932,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 20.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B09834QKSZ",
        "url": "https://www.amazon.com/dp/B09834QKSZ",
        "position": 28,
        "description": ""
    },
    {
        "name": "JBL Tune 125TWS True Wireless In-Ear Headphones - Pure Bass Sound, 32H Battery, Bluetooth, Fast Pair, Comfortable, Wireless Calls, Music, Native Voice Assistant (Black), Small",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/51ptPn4HP9L._AC_UY218_.jpg",
            "description": "JBL Tune 125TWS True Wireless In-Ear Headphones - Pure Bass Sound, 32H Battery, Bluetooth, Fast Pair, Comfortable, Wireles..."
        },
        "totalReviews": 34187,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 79.95,
            "priceFraction": "95",
            "beforePrice": 99.95
        },
        "asin": "B088NGD49M",
        "url": "https://www.amazon.com/dp/B088NGD49M",
        "position": 29,
        "description": "JBL PURE BASS SOUND: JBL has powered festivals and concerts around the world for decades. Now let JBL bring your own world to life with incredible Pure Bass sound in these wireless earphones..Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears.Impedance (ohms) : 14, Bluetooth version : 5.0.\nProduct Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears\nUP TO 32 HOURS BATTERY (8H IN THE EARBUDS plus 24H IN THE CASE): You can listen to these earbuds all day and all night and get a top up with just 15-minute charge. Keep your own private concert going for as long as you can keep up. Charging time (hours from empty) - 2 Hours\nFAST PAIR ENABLED BY GOOGLE: As soon as you take your earbuds out of the case, they are paired to your Android device in a single tap. After pairing, any other device can be detected even when not paired. Driver sensitivity at 1kHz/1mW (dB) 96 ,Dynamic frequency response range (Hz) 20 Hz – 20 kHz.Note:If you face issue in Bluetooth connectivity please turn off the Bluetooth function for a couple of minutes, then turn it back on\nINDEPENDENT BUDS FOR CALLS AND MUSIC: Left ear, right ear, both ears. The power of Dual Connect gives you the choice to seamlessly enjoy music or make calls with either one or both buds. And the battery life keeps up with you , as you can keep one earbud charging, while using the other one.\nCOMFORTABLE: Experience total freedom with the True Wireless JBL Tune 125TWS earbuds in full comfort. Snug-fitting they come with 3 sizes of eartips to fit your size. Bluetooth transmitter power 0 - 12dbm"
    },
    {
        "name": "Amazon Basics Rectangle Smart Plug Power Strip, Surge Protector with 3 Individually Controlled Outlets and 2 USB Ports, 2.4 GHz Wi-Fi, Works with Alexa, White",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/51tf6OzxwML._AC_UY218_.jpg",
            "description": "Sponsored Ad - Amazon Basics Rectangle Smart Plug Power Strip, Surge Protector with 3 Individually Controlled Outlets and ..."
        },
        "totalReviews": 2324,
        "rating": 4.65,
        "sponsored": true,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 26.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "B095XBHVF2",
        "url": "https://www.amazon.com/dp/B095XBHVF2",
        "position": 30,
        "description": "SMART UPGRADE: Amazon Basics Smart Power Strip works with Alexa to add voice control to your home; an easy upgrade from your traditional power strip\nCERTIFIED FOR HUMANS: Struggle-free, tinker-free, stress-free. Smart home made easy for non-experts\nCONTROL FROM ANYWHERE: Schedule lights, fans, and appliances to turn on and off automatically, or control them remotely when you’re away\nSIMPLE TO SET UP AND USE: Plug in the power strip, open the Alexa app, and get started in minutes\nINDIVIDUAL CONTROL OR GROUPING: Includes 3 independently controllable outlets plus 2 always-on USB ports. Control each outlet individually by voice or remotely; or create groups in the Alexa app to combine devices together\nNO SMART HOME HUB REQUIRED: Set up routines and schedules through the Alexa app; 2.4GHz Wi-Fi required; works exclusively with Alexa\nSURGE PROTECTION: Keeps devices safe from potentially damaging power surges\n›"
    }
]