[
    {
        "name": "Epic Journeys: 245 Life-Changing Adventures",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91lpjF5KYPL._AC_UY218_.jpg",
            "description": "Epic Journeys: 245 Life-Changing Adventures"
        },
        "totalReviews": 307,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 20.98,
            "priceFraction": "98",
            "beforePrice": 40.0
        },
        "asin": "1426220618",
        "url": "https://www.amazon.com/dp/1426220618",
        "position": 4,
        "description": "From rafting the Zambezi River's 23 stomach-flipping rapids to hiking the Inca trail and sailing from island to island in Greece, the travel experts at National Geographic reveal the world's best adventures in this stunning--and practical--treasury.\nFrom navigating the class-five rapids of the Colorado River through the Grand Canyon to sandboarding the slopes of a volcano in Nicaragua to dogsledding in the Arctic, this beautiful and comprehensive book offers trips of a lifetime for explorers and adrenaline junkies alike. Filled with more than 300 vivid photographs, this inspirational guide reveals over 225 of the planet's best destinations for hikers, skiers, divers, rafters, and more. You'll also find everything you need to know for the ultimate epic journey: what to see, when to go, and what to do. Combining adventure with cultural experiences--for example, a safari through Madagascar or visiting the ruins of Buddhist temples after sea kayaking the warm waters of Vietnam--this one-of-a-kind collection, complemented by top ten lists and adventurer essays covering everything from the best hiking trails to the top wildlife parks, will lead you to new heights of exploration.\nRead more"
    },
    {
        "name": "California Bucket List Adventure Guide & Journal: Explore 50 Natural Wonders You Must See & Log Your Experience!",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71+KWxhHWGS._AC_UY218_.jpg",
            "description": "California Bucket List Adventure Guide & Journal: Explore 50 Natural Wonders You Must See & Log Your Experience!"
        },
        "totalReviews": 235,
        "rating": 4.15,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 15.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "1955149151",
        "url": "https://www.amazon.com/dp/1955149151",
        "position": 5,
        "description": "Exploring California: A Guide to the 50 Must-See Destinations in California to Hit the Road & Start Your Adventure Today\nTraveling to California is unlike any other adventure you crossed off your bucket list. The ultimate dreamland for free spirits whose soul craves deep connection with nature, California is rich in picturesque landscapes that’ll live you breathless.\nAs you travel the distance from North to Central California, and then all the way to the Southern region, you’ll have the time of your life getting lost in the Golden State’s immersive beauty. From nature’s wonders like the Whiskeytown Falls, to the Crystal Cave, and the amazing Mojave Desert, California just begs to be explored!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "A Door into Time: An Alex Hawk Time Travel Adventure, Book 1",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/91Kodz8bTWL._AC_UY218_.jpg",
            "description": "A Door into Time: An Alex Hawk Time Travel Adventure, Book 1"
        },
        "totalReviews": 2378,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 0.0,
            "priceFraction": "00",
            "beforePrice": null
        },
        "asin": "B08FBMM41L",
        "url": "https://www.amazon.com/dp/B08FBMM41L",
        "position": 9,
        "description": "Not all guys obsess over tiny details…but Army Special Forces do.\nThe wall just didn’t look right. Alex has been trying to cope. Life after his deployment had been rough. His ex-wife thought he needed to stop disappointing their daughter. She was right.\nHe would try harder.\nWith six hours before his little girl’s fourth birthday party, he saw the anomaly. One wall was too short. Plenty of time to tear out a panel and look behind it. He found a brick wall. His house wasn’t made of brick.\n\n\nRead more"
    },
    {
        "name": "Marco Polo: his travels and adventures.",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81HxGn50o8L._AC_UY218_.jpg",
            "description": "Marco Polo: his travels and adventures."
        },
        "totalReviews": 300,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 10.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "1925729222",
        "url": "https://www.amazon.com/dp/1925729222",
        "position": 10,
        "description": "This edition is presented complete and unabridged, with larger text for easier reading by younger readers, and all the original illustrations and decorations.“I have attempted to transform the somewhat dry and monotonous translation of this narrative into an entertaining story, that may engage the attention and the interest of my young readers; for which it certainly presents ample opportunities. If the task is properly done, no one can fail to follow Marco Polo from his Venetian home, across the entire continent of Asia to the court of Kublai Khan, and in his various adventures and journeys while in the far-off Orient, without eager curiosity and ever-deepening interest. The central figure of the story is heroic, for Marco Polo was in all things manly, brave, persevering, intelligent, and chivalrous; and the scenes and incidents in which he was the leading actor were in the highest degree thrilling and dramatic.”-From the Preface by the Author.\nRead more"
    },
    {
        "name": "Tennessee State Parks Bucket List: Trip Planner & Outdoor Adventure Log List Guide | Travel Log & Memory Journal | America Passport & Stamp Book",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/719ULB9fyTL._AC_UY218_.jpg",
            "description": "Tennessee State Parks Bucket List: Trip Planner & Outdoor Adventure Log List Guide | Travel Log & Memory Journal | America..."
        },
        "totalReviews": 9,
        "rating": 5.05,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 8.49,
            "priceFraction": "49",
            "beforePrice": null
        },
        "asin": "B09KN81NZF",
        "url": "https://www.amazon.com/dp/B09KN81NZF",
        "position": 11,
        "description": "There are 56 designated parks within the Tennessee Park System - which of them would you like to visit? Or maybe you want to take on a challenge visiting ALL of them? If you're planning something like that, this book absolutely has to come with you! It's not just writing everything down, but also saving memories and being able to read them years after. If there’s anything that the Tennessee State Parks are known for, it’s versatility. Whether you want to relax on a beach, go horseback riding, snowmobiling, or hunting, there’s something to be found at every state park in Tennessee.\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "Washington Bucket List Adventure Guide: Explore 100 Offbeat Destinations You Must Visit!",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71FRS8-AfBL._AC_UY218_.jpg",
            "description": "Washington Bucket List Adventure Guide: Explore 100 Offbeat Destinations You Must Visit!"
        },
        "totalReviews": 65,
        "rating": 3.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 14.89,
            "priceFraction": "89",
            "beforePrice": null
        },
        "asin": "1957590009",
        "url": "https://www.amazon.com/dp/1957590009",
        "position": 12,
        "description": "Exploring Washington: Guide To Over 100 Must-Visit Destinations\nTraveling to Washington is unlike any other adventure you crossed off your bucket list. The ultimate dreamland for adventurous spirits whose soul craves deep connection with nature, Washington is rich in picturesque landscapes that’ll leave you breathless.\nAs you travel the distance through the forests and mountains of the Pacific state, you’ll have the time of your life getting lost in the Evergreen State’s immersive beauty. From nature’s wonders like the Channeled Scablands, to the Selkirk Range, and the amazing Mount Rainier, Washington just begs to be explored!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "Route 66 Adventure Handbook: High-Octane Fifth Edition",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71vnqjAPlyL._AC_UY218_.jpg",
            "description": "Route 66 Adventure Handbook: High-Octane Fifth Edition"
        },
        "totalReviews": 434,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.99,
            "priceFraction": "99",
            "beforePrice": 19.95
        },
        "asin": "1595800913",
        "url": "https://www.amazon.com/dp/1595800913",
        "position": 13,
        "description": "Route 66 Adventure Handbook\nis your personal guide to the vanishing American roadside, with all of its exuberance, splendor, and absurdity.\n\nFor this updated and expanded fifth edition, Drew Knowles has included it all: magnificent architecture, natural wonders, Art Deco masterpieces, vintage motels and cafes, unique museums, offbeat attractions, fascinating artifacts and icons, and kitschy tourist traps. The addition of city maps, showing the multiple paths of Route 66 and displaying the exact locations of points of interest, is a major improvement over the already critically acclaimed fourth edition of the book. The fifth edition also includes hundreds of beautiful new photographs and the addition of dozens of new attractions.\n\nAdditionally, GPS coordinates have been added for virtually all of the photos, so that travelers can plug the information into their smartphones and other navigation devices and instantly determine where each photo was taken and compare it to the condition of that particular site at the time of their visit.\n\nFilled with wonderfully quirky side trips and fun bits of trivia,\n\n\nRead more"
    },
    {
        "name": "Travel the World Without Worries: An Inspirational Guide to Budget and Adventure Travel (3rd Edition)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/61zcDrhzLNL._AC_UY218_.jpg",
            "description": "Travel the World Without Worries: An Inspirational Guide to Budget and Adventure Travel (3rd Edition)"
        },
        "totalReviews": 293,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 18.99,
            "priceFraction": "99",
            "beforePrice": 18.99
        },
        "asin": "179348306X",
        "url": "https://www.amazon.com/dp/179348306X",
        "position": 14,
        "description": "* A PERFECT GIFT FOR A TRAVELLER! *\nPlanning a big trip abroad can be an overwhelming task, but this book makes it easy with in-depth advice that helps you properly plan, pack and prepare—so that you can travel anywhere with confidence. Whether you’re going away for a few weeks, months, or even a whole year,\nTravel the World Without Worries\nwill act as your trusted guide and friend through the entire process.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "Confessions of a Middle-Aged Runaway: An RV Travel Adventure",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/711Z-56Bs-L._AC_UY218_.jpg",
            "description": "Confessions of a Middle-Aged Runaway: An RV Travel Adventure"
        },
        "totalReviews": 254,
        "rating": 4.35,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 13.29,
            "priceFraction": "29",
            "beforePrice": 14.99
        },
        "asin": "1733641009",
        "url": "https://www.amazon.com/dp/1733641009",
        "position": 15,
        "description": "For fans of Wild and Eat, Pray, Love, an entertaining story of a five-year, motorhome road trip taken by a woman and her dog.Have you ever felt suffocated by your routine and responsibilities, or just longed for some adventure? Heidi Eliason did, so at the age of 45 she quit her job, sold her house, bought a motorhome, and embarked on a five-year road trip with her dog, Rylie. It was a journey that transformed her life.Through the challenges of managing the Green Monster—her motorhome—traveling in Mexico, and getting derailed by Mr. Wrong, she learned—sometimes the hard way—that chasing the corporate ladder and storybook romance was not always a sure route to happiness. She struggled with insecurities, faced her fears, and dug her way out of depression. By taking a leap into the unknown, Heidi found a new community of friends, met wildlife, traveled the Baja Peninsula, discovered the magic of the sea, and experienced freedom like she had never known.At a time when the American Dream is uncertain for so many, more people are turning to alternative lifestyles such as the van life movement and fulltime RV travel. Confessions of a Middle-Aged Runaway may help others to find the courage to jump off the hamster wheel of the conventional Dream and make a transformative journey of their own.\nRead more"
    },
    {
        "name": "Florida State Parks",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/51efhN5tv1L._AC_UY218_.jpg",
            "description": "Florida State Parks"
        },
        "totalReviews": 306,
        "rating": 4.45,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 19.95,
            "priceFraction": "95",
            "beforePrice": null
        },
        "asin": "0898867312",
        "url": "https://www.amazon.com/dp/0898867312",
        "position": 17,
        "description": "* Includes all natural and historical parks, preserves, and recreational areas.\n* Covers one of the largest and best-organized state park systems in the country.\n\nThis guidebook to Florida state parks includes information on where to hike, camp, snorkel, scuba dive, boat. and more! Florida is more than Disney World and Busch Gardens, raceways and water shows. Natural Florida is where to be active in outdoor sports, to sail, to bird watch, or to just laze on the beach. This comprehensive guidebook covers the entire Florida State Park system will help you plan an adventure you'll never forget. Whether you're seeking underwater coral reef gardens, stunning orchid blooms, or the playgrounds of panthers, painted buntings, and manatees, you'll find them within the pages of\n\n\nRead more"
    },
    {
        "name": "Let The Adventure Begin: 6x9 Lined Journal, Memory Book, Travel Journal, Diary To Record Your Thoughts, Graduation Gift, Teacher Gifts, Motley Map ... People Who Love To Travel (Travel Journals)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81aZLIkHjsL._AC_UY218_.jpg",
            "description": "Let The Adventure Begin: 6x9 Lined Journal, Memory Book, Travel Journal, Diary To Record Your Thoughts, Graduation Gift, T..."
        },
        "totalReviews": 164,
        "rating": 4.55,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 6.99,
            "priceFraction": "99",
            "beforePrice": null
        },
        "asin": "1091394768",
        "url": "https://www.amazon.com/dp/1091394768",
        "position": 18,
        "description": "LET THE ADVENTURE BEGIN\nThis beautiful journal with a vintage Motley Map design is perfect for recording your memories of new experiences such as trips and vacations, new relationships, a new baby, new job, and all of your first time adventures! This journal makes a thoughtful and useful gift for world travelers, teachers, new moms and dads, newlyweds, and graduates.\nFeatures and Uses of this Journal Notebook\n6\"x9”– Fits easily in a backpacks, tote bags, and handbags\n6\"x9”– Fits easily in a backpacks, tote bags, and handbags\n\n\n\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "United States, Northeast Map (National Geographic Adventure Map, 3127)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81KAIY7NWpL._AC_UY218_.jpg",
            "description": "United States, Northeast Map (National Geographic Adventure Map, 3127)"
        },
        "totalReviews": 323,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 13.46,
            "priceFraction": "46",
            "beforePrice": 14.95
        },
        "asin": "1566957214",
        "url": "https://www.amazon.com/dp/1566957214",
        "position": 19,
        "description": "• Waterproof • Tear-Resistant • Travel Map\nThere are few nations as vast and spectacularly diverse as the United States of America. From the Atlantic to the Pacific, \"America the Beautiful\" offers boundless destinations and experiences for travelers seeking outdoor adventures, small town delights, or the excitement of urban culture.\nThe United States Northeast Adventure Map will guide you through the states of the Mid Atlantic region (Virginia, West Virginia, Maryland, Delaware and Pennsylvania, New York and New Jersey) and New England (Connecticut, Rhode Island, Massachusetts, Vermont, New Hampshire, and Maine). Each of these states is rich in history and nature and has its own distinct character, from the dramatic rocky shoreline of Maine's Acadia National Park and the beaches and dunes of Cape Cod Massachusetts, through the Adirondack Mountains of New York, the White and Green Mountains of New Hampshire and Vermont, and the rolling Allegheny and Pocono Mountains of Pennsylvania. The diverse megalopolis of Washington DC, Philadelphia, New York City, and Boston that covers the Atlantic coastal plain is interspersed with historic seaports and beautiful parks, beaches, marshes, and bays including Chesapeake and Delaware Bays. The inland cities of Pittsburgh, Syracuse and Albany are also included on this map. There is simply no better map for exploring the Northeast United States.\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "Mission Rome: A Scavenger Hunt Adventure (Travel Guide For Kids)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/71nWya2i5gL._AC_UY218_.jpg",
            "description": "Mission Rome: A Scavenger Hunt Adventure (Travel Guide For Kids)"
        },
        "totalReviews": 220,
        "rating": 4.75,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": true,
        "amazonPrime": false,
        "price": {
            "discounted": true,
            "priceSymbol": "$",
            "currentPrice": 12.97,
            "priceFraction": "97",
            "beforePrice": null
        },
        "asin": "098922676X",
        "url": "https://www.amazon.com/dp/098922676X",
        "position": 20,
        "description": "Headed to Rome with kids? Want to ensure your young explorers get the most out of their incredible opportunity to experience the Eternal City? Then you've come to the right place!\nMission Rome\ntakes your young travelers through the famous sights of Rome, engaging them in an exciting scavenger hunt as you explore city landmarks together.\nSay 'arrivederci' to a trip filled with the stress of keeping everyone entertained. Instead, say 'buon giorno!' to a memorable family vacation. Imagine - your kids will be excited to sightsee (yes, even at museums!) as you discover the wonders of Rome as a family.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead more"
    },
    {
        "name": "The Baron Trump Collection: Travels and Adventures of Little Baron Trump and his Wonderful Dog Bulger, Baron Trump's Marvelous Underground Journey, The Last President (or 1900)",
        "leftInStock": null,
        "image": {
            "url": "https://m.media-amazon.com/images/I/81lOEfMWK4L._AC_UY218_.jpg",
            "description": "The Baron Trump Collection: Travels and Adventures of Little Baron Trump and his Wonderful Dog Bulger, Baron Trump's Marve..."
        },
        "totalReviews": 2583,
        "rating": 4.65,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 12.98,
            "priceFraction": "98",
            "beforePrice": 8.91
        },
        "asin": "1789870003",
        "url": "https://www.amazon.com/dp/1789870003",
        "position": 21,
        "description": "This collection unites Ingersoll Lockwood's classic\nBaron Trump\nadventure stories in one volume.\nFilled with exotic flights of fancy, the Baron Trump tales feature the titular character - a wealthy boy who lives in Trump Castle. His actual name is Wilhelm Heinrich Sebastian Von Troomp, but for the sake of simplicity he chooses to go by his title of Baron Trump.\nThe young fellow embarks on time travelling adventures through human history. Through his travels, he meets societies of people and tribes from long ago, picking up aspects of their language and social customs. Accompanied by his faithful and protective companion hound Bulger, the young Baron navigates a variety of adventures and surmounts many obstacles.\n\n\nRead more"
    },
    {
        "name": "The Complete Guide to Indiana State Parks",
        "leftInStock": "Only 1 left in stock - order soon.",
        "image": {
            "url": "https://m.media-amazon.com/images/I/91ywdatQJXL._AC_UY218_.jpg",
            "description": "The Complete Guide to Indiana State Parks"
        },
        "totalReviews": 99,
        "rating": 4.85,
        "sponsored": false,
        "amazonChoice": false,
        "bestSeller": false,
        "amazonPrime": false,
        "price": {
            "discounted": false,
            "priceSymbol": "$",
            "currentPrice": 27.0,
            "priceFraction": "00",
            "beforePrice": 9.63
        },
        "asin": "0253025192",
        "url": "https://www.amazon.com/dp/0253025192",
        "position": 22,
        "description": "Whether you are looking for a weekend hike in the woods, a family outing, or great locations to study the local flora and fauna, Indiana state parks provide something for everyone. Visiting all 25 state parks in Indiana, Nathan Strange and Matt Williams profile and photograph the features that make Indiana parks beautiful and unique. Each park profile includes an engaging history of the park's origins and interviews with dedicated staff members about their favorite landscapes, wildlife, and adventures available in each park. This complete guidebook also offers extensive descriptions of the best park trails, along with the authors' hiking experiences, helpful maps, and directions. Featuring 109 exquisite full-color photographs and inside facts,\n\n\nRead more"
    }
]