[
    {
        "title": "Children Handmade Creative Art Painting Toys Undersea Aquarium Clay diy Kindergarten Work Material Package",
        "path": "Children-Handmade-Creative-Art-Painting-Toys-Undersea-Aquarium-Clay-diy-Kindergarten-Work-Material-Package-i.419217874.22727080136",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-sw3qk9aiaknvb0",
        "price": 551000,
        "location": "Mainland China",
        "rating": 3,
        "sold": 2,
        "description": "Welcome To My Store, Please Click [Follow] To Receive Coupons.\n\n💝Product Material: Clay/Plastic\n\n💝Art Material Package Use:\n1. Let Children Learn Art Knowledge Step By Step In Play, Improve Their Ability To Perceive Beauty, Create Beauty.\n2. Experience The Joy And Sense Of Accomplishment Of Artistic Creation.\n3.Through Painting And Imagination, Let Children Develop Different Creative Works And Cultivate Children's Creativity.\n4. Exercise Children's Hand-Eye Coordination And Enhance Creative Thinking.\n\n💝Purchase Instructions:\n1. All The Products Are Material Packages, Need Children To Create By Themselves, Parents Can Also Accompany Children To Create.\n2. This Product Does Not Contain Coloring Tools, You Need To Buy It Yourself.\n3.If You Need To Make A Video, You Are Welcome To Contact Customer Service For It."
    },
    {
        "title": "HDY 3D Pen Toys Kids Digital Intelligent 3D Printing Pen High Temperature DIY Print Drawing Pens Graffiti with Printing Supplies PLA Filament Painting Doodle Arts & Crafts 儿童3D打印笔 Children USB Cable Draw Tool Birthday Gift for Boys Girls",
        "path": "HDY-3D-Pen-Toys-Kids-Digital-Intelligent-3D-Printing-Pen-High-Temperature-DIY-Print-Drawing-Pens-Graffiti-with-Printing-Supplies-PLA-Filament-Painting-Doodle-Arts-Crafts-3D-Children-USB-Cable-Draw-Tool-Birthday-Gift-for-Boys-Girls-i.101833097.3154085499",
        "image": "https://down-sg.img.susercontent.com/file/37595321bcc5f87a93718ca60595b57e",
        "price": 399000,
        "location": "Mainland China",
        "rating": 4.602150537634409,
        "sold": 7,
        "description": "The products are all in stock, if you like, you could place order and we will arrange shipment for you as soon as possible\n\nProduct Name: Kids DIY 3D Printing Pen\nRecommended age: Over 5 Years Old\n\n【Product features】\n☆Creative 3D Printing Pen\nThis intelligent 3D printing pen for kids to create toys by themselves, which is very beneficial to develop kids’ hands-on skills and mental development ability.\n☆National Standard PCL Filament\nThe printing supplies are made of high quality materials and with multiple colors, kids can draw whatever they image.\n☆Friendly Filament to Touch\nThe filament going out is in low temperature, which is very friendly to your skin and you could even draw on your skin.\n☆Speed Control Temperature Adjustment\nWhen you input or output the filament, you could press the Speed Control button to control the speed and draw in a proper speed. And the temperature can be adjusted at any time.\n\n【Packing List】\n3D Printing Pen*1\nUSB Cable*1\n5m Filament*3 (Random Color)\nUser Manual*1\n\n【Q&A】\n1.How many days I can receive parcel?\nNormally, we send out parcel at the day you order, need 8-15 days to arrive.\n2.How about the product quality?\n100% original material, pass CCC and Europe test. Good for kids.\n3.How about the seller guarantee?\nOur shop insure that the product is 100% safe and good condition. If it have any situation, we can help you to figure it out. The warranty is available.\n\n【Precautions】\nPlease use this product under the supervision of an adult. All packaging and packaging components must be removed before the child is allowed to play. Wipe the toy with a damp cloth after use to keep it clean. Please stay away fire.\n\n【Worry-free Purchase】\nIf you receive any quality problems, you can rest assured that we will unconditionally replace you with new quality-assured products. If you have any questions, you can contact us at any time, we will provide you with professional.\n\nWelcome to HDY Official Store where we strive to provide our customers an array of products that satisfy demand for quality and efficiency. Buy our products from Shopee Mall in a worry-free manner as we guarantee 100% authenticity. Shopping can't get any easier than this, so start today!"
    },
    {
        "title": "50ml Simulation Cream Glue Children's Toys Handmade diy Design Material Phone Case Hairpin Frame Surrounding Beauty Creative Material Children's Gift",
        "path": "50ml-Simulation-Cream-Glue-Childrens-Toys-Handmade-diy-Design-Material-Phone-Case-Hairpin-Frame-Surrounding-Beauty-Creative-Material-Childrens-Gift-i.915290312.22736439579",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-lf41kyz15dm72d",
        "price": 178000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 35,
        "description": "Place Of Origin: Zhejiang Province\nMaterial: Resin\n\nNote:\n1, Each Bottle Of Cream Glue Will Match To Give 1 Flower Mouth, Buy A Few Bottles Will Give A Few Flower Mouth\n2, The Suit Part Please Note The Color Number In The Order, Or Contact Customer Service To Inform The Color Number.\n\nPrecautions:\n1, This Product Is Prohibited To Eat\n2, Avoid Direct Sunlight, You Need To Close The Lid Tightly After Use\n3, After Doing It Well, It Needs To Be Placed In A Cool And Ventilated Place To Dry Naturally, And The Coloring Layer Will Dry For About 24 Hours, And The Coloring Thickness Will Take About 72 Hours\n4, If It Is A diy Phone Case, The Silicone Phone Case Cannot Be Used, Because Of The Characteristics Of The Glue, The Silicone Case Is Not Strong\n5, If It Is Not Easy To Squeeze, You Can Soak It With Hot Water, Or Rub It With Your Hand And Heart To Heat It Will Be Soft\n6, It Is Normal If The Lid Is Opened A Little Watery Flow Out, As Long As It Is Upside Down And Put It Upside Down For A While\n\nAll Orders Will Be Shipped Within 1-2 Days, Please Pay Attention To The Changes In The Status Of The Order. If You Are In A Hurry, Please Communicate With The Store Xiaoer In Advance\n\nIf There Is Any Damage To The Goods Received, Please Contact The Store Xiaoer Immediately, We Will Arrange For Re-Sending According To The Situation, Or Refund Processing.\n\n[Follow This Store, You Can Get Coupons]\n\n[More Full Discount Coupons Are Waiting To Be Received, Get Coupons Before Shopping]"
    },
    {
        "title": "DIY Toy Book Children's Cartoon kuromi Melody Creative Quiet Book Decompression Toy Book Semi-Finished Product Changing Material Package",
        "path": "DIY-Toy-Book-Childrens-Cartoon-kuromi-Melody-Creative-Quiet-Book-Decompression-Toy-Book-Semi-Finished-Product-Changing-Material-Package-i.477440506.23568018505",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lguig96r9ahwf3",
        "price": 245000,
        "location": "Mainland China",
        "rating": 4.565217391304348,
        "sold": 77,
        "description": "Tips: This is a DIY kit, not a finished product, you need to cut and make it yourself.\nThe Material Package Contains:Drawings、Cotton、Double Sided Tape、Transparent tape(Scissors Need to Be Brought by Yourself)\n\nStyle 1# is mini, about 6*7CM, other styles are normal size,about 9*12CM\n\nPackage Includes: 1*DIY Toy Book"
    },
    {
        "title": "【Office】50 Sheets Shrink Films Kit Shrinky Art Film Paper Heat-Shrink Sheets for DIY Craft Ornaments Pendants Earrings Keychains Accessories, 7.9 * 5.7 Inches",
        "path": "Office50-Sheets-Shrink-Films-Kit-Shrinky-Art-Film-Paper-Heat-Shrink-Sheets-for-DIY-Craft-Ornaments-Pendants-Earrings-Keychains-Accessories-79-57-Inches-i.277026990.14225132535",
        "image": "https://down-sg.img.susercontent.com/file/4a279ff239c93018824a569f3f4aadb9",
        "price": 1589000,
        "location": "Mainland China",
        "rating": 4.7555555555555555,
        "sold": 43,
        "description": "Features:\nHigh quality 50 * heat shrink sheets, transparent color. 20 * 14.5cm / 7.9 * 5.7in each sheet size, 0.2mm thickness.\nThere is no sanding on both sides, you need to polish the heat shrink sheet yourself. A protective film is pasted on one side, which needs to be torn off when using.\nYou can draw your favorite patterns on the heat shrink sheet, cut it out with scissors, it will shrink after heating.\nCan be used for making pendants, keychains, earrings, necklaces, bookmarks and other DIY accessories.\nUse your imagination and create your artistic work, enjoy your time at home.\n\nSpecifications:\nColor: Transparent/Translucent(optional)\nTransparent: There is no sanding on both sides\nTranslucent: One side frosted and the other glossy\nQuantity: 50 Sheets\nSize(1 Sheet): 20 * 14.5cm / 7.9 * 5.7in\nThickness(1 Sheet): 0.2mm\nPacking List:\n50 * Heat Shrink Sheets"
    },
    {
        "title": "DIY Arts and Crafts Supplies Kit Set Activity Craft Materials with Carrying Box Handmade Educational Gift for School Kindergarten Home Craft Art Supplies",
        "path": "DIY-Arts-and-Crafts-Supplies-Kit-Set-Activity-Craft-Materials-with-Carrying-Box-Handmade-Educational-Gift-for-School-Kindergarten-Home-Craft-Art-Supplies-i.277026990.12506585451",
        "image": "https://down-sg.img.susercontent.com/file/e400ac8ca5f6aa8de3ec684069f7f5e5",
        "price": 1592000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 15,
        "description": "Features:\nHandmade DIY materials, 2000+ piece kit.\nStudents can use their imagination to create their own unique art works.\nGive students the greatest variety of artistic tools, students can create beautiful handmade arts and crafts.\nPackage includes wood sticks, cute eyes, pompoms, beads, paper, safety scissors, pipe cleaners, sequins, buttons, plastic carrying box, etc.\nExcellent for classrooms or home projects.\n\nSpecifications:\nPackage Size: 25 * 19 * 13cm / 9.8 * 7.5 * 5.1in\nPackage Weight: 526g / 18.6oz\nPacking List:\n1 * DIY Materials Kit"
    },
    {
        "title": "🇸🇬[SG Stock] Complete DIY Art Supplies for Kids All in One Crafting School Kindergarten Home Arts Set Crafts Folding Box",
        "path": "SG-Stock-Complete-DIY-Art-Supplies-for-Kids-All-in-One-Crafting-School-Kindergarten-Home-Arts-Set-Crafts-Folding-Box-i.650404568.16920786142",
        "image": "https://down-sg.img.susercontent.com/file/fb151ae7f8c4860c86e8ae04fce32341",
        "price": 1331000,
        "location": "SG",
        "rating": 4.833333333333333,
        "sold": 16,
        "description": "Description:\n- Explore your creativity: Let your imagination run wild create a multitude of projects out of crafting material.\n\n- Develop innovative ability: It helps to promote children's brain development and creativity; enhance imagination, concentration and hands-on ability.\n\n- Indoor activity: These projects is easy and fun! Kids will enjoy themselves when create with friends and families!\n\n- Decor as you like: Use your imagination to make your projects, no fixed template.\n\n- Gift: Give this DIY craft to little girls/boys for christmas, birthday, and holiday gifts.\n\nSpecification:\nMaterial: Wooden+Plastic\n\nToolBox Size: 32cm x 19cm x 14cm\nTub Size: 19.5cm x 12cm\n\nPackage Includes:\n1 x Art Supply Box \nor\n1 x Art Tub\n\n(Item Includes: Misc clips, toy eyes, scissor, coloured wooden sticks, feathers, colored paper, etc.)\n\n🚚DELIVERY：\n1. We will send out within 2 working days after placing the order.\n\n📣NOTICE: \n1. Please allow 1-2cm of variances due to manual measurements.\n2. Colour variations in devices or monitor screens may not reflect actual product colour.\n\n🔺FEEDBACK:     \n1. If you have any problem with your order, please contact us, we will try our best to provide satisfactory solution ASAP.  \n2. Product carton maybe out of shape due to shipment handling but the item is in good condition.\n3. There maybe slow reply outside office hours. Thank you for your patience as we will reply at our earliest availability.\n\nThank you for shopping with us."
    },
    {
        "title": "✅[SG] Mica Pigment Powder High-Quality Mica Pigments for Epoxy Resin DIY Art & Craft Jewelry Nails Slime Epoxy Resin Dye",
        "path": "SG-Mica-Pigment-Powder-High-Quality-Mica-Pigments-for-Epoxy-Resin-DIY-Art-Craft-Jewelry-Nails-Slime-Epoxy-Resin-Dye-i.267712007.19623311039",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134202-7qvex-lgm16g66chdxed",
        "price": 128000,
        "location": "SG",
        "rating": 4.951219512195122,
        "sold": 197,
        "description": "\n\n\nMica Pigment Powder\nHigh-Quality Mica Pigments for Epoxy Resin DIY\nArt & Craft Jewelry Nails Slime Epoxy Resin Dye\n\nDescription:\n- Natural MICA Pigment Powder.\n- Finely ground stone from the Mineral Mica Pigment\n- 50 colours are vibrant and shimmery.\n\n\n- Pearl colour dyes natural cosmetic grade powders provide a dazzling beautiful colour selection for DIY projects such as:\n✅ DIY Epoxy Resin Art & Crafts\n✅ Candles Making\n✅ Soap Making\n✅ Toys\n✅ Decorative Materials\n✅ Bath bombs\n✅ Handmade Soap dye\n✅ Slime Pigment\n✅ Nail Art\n✅ Non-Toxic\n✅ So much more...\n\nSpecification:\nType: Mica Pigment Powder\nColours: 50 Colours\nVolume: 3g per bottle individually packaged\n\n* Please be advised that the colours on your screen will be slightly different as different desktop or mobile screen display colours and settings are different.\n\nWhy Buy from ArtFarm Singapore?\nWe Guaranteed ALL Our Products and Honor Your Support.\nYES, if you found out ANY Items that are not in good condition, WE WILL Replace them for you immediately. We just need you to just take a picture and send us in the chat.\n\nWe will make sure we do it right for you.\nJust write to us in the chat and send us your item pictures for verifications.\n\n\n\n\n\n\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐\n✅  Good offer not to be missed.\n✅  Locally stock up for fast purchases.\n✅  Don't have to wait for shipment from overseas.\n✅  If items are damaged during shipping, so much trouble again.\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐\nWe are a Local Art & Craft Supplier located at our new office in KB-1, Kaki Bukit Ave 3.\nWe ran roadshows in Parkway, Katong, Bedok, Novena, Takashimaya, Tanglin Mall, Bugis, Junction8, NEX, CompassOne,  Rivervale, Beauty World, HeartlandMall, IMM, JCube, Anchorpoint, Jem, Jurong East & West, Tampines, Woodlands, Thomson, City Square, Bukit Timah, Queenstown, Biopolis, The Star, Suntec, Marina Square etc.\nWe supply to many retailers in Singapore and Malaysia Johor.   🇸🇬  🇲🇾\n⭐ ⭐ ⭐ ⭐ ⭐ ⭐"
    },
    {
        "title": "Montessori Busy Board for Toddlers - Wooden Sensory Toys - Toddler Learning Activities for Fine Motor Skills Travel Toy - Educational Toys for Kids",
        "path": "Montessori-Busy-Board-for-Toddlers-Wooden-Sensory-Toys-Toddler-Learning-Activities-for-Fine-Motor-Skills-Travel-Toy-Educational-Toys-for-Kids-i.410931893.11036111235",
        "image": "https://down-sg.img.susercontent.com/file/1b93805392baa87898fd79d2093ffdf3",
        "price": 519000,
        "location": "Mainland China",
        "rating": 4.894736842105263,
        "sold": 4,
        "description": "Description:\nBusy activity board toys allow children to tie and zip their way into independent dressing life skills.\nSpecially designed for 1-2 years old babies learning how to zip, buckle, laces etc motor skills.\nHelps children to use their hands for precise movements,encourages children to enjoy using their senses.Training your baby's finger ability.\nMade of natural wood, the busy board is flexible with no hard corners.Safe to play.\nSmall toy great for traveling like flight on plane or trip by car. Great gift for 1-2 years old children.\nSpecification:\nMaterial: Wooden\nSize:39x29.5x1.5cm/15.35x11.61x0.59inch\nPackage Includes:\n1 Piece Busy Board\nNote:\nPlease allow slight dimension difference due to different manual measurement."
    },
    {
        "title": "diy Handmade Three-Dimensional Painting Decorative Mosaic Creative Ornaments Home Decorations Children's Educational Material Package Art And Handicraft Set Work Materials",
        "path": "diy-Handmade-Three-Dimensional-Painting-Decorative-Mosaic-Creative-Ornaments-Home-Decorations-Childrens-Educational-Material-Package-Art-And-Handicraft-Set-Work-Materials-i.419217874.13293083193",
        "image": "https://down-sg.img.susercontent.com/file/c02ff26c186a0ba3b9e1844b269c74b2",
        "price": 1620000,
        "location": "Mainland China",
        "rating": 4.3,
        "sold": 6,
        "description": "Welcome to my shop, please click [Follow] to receive coupons.\n\n💝Product material: solid wood/glass, etc.\n\n\n💝The white frame is wooden, the size is 20 * 20cm\n\n💝After the mosaic patch glue is dry, use the caulking agent."
    },
    {
        "title": "Cheap cream glue goo card big set hand account sticker diy handmade material bag goo bag cheap set children's and girls' toy reward gift Children's Day gift",
        "path": "Cheap-cream-glue-goo-card-big-set-hand-account-sticker-diy-handmade-material-bag-goo-bag-cheap-set-childrens-and-girls-toy-reward-gift-Childrens-Day-gift-i.915290312.22066341833",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfk-lg3k0it2z6rqa0",
        "price": 1158000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 9,
        "description": "Note: \n1、The storage box comes in pink and purple, and the default color is the pink box. If a baby likes purple, you can add it to the order note or contact customer service\n2、Cream Glue Cuckoo Set Product Because Each Product Has A Lot Of Quantity And Cannot Guarantee That Each Product Color Style Is Consistent With The Picture (Including Sticker Pattern, Resin Accessories, Cuckoo Shape, Cream Glue Color, Hairpin Color, Bead Chain Color, Etc.).The Quantity Will Be Sufficient\nAll Orders Will Be Shipped Within 1-2 Days, Please Pay Attention To The Changes In The Status Of The Order. If You Are In A Hurry, Please Communicate With The Store Xiaoer In Advance\n\nIf There Is Any Damage To The Goods Received, Please Contact The Store Xiaoer Immediately, We Will Arrange For Re-Sending According To The Situation, Or Refund Processing.\n\n[Follow This Store, You Can Get Coupons]\n\n[More Full Discount Coupons Are Waiting To Be Received, Get Coupons Before Shopping]\n\n[Write A Good Review When You Receive The Goods, And Give A Store Coupon]"
    },
    {
        "title": "Yuykcei Epoxy Resin Pigment -26 Colour Epoxy Resin Dye - Highly Concentrated Epoxy Resin Colorant for Resin Colour Art, DIY Jewelry Making Supplies - AB Resin Colouring for Paint, Crafts - 10ml Each",
        "path": "Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
        "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
        "price": 2148000,
        "location": "Mainland China",
        "rating": 4.851063829787234,
        "sold": 0,
        "description": "26Colors Epoxy Resin Pigment:Total 26 beautiful translucent colors liquid epoxy pigment,red,fuschia,lemon yellow,brown,sky blue,orange,rose red,pink,yellow,azure,sapphire blue,purplish red,purple,blue,green,beryl green,fluorescence green,golden yellow,grass green,emerald green,peacock blue,cherry red,coffee, violet,white,black with bottled package,each resin colorant 10ml/0.35oz.\nExcellent Choice for Resin Projects: The resin dye mix well into resin, and these epoxy resin color pigments are very concentrated,High concentration of epoxy resin colour pigments, just a drop and you will be shocked by the strong dyeing effect.\nSAFETY & WIDE USE - Our epoxy oily colour dye are all non-toxic, no harsh chemicals, cruelty free.These resin pigments can be widely used on resin jewelry and crafts decorations, jewelry making, paint, garment accessories, or other DIY making.\nEasy To Use: It’s quite easy to squeeze the epoxy resin pigment out of the bottle with specially designed nozzle, transparent and soft bottles you can control the amount easily.Beginner friendly and the experienced/veteran can enjoy it as well.\nNOTE: Liquid resin dye will get best color effect mixed with EPOXY RESIN. Just mix them well and wait it cured, no catalyst needed. lf you have any questions or issues regarding the epoxy resin coloring please do not hesitate to send the seller a message through Amazon and we will respond within 24 hours."
    },
    {
        "title": "Guka Sticker Set Girl Children Stationery Gupan Handbook Material Full Handmade diy Gift Pack",
        "path": "Guka-Sticker-Set-Girl-Children-Stationery-Gupan-Handbook-Material-Full-Handmade-diy-Gift-Pack-i.891301032.18668008086",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-zxl37tzqjskv60",
        "price": 4860000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Welcome To The Store~~ ️\n ►About Us◄ We Will Release New Exquisite Goods From Time To Time, And Strive To Give Customers The Best Shopping Experience. If You Don't See The Products You Like, You Are Welcome To Leave A Message!\n🥇Resolutely Do Not Sell Garbage, Inferior Goods\n🥈We Pay Great Attention To After-Sales Service, Product Quality\n\nName: Guka Sticker Set\nColor Color: Advanced Configuration-427 Pieces Of Luxury Card Set+Storage Box, Advanced Configuration-427 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-507 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-592 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-674 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-750 Pieces Of Luxury Card Set+Three-Layer Storage Box, Advanced Configuration-832 Luxury Gu Card Set+Three-Layer Storage Box\nMaterial: ppc\nStyle: Cartoon\nCraft: Sticker\nApplicable Gift-Giving Occasions: Other\nApplicable Gift-Giving Relationship: Juniors, Children, Classmates\nApplicable Festivals: Children's Day\nWhether It Is A Gift: Yes, Personal Gift\nWhether Cross-Border Export Special Supply Source: No\nWhether IP Authorization: No\n\n✨✨✨Pre-purchase Notice\n\n►►►Follow Polite Attention: Follow The Store, Receive Information, And Receive Coupons~ \n►►►About Free Shipping: You Can Enjoy Free Shipping When You Reach The Marked Free Shipping Threshold~ \n►►►About Shipping: Spot Goods, Can Be Shipped The Next Day After Placing The Bid~ \n►►►About Arrival: Under Normal Circumstances, 6-10 Days To Taiwan (For Reference Only)~ \n►►►About After-Sales: If You Have Any After-Sales Questions After Picking Up The Goods, You Can Contact Us At Any Time~ \n►►►Real-name Authentication: You Need To Complete The Double Certification Of Shrimp Skin And Yili Commission, Otherwise The Goods Cannot Be Received~ \n►►►Due To The Resolution Of The Computer Screen, Brightness, Contrast, Etc., The Real Color May Be Slightly Different From The Picture.Hope To Know \n►►►The Product Dimensions Are All Measured By Hand, Please Allow 1-2CM Difference!Please Understand \n►►►After After Shipment, If The Order Logistics Status Displays The \"Shopee Logistics Center\" For A Long Time, And The Transfer Logistics And Distribution Is Being \"Not Updated, It May Be Due To Being Sampling By The Customs, It Is Recommended To Go To The EZWAY (Yili Commission) APP To Find The Corresponding Order, Click\" The Declaration Is Consistent \"(There May Be Cases Where The Declaration Amount And Order Amount Are Different, Which Will Not Affect It, And It Is Good To Click The Declaration Normally); If There Is No Relevant Declaration Information,, Please Continue To Pay Attention To Logistics News \n\nIf You Like It, Remember To Follow The Fans, Pay Attention To It Politely!New Products And Promotions Continue!\n\n🌈[Tip]: Be Sure To Choose Home Delivery To Buy Large Items Or Multiple Items To Avoid Over-Material Delivery In Store.If The Size Of Multiple I"
    },
    {
        "title": "American Black Walnut Wood Raw Wood Square Premium DIY Plate Material Handmade Material Sculpting Materials Customization/Wood Block wood material Carving Wooden DIY craft",
        "path": "American-Black-Walnut-Wood-Raw-Wood-Square-Premium-DIY-Plate-Material-Handmade-Material-Sculpting-Materials-CustomizationWood-Block-wood-material-Carving-Wooden-DIY-craft-i.469283559.20447361480",
        "image": "https://down-sg.img.susercontent.com/file/e62accf73e521a793e75e58366369913",
        "price": 972000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Material: log\nAmerican black walnut wood raw wood square premium DIY plate material handmade material sculpting materials customization"
    },
    {
        "title": "30 Pcs Retro Letter Sheet Material Paper Junk Journal Planner Scrapbooking Vintage Decorative Diy Craft Background Paper",
        "path": "30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
        "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
        "price": 210000,
        "location": "Mainland China",
        "rating": 4.833333333333333,
        "sold": 4,
        "description": "Material: Paper\nSize: Approx 110*150mm\nQuantity: 1 pack/30pcs\nCode number: 02688\nApplication for decoration diary, notebook, planner, album, letter, gift box, bottle, cup, scrapbook, cellphone and so on.\nAll items are on hand and ready to ship."
    },
    {
        "title": "20 Pcsbox DIY Real Dried Flowers For Nail Decoration Art Craft Making Jewellery Simulation Decoration Holiday Party Supplies",
        "path": "20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
        "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
        "price": 350000,
        "location": "Mainland China",
        "rating": 4,
        "sold": 0,
        "description": "100% Brand New And High Quality !\n\nspecification:\n\ncolor: As Picture Show\n\nmaterial: Dried Flower\n\nflower Diameter:About 0.7-0.8cm\n\nsuit For:Floating Aromatherapy Epoxy Handmade Accessories\n\n\nNatural dried flowers vary in size. Please pay attention to natural products. The size, shape and color of each flower are different.\n \nWarm reminder: natural dried flowers are inevitably scattered, each flower has a different shape and color\nCan be used for DIY glass cover, nail art, handmade jewelry.\n \nNoted: Dried flowers can be put in glued, but not soaked in water.\n \nPackaging include:\n \n1 box * 20PCS dried flowers"
    },
    {
        "title": "2mm Thin Basswood Sheet Unfinished Wood Piece for Crafts Building Model DIY Sand Table Materials Decor Board model making scenery diorama wargame scene grass painted architecture",
        "path": "2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
        "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
        "price": 658000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 3,
        "description": "Description:\nWood Board for diy Sand Table Model Building Materials Crafts Decorative\nGreat accessory for model making, sand table scenery, diorama wargame scene\nPerfect for grass or other painted model architecture scenery building\nLightweight materials, easy to carry\nMade of basswood, durable\nSize Chart:\nThickness: 2mm \nSize:approx. \n50x200mm/ 2x7.87inch, Wight: about 12.5g\n100x100mm/ 3.94x3.94inch, Wight: 11.5g\n100x200mm/ 3.94x7.87inch, Wight: 21g \n150x150mm/ 5.9x5.9inch, Wight: 26g\n 200x200mm/ 7.87x7.87inch, Wight: 48g\n200x450mm/ 7.87x17.72inch, Wight: 111g(5 Pieces)\nPackage Includes:\n5/10 Pieces Basswood Sheets\nNote:\nColor might be slightly different due to the color calibration of each individual monitor.\nPlease allow slightly measuring deviation due to manual measurement."
    },
    {
        "title": "2-in-1 Dual Head Marker Pen Set / color pencils for kids / Art and craft materials for children / color pencil",
        "path": "2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
        "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
        "price": 910000,
        "location": "SG",
        "rating": 4.78125,
        "sold": 10,
        "description": "✅ READY TO DISPATCH WITH 24 HRS.\n🔥 30/60 Colors Kid Drawing Sets\n🔥 Made of environmentally friendly and healthy raw materials. They are non-toxic and tasteless and have no harm to the body, They can be used with confidence.\n🔥 A wide range of uses, including: coloring pages, learning rainbow colors, idea development in office use, sketching, drawing, layering, blending, polishing, etc,\n🔥 This set is suitable for primary school students and even college students who like to Draw.\n🔥 Fast Creativity - These coloring sets provide a stylish and natural wood look for your toddler or older kids, making the color more interesting, a great complement to the teen art and craft collection.\n🔥 Satisfactory guarantee: Our products are equipped with gift boxes, which can organize your coloring pencil series. It is the best gift for children on birthday and Christmas."
    },
    {
        "title": "Resin Mixer,Handheld Electric Epoxy Stirrer, Tool for DIY Epoxy Resin Crafts Making tools",
        "path": "Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
        "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
        "price": 521000,
        "location": "Mainland China",
        "rating": 4.833333333333333,
        "sold": 3,
        "description": "Powerful Epoxy Mixer】With high speed rotation of 14000 rpm motor,our small and efficient electric wand can mix epoxy resin fast and well for your epoxy glitter tumblers,no more need to mix the epoxy by hand slowly\n【Easy to use】After put the stirrer into the cup with epoxy,simply press and hold the power button on the end to start mixing,Works efficiently and quiet,time saving.\n【Easy to clean】The stainless steel shaft and spiral head is easy to wipe, rinse, or just wash clean with fresh water (do not immerse ABS handle body in water)\n【Battery Operated】Our hand mixer is powered by two AA batteries (not included),Simple one-touch switch with a powerful motor but low noise level. Cordless mixer handheld, no need to worry about messy wires.\n【Fashion Design】Our resin stirrer is styled in matte black surface and a shiny black stripe,ergonomic handle is very comfortable to grip and hold\n\npackage: 1pcs tools（Batteries not included）"
    },
    {
        "title": "【MEET】10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories Jewelry Toy DIY Resin Handmade Materials",
        "path": "MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
        "price": 90000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 4,
        "description": "❤[Store Manager Description]:\nProduct Name: DIY Resin Jewelry\nMaterial: Environmentally Friendly Resin\nQuantity: 10g\nUses: Jewelry DIY, Mobile Phone Case DIY, Hairpin DIY~~~~~\nNote:\n1. This Product Is Not Edible\n❤[Shop Description]\n1. All The Items That Can Be Ordered In The Store Are In Stock. After You Place An Order, We Will Try Our Best To Prepare And Send It Out As Quickly As Possible;\n2. Normal Shipments On Weekends/National Holidays;\n3. If You Have Any Questions, Feel Free To Click On The Top Right To Chat~\n\nBecause The Product Dimensions Are All Measured Manually, There May Be Slight Errors, Please Bear With Me😊\n\n❤[Evaluation Description]\n1if You Are Satisfied With Our Products After Receiving The Baby, Remember To Give Us A \"Five-Star\" Praise, We Need Your Affirmation❤🧡💛💚💙\n2if You Have Any Other Questions In Use Or Have Other Questions, Please Do Not Let Us Know With Bad Reviews, You Can [Chat] Ask First, We Will See The Message And We Will Solve It For You As Soon As Possible~\n\nIf You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘If You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘"
    },
    {
        "title": "LEOTA Handmade Mosaic Vase, Flower Wooden Mosaic Bottom DIY Art Decoration, Craft Supplies Material Package Mosaic Art Paste Mosaic Tiles Creative Craft Kit Parent Child Toys",
        "path": "LEOTA-Handmade-Mosaic-Vase-Flower-Wooden-Mosaic-Bottom-DIY-Art-Decoration-Craft-Supplies-Material-Package-Mosaic-Art-Paste-Mosaic-Tiles-Creative-Craft-Kit-Parent-Child-Toys-i.455449081.22748936319",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd7-ljgel1dt8m2p3c",
        "price": 2589000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Dear friends, welcome to visit!\n \nName: diy Mosaic Vase\nMaterial: wood\nModel: mine bottom 9 * 9 * 9cm (3.54 * 3.54 * 3.54in), small south bottom 12 * 7.5 * 7.5cm (4.72 * 2.95 * 2.95in), truncate bottom 17 * 8 * 8cm (6.69 * 3.15 * 3.15in)\nStyle: Multiple styles randomly selected\nSuggested age: 7 years old and above(accompanied by parents)\nPackaging: 1set diy Mosaic Vase Material Pack (1PC base embryo+1PC simulation flower+1set material kit)\nFeatures: \nEasy to make, simple and beautiful, the material is round and does not hurt hands\nOperation steps:\n1. Apply glue, and apply the glue even on the bottom blank\n2. Stick the mosaic, pick up the mosaic and paste it one by one according to the desired pattern\n3. After the glue dries, make a paste according to the ratio of water 1 powder\n4. Spread the cake even between the gaps\n5. After10- 20 minutes, use a spring to wet and writing out the excess sealant\n\nNote:\nThis product is not a finished product and requires DIY by oneself\nThe bottom embryo of the vacuum is made of wood flow and cannot be filled with water\nPlease prevent children from eating by mistake\nHandmade Mosaic Vase DIY Art Decoration Mosaic Vase Handmade Vase Creative Craft Kit Handmate Home Decor DIY Supplies DIY Furniture Decor Wooden Mosaic Bottom Mosaic Tiles Flower Mosaic Art Paste Eco friendly Material Package Personalized Gift Idea Gift Toys Home Accessories Decorative Handmate Furnishing Craft Supplies\n \nIf you need assistance, please contact online customer service."
    },
    {
        "title": "♥♥♥ 8pcs Cone- Shaped Foams Trees Crafts Cone Crafts Xmas Tree Materials Christmas Bag Filler Children DIY Supply",
        "path": "8pcs-Cone-Shaped-Foams-Trees-Crafts-Cone-Crafts-Xmas-Tree-Materials-Christmas-Bag-Filler-Children-DIY-Supply-i.82435852.20166016031",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-c543amn3gjkva7",
        "price": 700000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description\n\nPerfect for your kid’s DIY project. Easy to make into whatever you want. Great for children activities in church, preschool, kindergarten, or at home. Great DIY project for all ages! Come and choose one for you and your kids.\n\nFeatures\n\n-Color: White\n-Material: Foams\n-Size: About 25.00X9.50X9.50cm/9.82X3.73X3.73in\n-The perfect accessory DIY material, the cone-shaped foams are perfect for you and your kid’s craft project.\n-It can be a children educational toy to stimulate their imagination and creativity.\n-Great craft project for children in church, nursery, preschool, kindergarten, child care center, home.\n-Practical in use. Can be painted, colored and glued. Great DIY foams cones toys for all ages.\n-Easy to make into whatever you want, very practical to use, you deserve to have one.\n8 x cone-shaped foams"
    },
    {
        "title": "Yuykcei Epoxy Resin Pigment -26 Colour Epoxy Resin Dye - Highly Concentrated Epoxy Resin Colorant for Resin Colour Art, DIY Jewelry Making Supplies - AB Resin Colouring for Paint, Crafts - 10ml Each",
        "path": "Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
        "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
        "price": 2148000,
        "location": "Mainland China",
        "rating": 4.851063829787234,
        "sold": 0,
        "description": "26Colors Epoxy Resin Pigment:Total 26 beautiful translucent colors liquid epoxy pigment,red,fuschia,lemon yellow,brown,sky blue,orange,rose red,pink,yellow,azure,sapphire blue,purplish red,purple,blue,green,beryl green,fluorescence green,golden yellow,grass green,emerald green,peacock blue,cherry red,coffee, violet,white,black with bottled package,each resin colorant 10ml/0.35oz.\nExcellent Choice for Resin Projects: The resin dye mix well into resin, and these epoxy resin color pigments are very concentrated,High concentration of epoxy resin colour pigments, just a drop and you will be shocked by the strong dyeing effect.\nSAFETY & WIDE USE - Our epoxy oily colour dye are all non-toxic, no harsh chemicals, cruelty free.These resin pigments can be widely used on resin jewelry and crafts decorations, jewelry making, paint, garment accessories, or other DIY making.\nEasy To Use: It’s quite easy to squeeze the epoxy resin pigment out of the bottle with specially designed nozzle, transparent and soft bottles you can control the amount easily.Beginner friendly and the experienced/veteran can enjoy it as well.\nNOTE: Liquid resin dye will get best color effect mixed with EPOXY RESIN. Just mix them well and wait it cured, no catalyst needed. lf you have any questions or issues regarding the epoxy resin coloring please do not hesitate to send the seller a message through Amazon and we will respond within 24 hours."
    },
    {
        "title": "30 Pcs Retro Letter Sheet Material Paper Junk Journal Planner Scrapbooking Vintage Decorative Diy Craft Background Paper",
        "path": "30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
        "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
        "price": 210000,
        "location": "Mainland China",
        "rating": 4.833333333333333,
        "sold": 4,
        "description": "Material: Paper\nSize: Approx 110*150mm\nQuantity: 1 pack/30pcs\nCode number: 02688\nApplication for decoration diary, notebook, planner, album, letter, gift box, bottle, cup, scrapbook, cellphone and so on.\nAll items are on hand and ready to ship."
    },
    {
        "title": "20 Pcsbox DIY Real Dried Flowers For Nail Decoration Art Craft Making Jewellery Simulation Decoration Holiday Party Supplies",
        "path": "20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
        "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
        "price": 350000,
        "location": "Mainland China",
        "rating": 4,
        "sold": 0,
        "description": "100% Brand New And High Quality !\n\nspecification:\n\ncolor: As Picture Show\n\nmaterial: Dried Flower\n\nflower Diameter:About 0.7-0.8cm\n\nsuit For:Floating Aromatherapy Epoxy Handmade Accessories\n\n\nNatural dried flowers vary in size. Please pay attention to natural products. The size, shape and color of each flower are different.\n \nWarm reminder: natural dried flowers are inevitably scattered, each flower has a different shape and color\nCan be used for DIY glass cover, nail art, handmade jewelry.\n \nNoted: Dried flowers can be put in glued, but not soaked in water.\n \nPackaging include:\n \n1 box * 20PCS dried flowers"
    },
    {
        "title": "Cream Glue diy Set Gift Box Children's ins Handmade Material Package Creative Toys Kindergarten Wholesale",
        "path": "Cream-Glue-diy-Set-Gift-Box-Childrens-ins-Handmade-Material-Package-Creative-Toys-Kindergarten-Wholesale-i.915290312.21367114067",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e8ge5tudp6jv05",
        "price": 1328000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 3,
        "description": "★Hello!Welcome To The Store!\nRemember To Pay Attention To The Store And Click On Love Goods.There Will Be Discounts To Receive Notifications As Soon As Possible.\n\n★[Shipping Note]\n1.All Items Are In Stock And Will Be Shipped Within 48H After Placing The Order\n2.We Send It From Mainland China, Because It Is An Overseas Seller, You Need To Pass The Customs, Please Ask For Urgent Orders First\n\n★Product Basic Information\nProduct Category: Educational Toys\nSpecification: 22 * 16 * 6cm\nWhether It Can Be DIY: Yes\n\n\n★Precautions/tips\n1.Please Confirm The Specifications Before Placing An Order, If You Want To Change The Content Of The Order After Placing The Order, Please Cancel It Yourself Before Placing The Order Again.\n2.Do Not Remark The Color Style In Chat And Order, Please Confirm The Color Style Before Placing An Order, And Place The Order Correctly.\n3.Please Confirm The Specifications Before Placing An Order, If There Are Additional Needs, Please Notify In The \"Remarks \", After The Order Is Established, It Cannot Be Changed.\n4.The Color Of The Product Is Slightly Different From The Color Rendering Of The Computer Due To The Shooting Lighting Reasons, The Product Picture Can Be Referenced, Please Refer To The Actual Product\n\n★[After-Sales Notice]\nIf There Is Any Problem After Picking Up The Goods: A Small Piece Is Sent Wrong Goods, Defects, Etc., Please Contact Us First, Do Not Communicate In The Evaluation, Please Communicate In The Chat.\n\n★[Customer Service Consultation]\nOnline Quick Consultation, If You Have Any Questions, Please Ask, Make Good Use Of Chat, And Someone Will Serve You Online.\nIf You Find That The Product Is Abnormal When You Receive The Product, Please Take A Photo Of The Product And The Order, And Send It To Chat, And The Customer Service Staff Will Chat About The Large Amount Of Messages On The Working Day, And The Customer Service Will Deal With It In Sequence. If You Are Idle, Please Wait For A While, And Do Not Use Evaluation As A Channel For Communication.\nIf You Like Our Products And Services, Welcome To Give Us Full★★★★★Oh Star!"
    },
    {
        "title": "2mm Thin Basswood Sheet Unfinished Wood Piece for Crafts Building Model DIY Sand Table Materials Decor Board model making scenery diorama wargame scene grass painted architecture",
        "path": "2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
        "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
        "price": 658000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 3,
        "description": "Description:\nWood Board for diy Sand Table Model Building Materials Crafts Decorative\nGreat accessory for model making, sand table scenery, diorama wargame scene\nPerfect for grass or other painted model architecture scenery building\nLightweight materials, easy to carry\nMade of basswood, durable\nSize Chart:\nThickness: 2mm \nSize:approx. \n50x200mm/ 2x7.87inch, Wight: about 12.5g\n100x100mm/ 3.94x3.94inch, Wight: 11.5g\n100x200mm/ 3.94x7.87inch, Wight: 21g \n150x150mm/ 5.9x5.9inch, Wight: 26g\n 200x200mm/ 7.87x7.87inch, Wight: 48g\n200x450mm/ 7.87x17.72inch, Wight: 111g(5 Pieces)\nPackage Includes:\n5/10 Pieces Basswood Sheets\nNote:\nColor might be slightly different due to the color calibration of each individual monitor.\nPlease allow slightly measuring deviation due to manual measurement."
    },
    {
        "title": "2-in-1 Dual Head Marker Pen Set / color pencils for kids / Art and craft materials for children / color pencil",
        "path": "2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
        "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
        "price": 910000,
        "location": "SG",
        "rating": 4.78125,
        "sold": 10,
        "description": "✅ READY TO DISPATCH WITH 24 HRS.\n🔥 30/60 Colors Kid Drawing Sets\n🔥 Made of environmentally friendly and healthy raw materials. They are non-toxic and tasteless and have no harm to the body, They can be used with confidence.\n🔥 A wide range of uses, including: coloring pages, learning rainbow colors, idea development in office use, sketching, drawing, layering, blending, polishing, etc,\n🔥 This set is suitable for primary school students and even college students who like to Draw.\n🔥 Fast Creativity - These coloring sets provide a stylish and natural wood look for your toddler or older kids, making the color more interesting, a great complement to the teen art and craft collection.\n🔥 Satisfactory guarantee: Our products are equipped with gift boxes, which can organize your coloring pencil series. It is the best gift for children on birthday and Christmas."
    },
    {
        "title": "Resin Mixer,Handheld Electric Epoxy Stirrer, Tool for DIY Epoxy Resin Crafts Making tools",
        "path": "Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
        "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
        "price": 521000,
        "location": "Mainland China",
        "rating": 4.833333333333333,
        "sold": 3,
        "description": "Powerful Epoxy Mixer】With high speed rotation of 14000 rpm motor,our small and efficient electric wand can mix epoxy resin fast and well for your epoxy glitter tumblers,no more need to mix the epoxy by hand slowly\n【Easy to use】After put the stirrer into the cup with epoxy,simply press and hold the power button on the end to start mixing,Works efficiently and quiet,time saving.\n【Easy to clean】The stainless steel shaft and spiral head is easy to wipe, rinse, or just wash clean with fresh water (do not immerse ABS handle body in water)\n【Battery Operated】Our hand mixer is powered by two AA batteries (not included),Simple one-touch switch with a powerful motor but low noise level. Cordless mixer handheld, no need to worry about messy wires.\n【Fashion Design】Our resin stirrer is styled in matte black surface and a shiny black stripe,ergonomic handle is very comfortable to grip and hold\n\npackage: 1pcs tools（Batteries not included）"
    },
    {
        "title": "youn Toddler Puzzle Alphabet Learning Cognitive Matching Board Toy Kindergarten",
        "path": "youn-Toddler-Puzzle-Alphabet-Learning-Cognitive-Matching-Board-Toy-Kindergarten-i.135054010.23839685932",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd3-lfqmin7pgnt800",
        "price": 3001000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Toddler Puzzle Alphabet Learning Cognitive Matching Board Toy Kindergarten \nFeatures: Shape Matching  Puzzle:  puzzle with cartoon pattern & shape matching alphabet pieces, well stimulate toddler interests, encourage and improve early learning brain development, exercise child hand & eye coordination.\nSelected Material: Made of qualified solid hard woods, & transparent acrylic, well polished with round edges and no burrs, wear resistant,non toxic water printing, safe friendly to your kids.\nAlphabet Cognitive Matching Board: Transparent alphabet pieces with cartoon colorful patterns to guide toddler find the correct pieces and match quickly, easy to match through shape recognition, the concept of teaching in fun to attract kids concentration, improve their logical thinking and hand-on skills.\nFine Motor Skill Educational Toy: Kids can improve their basic fine motor skill ability through pairing & the process of matching, perfect educational & learning toy for toddler hand grab ability and exercise their hand & eye coordination.\nPerfect  for Toddlers: The Alphabet matching puzzle toy suitable for toddlers as birthday , Christmas , and encourage and improve their hands flexible, also an awesome parent-child funny activity table game playing together.\n\nSpecifications: Product Dimension: approx. 26 x 26cm/10.23 x 10.23 inch\nMaterial: Woods, Acrylic\nNet Weight: approx. 550g/1.21 lbs\n\nPackage Includes: 1 x  Puzzle Alphabet Matching Board Toy\n\nnote: Warning: The toy may contain small pieces and need to pay attention to the swallowed risk.\nPlease allow 1-2cm errors due to manual measurement. \nDue to the difference between different monitors, the picture may not reflect the actual color of the item."
    },
    {
        "title": "B.B-Kids Toys Water Mat Drawing Painting Toddler Board Magic Pen Childrens Gift",
        "path": "BB-Kids-Toys-Water-Mat-Drawing-Painting-Toddler-Board-Magic-Pen-Childrens-Gift-i.51487338.1280564822",
        "image": "https://down-sg.img.susercontent.com/file/f1e5b14546f6d507286cbbc3460f61aa",
        "price": 400000,
        "location": "Mainland China",
        "rating": 4.7690582959641254,
        "sold": 13,
        "description": "Feature:\n100% brand new and high quality.\nQuantity: 1\nDraw, Trace Never Make a Mess\nA Perfect Travel Toy/ Indoor Toy for 1-6 years old.\nJust Fill the Magic Pen With Water and Draw on the Magic Aquadraw Mat\nKids are fascinated as the colorful images Spring Up, the slowly Fade Away\nSo that kids can use the Aquadoodle Mat Again and Agian\nMaterial: Cloth\nSize: 45.5 x 29cm\nColor: As Shown\nPackage Content:\n1X Water Drawing Painting Writing Mat Board\n2X Magic Pen"
    },
    {
        "title": "【MEET】10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories Jewelry Toy DIY Resin Handmade Materials",
        "path": "MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
        "price": 90000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 4,
        "description": "❤[Store Manager Description]:\nProduct Name: DIY Resin Jewelry\nMaterial: Environmentally Friendly Resin\nQuantity: 10g\nUses: Jewelry DIY, Mobile Phone Case DIY, Hairpin DIY~~~~~\nNote:\n1. This Product Is Not Edible\n❤[Shop Description]\n1. All The Items That Can Be Ordered In The Store Are In Stock. After You Place An Order, We Will Try Our Best To Prepare And Send It Out As Quickly As Possible;\n2. Normal Shipments On Weekends/National Holidays;\n3. If You Have Any Questions, Feel Free To Click On The Top Right To Chat~\n\nBecause The Product Dimensions Are All Measured Manually, There May Be Slight Errors, Please Bear With Me😊\n\n❤[Evaluation Description]\n1if You Are Satisfied With Our Products After Receiving The Baby, Remember To Give Us A \"Five-Star\" Praise, We Need Your Affirmation❤🧡💛💚💙\n2if You Have Any Other Questions In Use Or Have Other Questions, Please Do Not Let Us Know With Bad Reviews, You Can [Chat] Ask First, We Will See The Message And We Will Solve It For You As Soon As Possible~\n\nIf You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘If You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘"
    },
    {
        "title": "PLU* Simulated Remote Control Light Function Sound 3 Languages Number Cognition Identify Colors Hand-eye Coordination Baby Toy TV Remote Control for Toddler",
        "path": "PLU-Simulated-Remote-Control-Light-Function-Sound-3-Languages-Number-Cognition-Identify-Colors-Hand-eye-Coordination-Baby-Toy-TV-Remote-Control-for-Toddler-i.134972817.22146244992",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lho97zcfs12d68",
        "price": 644000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nHow practical is the educational TV remote control toy to train the intelligence of the babies with the numbers enlightenment.\nIt goes without saying that our products can be used as an auxiliary tool to exercise children's grasping ability and facilitate their cognitive development, as well as a game prop between children and their parents.\nIt is constructed of ABS material.\nThe length of this product is 16.5cm, the width is 5cm and the height is 2.5cm. \nOur product is suitable for kids. It features with English, French and Spanish, interesting sound effect, lighting function.\n\nItem Name: Remote Control Toy\nMaterial: ABS\nBatteries: 2 x AAA Batteries (Not Included)\nFeatures: Educational Teaching, Music, Simulated\nSize Details:\nL: 16.5cm/6.5\", W: 5cm/1.97\", H: 2.5cm/0.98\" (Approx.)\n\nNotes:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\n\nPackage Includes:\n1 x Remote Control Toy"
    },
    {
        "title": "🌷32 Colors🌷DIY 扭扭棒Colourful Chenille Stems, Pipe Cleaners, Craft Stems, Bendable Wire Toys Handmade DIY Craft Supplies",
        "path": "32-ColorsDIY-Colourful-Chenille-Stems-Pipe-Cleaners-Craft-Stems-Bendable-Wire-Toys-Handmade-DIY-Craft-Supplies-i.778855103.18065355611",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-aup4su6mmekvae",
        "price": 571000,
        "location": "Mainland China",
        "rating": 4.545454545454546,
        "sold": 40,
        "description": "💕Hi fans💕\n🔥Welcome to ttsono online store🔥\n✅Let You Experience The Happy Planet\n✅100% preferred Products\n✅Quality Assurance + Price Concessions\n✅Quality Service + Integrity Management\n⚡ Fast shipping ⚡\n\n🌟Diy Colourful Chenille Stems\n✔Color: 32 Kinds\n✔Material: Polyester Wire+Galvanized Iron Wire\n✔Size: 0.6 * 30cm\n✔Applicable Scenarios: DIY, Creative Gifts, Birthdays, Daily Surprises, Blind Boxes, Decoration, Handmade\n👉Rich And Delicate Fluff, High Density, Not Easy To Shed Hair\n👉Variety Shape, Arbitrary Bending, Random Concave Shape\n👉Unlimited Creativity, Inspiring Imagination, The Only Unique Gift\n\n\n🎁🎁 Packing List🎁🎁：\n✅Diy Colourful Chenille Stems *100pcs"
    },
    {
        "title": "DIY Children's Hand-woven Coin Purse Kid Bag Puzzle Felt Cloth Bag Early Education Handmade knitting Wallets School Supplies",
        "path": "DIY-Childrens-Hand-woven-Coin-Purse-Kid-Bag-Puzzle-Felt-Cloth-Bag-Early-Education-Handmade-knitting-Wallets-School-Supplies-i.561005339.15688249462",
        "image": "https://down-sg.img.susercontent.com/file/a64f68a1fc5a3ebd97a76a08360ad5f6",
        "price": 170000,
        "location": "Mainland China",
        "rating": 4.7272727272727275,
        "sold": 21,
        "description": "Why buy from us?\n✔READY STOCK in our store!\n✔SHIP OUT within 1-2 days!\n✔QC our products before ship out!\n✔HAPPY shopping experience!\n✔I do my best to source all the money-valued, quality products to customers like what I do for my family!\n\nDescription:-\n🎗Condition: 100% Brand New, High Quality💯\n🎗Quantity: The price is for 1 piece.\n🎗Type: Early Learning Education Craft Toys\n\n📦Package: 1 plastic needle / some threads / 1 reference picture / double-side tape included/  some cutting parts /  some decorative parts (not every bag has this one)\n \n📣Note:\n📌Please understand that colours may exist little chromatic aberration as the different resolution of monitors and the light brightness, etc. thank you!\n📌There is double-side tape in the package. You don't need to prepare glue.\n\n\n💕Please ADD our store to your FAVORITE STORE list if you like our store!\n\n\n#Wallets #CoinPurse #PuzzleToy #Kids #DIYBag #HandmakeToy #bag #ShoulderBags #MessengerBag #KidBag"
    },
    {
        "title": "1 Set Painting Supplies Kids Pocket Watercolor Painting Book Pocket Water Color Painting Book for Kids Toddler uiran.sg",
        "path": "1-Set-Painting-Supplies-Kids-Pocket-Watercolor-Painting-Book-Pocket-Water-Color-Painting-Book-for-Kids-Toddler-uiransg-i.778792818.23450607516",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lk5co7dsc4hj13",
        "price": 945000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description\n\nThis exquisite Watercolor Painting Book for children, suitable for children's graffiti and children's drawing learning. The picture book will make your child have more fun. At the same time, the high-grade material makes the book durable, so your children can play with confidence. With a light stroke, exquisite patterns will appear, bringing unlimited fun to your children.\n\nFeatures\n\n-Color:As shown\n-Material:Paper\n-Size:19.00X8.00X1.20cm/7.47X3.14X0.47in\n-Each watercolor book with blank patterns, cartoon and lovely, you kids will like this painting book.\n-The kids watercolor painting book is made of safe and reliable material, thus you can use it at ease.\n-Our DIY Watercolor book is the perfect primer for painting that is very easy to use.\n-Watercolor painting book helps teach color recognition and promotes the use of fine motor skills and hand-eye coordination.\n-Watercolor Painting Book is suitable as novel gifts for children on birthdays, Christmas, Children's Day, holidays and any other occasions.\n1 x Set of Watercolor Painting Book"
    },
    {
        "title": "80G Crushed Glass Stones Resin Filling for DIY Epoxy Resin Silicone Mold Irregular Broken Stone Nail Art Epoxy Crafts Filler",
        "path": "80G-Crushed-Glass-Stones-Resin-Filling-for-DIY-Epoxy-Resin-Silicone-Mold-Irregular-Broken-Stone-Nail-Art-Epoxy-Crafts-Filler-i.187101463.18311988156",
        "image": "https://down-sg.img.susercontent.com/file/c8ebcc81cac81dc787fc9c31af46cd37",
        "price": 502000,
        "location": "Mainland China",
        "rating": 4.708333333333333,
        "sold": 9,
        "description": "Condition: 100% Brand New And High Quality\nColor:As The Picture\nMaterial: Broken Glass Stone\nPackage:80grams crushed stone /box\nFit : Making Materials Handmade DIY Necklace&Bracelet Bangle\n\nShopping Note :As different computers display colors differently, the color of the actual item may vary slightly from the above images, thanks for your understanding"
    },
    {
        "title": "Board For Making Yard MDF Material",
        "path": "Board-For-Making-Yard-MDF-Material-i.872832450.14893396673",
        "image": "https://down-sg.img.susercontent.com/file/470a032c0df9b21821071ae7ab20521e",
        "price": 486000,
        "location": "Vietnam",
        "rating": 0,
        "sold": 0,
        "description": "🎗️Product: MDF board\n\n🎗️ Product properties:\n• • 3mm thick model yard board\n• •Material: Mdf\n• Size: 20cmx20cm - 25cmx25cm - 30cmx30cm - 35cmx35cm - 40cmx40cm - 50cm-50cm\n• •Used To make model yard"
    },
    {
        "title": "Bookmark Homemade by Hand Dried Flower Bookmark DIY Material Package Embossed Plant Specimen Transparent Sticker Relieving Stuffy Handmade/Dry flower handmade DIY bottle self-made plant specimen",
        "path": "Bookmark-Homemade-by-Hand-Dried-Flower-Bookmark-DIY-Material-Package-Embossed-Plant-Specimen-Transparent-Sticker-Relieving-Stuffy-HandmadeDry-flower-handmade-DIY-bottle-self-made-plant-specimen-i.890128855.19578109794",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdx-lfdxrx5f50ajdb",
        "price": 478000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 3,
        "description": "Bookmark homemade by hand dried flower bookmark diy material package embossed plant specimen transparent sticker relieving stuffy handmade"
    },
    {
        "title": "Mohamm Paper Handaccount Cutter Cutting Tool Craft Tools Precision Art Sticker Washi Tape Cutter School Supplies",
        "path": "Mohamm-Paper-Handaccount-Cutter-Cutting-Tool-Craft-Tools-Precision-Art-Sticker-Washi-Tape-Cutter-School-Supplies-i.147398485.7691292730",
        "image": "https://down-sg.img.susercontent.com/file/fb19c0d42935d2096f659ce52db74f6c",
        "price": 90000,
        "location": "Mainland China",
        "rating": 4.894308943089431,
        "sold": 45,
        "description": "Material: PC\nLength: 15.8cm\nSKU: QT295\n\nNotes:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\nPlease be assured of the quality of our products."
    },
    {
        "title": "Paint your own Mandala stones Kit - Complete Starter Kit / Children art / craft activity kit / Creative skills",
        "path": "Paint-your-own-Mandala-stones-Kit-Complete-Starter-Kit-Children-art-craft-activity-kit-Creative-skills-i.54456685.10568183909",
        "image": "https://down-sg.img.susercontent.com/file/c6e563404843cbe83a92a965de82089a",
        "price": 2390000,
        "location": "SG",
        "rating": 0,
        "sold": 1,
        "description": "Create stunning, unique pieces of art to wow and delight friends and family with this on-trend kit. \n\nPaint Your Own Mandala Stones contains 4 large rocks that are perfect for this type of art, 5 acrylic paints, 2 high quality paint brushes, 5 dotting tools of varying thickness, and a 24-page book containing step-by-step instructions and photography on how to create a range of stunning pieces!\n\nWhat's Included:\n24-page book\n4 large rocks\n5 acrylic paints\n2 paint brushes\n5 dotting tools\n\n\n**Paint could look dried up,kindly mix with few drops of water for a minute before using."
    },
    {
        "title": "Sakura Zentangle White Tile-Tool Set A | Home Stationery| Arts Craft Drawing Doodling",
        "path": "Sakura-Zentangle-White-Tile-Tool-Set-A-Home-Stationery-Arts-Craft-Drawing-Doodling-i.190961827.5004938767",
        "image": "https://down-sg.img.susercontent.com/file/966aec3369f9b312a4079f58a64426a0",
        "price": 2214000,
        "location": "Malaysia",
        "rating": 5,
        "sold": 1,
        "description": "- Sakura Zentangle white tool set\n- Create amazing art!\n- Easy to learn, relaxing and fun\n- Pigma micron is water based and Ink dries quickly\n- Ink does not bleed through the thinnest paper\n\n- Caution:\n- Do not use for purpose other than writing or drawing\n- Keep out reach of small children\n- Do not leave in hot places such as heated car\n- Do not use on surfaces other than paper\n\n- Pigma caution:\n- Replace the cap tightly after use to prevent the ink from leaking\n- Avoid dropping or shaking, as it will cause the ink to leak\n- Avoid writing with excessing pressure, as it may cause the tip to retract or break\n\n- Pencil caution:\n- Take care when handling products with a sharp tip\n\n- Package content:\n- 1 x Sakura Pigma Micron 01 (Black)\n- 1 x Sakura Pigma Micron 03 (Black)\n- 1 x Sakura Pigma Micron 05 (Black)\n- 1 x Pencil (Black)\n- 1 x Tortillion\n- 5 x Zentangle Tile (White) 89mmx89mm\n\n- Tiles: Made in Italy\n\nTerms and Conditions\nGeneral\n- Colours may not display correctly on all computers - if in doubt, please ask\nSizes provided are for guidance only\n\nPayment\n- Once a bid has been placed, it is a legally binding contract of purchase\n- Once you receive your goods, please inspect them for any damage during transit, and\n we are aware that you have received your goods. Please note that if there are any \n user ID\n- It is the customers responsibility to ensure that payment is received in the due time as \n listed above\n\n- We accept no responsibility for goods delayed due to the courier or postal services.\n- Buyers will be charged for freight to re-send order when parcels are returned to sender\n due to incorrect address / unclaimed"
    },
    {
        "title": "Matchstick Wooden Sticks Kindergarten Children Art & Craft DIY ~500pcs/pkt",
        "path": "Matchstick-Wooden-Sticks-Kindergarten-Children-Art-Craft-DIY-500pcspkt-i.27846050.3339489534",
        "image": "https://down-sg.img.susercontent.com/file/b7e8465f38324a58fbf8321b4825082e",
        "price": 450000,
        "location": "SG",
        "rating": 5,
        "sold": 3,
        "description": "Product Name: Art & Craft Matchsticks\n\nDescription:\nProduct Material: Wood\nProduct Package: OPP Bag\nAge Range: ≥3 years old\n\nFeatures:\nBrand new and high quality.\nPackage includes:\nApprox. ~500 Matchsticks around 50g\n\nNote:\nWithout original color box,we will use PE or bubble bag to pack it well and protect it well. Don't worry.\nDue to amount is measured by weight,  the quantity maybe slightly different\nDue to Different Monitor, the color may have difference"
    },
    {
        "title": "50pcs Mixed Hollow Gear Laser Cut Wooden Wood Craft Art Decor Embellishment",
        "path": "50pcs-Mixed-Hollow-Gear-Laser-Cut-Wooden-Wood-Craft-Art-Decor-Embellishment-i.140625866.2476086884",
        "image": "https://down-sg.img.susercontent.com/file/6d9fab34db9faee1b6feb41fa5c1f3c5",
        "price": 323000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 1,
        "description": "Description:\nBrand new and high quality\nGear wooden pieces, cut from high quality wood.\nPerfect to be decorated with stains, inks, paint and embellishments\nGreat for home wall hanging decorations, wedding favors decoration, gift tags, card making, embellishments, scrapbooking, plaques and other art craft projects.\nSpecification:\nMaterial: Wood\nSize: Approx. 25 - 50 mm / 0.98- 1.97 inch\nPackage Includes:\n50 Pieces Wood Embellishments\nNote:\nPlease allow a little size error due to manual measurement.\nPlease be reminded that due to lighting effects and monitor&#39;s brightness/contrast settings etc, the item&#39;s color may be slightly different from the pictures. Please understand."
    },
    {
        "title": "[SG Ready Stock] 20x20cm NEW DIY Canvas Oil Painting By Numbers Art & Craft Children Birthday Goodies Christmas Gift",
        "path": "SG-Ready-Stock-20x20cm-NEW-DIY-Canvas-Oil-Painting-By-Numbers-Art-Craft-Children-Birthday-Goodies-Christmas-Gift-i.89705380.6771718002",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfp-lfij0yrrx60rd0",
        "price": 399000,
        "location": "SG",
        "rating": 4.934065934065934,
        "sold": 23,
        "description": "Product Description:\nCanvas size: 20cm x 20cm\nCanvas comes with:1pc Printed Art Canvas;  1pc Guided Picture; 1 Set of Acrylic Paints; 1 Set of 2 Nylon Brushes and 2 Sets Screw and Hook.\n\nNote: \n1. Please allow +/- 1cm measuring deviation due to manual measurement.\n2. Due to differences in monitor and display effect, the actual color of the item may differ from the color shown in pictures."
    },
    {
        "title": "[SG Seller] 150 pcs Art Set for Kids Drawing and Painting Set Craft tool, Color Crayons, Markers, Water Color, Pencil",
        "path": "SG-Seller-150-pcs-Art-Set-for-Kids-Drawing-and-Painting-Set-Craft-tool-Color-Crayons-Markers-Water-Color-Pencil-i.335595182.11257718177",
        "image": "https://down-sg.img.susercontent.com/file/7c3532b67ebafeaa04674b60185c6c94",
        "price": 900000,
        "location": "SG",
        "rating": 5,
        "sold": 3,
        "description": "150pcs Kids Art Set for Drawing and Painting  \nage:  3 years +\nPackage size: 37cm*29cm*4cm\n\nProduct included:\n24 x color crayons, \n36 x color markers, \n24 x color oil pastels, \n24 x color pencils, \n12 x color powder pigments, \n20 x plastic paper clips,\n1 x ruler, 1 x pencil, 1 x rubber, 1 x pencil sharpener, 1 x plastic Scissors,\n1 x pigment brush, 1 x pigment tray, 1 x glue, 1 x white plastic, 1 x stapler"
    },
    {
        "title": "Slime Supplies Fimo Slices Nail Art Craft Supplies",
        "path": "Slime-Supplies-Fimo-Slices-Nail-Art-Craft-Supplies-i.236457540.7760268599",
        "image": "https://down-sg.img.susercontent.com/file/b7bc463e1ae293f115f054a59bf911ce",
        "price": 200000,
        "location": "SG",
        "rating": 5,
        "sold": 12,
        "description": "25g/pack\nGet the mystery mixed packet for feebies><\nMin order is $12 & get extra freebies!"
    },
    {
        "title": "[Local Seller] DIY Art Craft Sets Supplies For Kids Toddlers Modern Kid Crafting Supplies Kits Include Pipe Cleaners /Ey",
        "path": "Local-Seller-DIY-Art-Craft-Sets-Supplies-For-Kids-Toddlers-Modern-Kid-Crafting-Supplies-Kits-Include-Pipe-Cleaners-Ey-i.431209658.15690648719",
        "image": "https://down-sg.img.susercontent.com/file/b294363247360418445183e9b4a706e1",
        "price": 1200000,
        "location": "SG",
        "rating": 0,
        "sold": 5,
        "description": "Welcome to our furniture store!\n1. We will deliver the goods immediately after you place the order. All products are in stock. All products will be delivered from China, furniture is a big event, we will guarantee the integrity of delivery.\n2. Usually you will receive the product within 15-20 days.\n3. We will provide installation instructions, simple installation tools and installation videos to help each customer install correctly\n4. If you have any questions, please contact the customer service in time. We are happy to communicate with you. If the shop has full discount and attention gift, please go to the product purchase page to get itDetailed description:\nName: DIY set\nColor as shown\nMaterial: plush + plastic + paper\nDimensions: Hairball: 10 x 25 mm, 10 x 15 mm, 20 x 10 mm\n          Googly eyes: 10 x 14mm, 10 x 10mm, 10 x8mm\n          Paper jam: A5\n\nHighlight description:\nA variety of DIY craft decoration materials are combined into one, which can meet the different needs of children when they are doing art projects. They are easy to use and safe for children.\nDevelop innovative ability-help promote children's brain development and creativity; enhance imagination, concentration and enhance hands-on ability.\nPlay fun-kids will love them when they create amazing things alone or with friends and family. Let your children spend a happy childhood at home and school!\n\nParts List:\n20 x feather 10 color mix\n50x pipe cleaner\n20 x bristle ball\n30 x standard fur balls (10 x 25 mm, 10 x 15 mm, 20 x 10 mm)\n1 can x sequins-mixed shapes: butterfly, snowflake, leaf, heart, flower total 20 grams\n30 x Googly eyes (10 x 14mm, 10 x 10mm, 10 x 8mm)\n30 mixed color buttons (small)\n50 x colorful wooden popsicle sticks\n1 x safety scissors\n20*paper jam"
    },
    {
        "title": "32pcs/Set Plastic Rod Flat Paint Brushes Acrylic Oil Watercolour Painting Tool Craft",
        "path": "32pcsSet-Plastic-Rod-Flat-Paint-Brushes-Acrylic-Oil-Watercolour-Painting-Tool-Craft-i.96459080.3341585229",
        "image": "https://down-sg.img.susercontent.com/file/e8c3cb8eac5321322d6e195e8abc8d9c",
        "price": 419000,
        "location": "Mainland China",
        "rating": 4.8977272727272725,
        "sold": 11,
        "description": "Specification:\n\nBrand new\n\nHair Width: approx. 7mm / 0.28\"\n\nHair Length: approx. 12mm / 0.47\"\n\nTotal Length: approx. 170mm / 6.69\"\n\nFeature:\n\nSynthetic nylon hair.\n\nConvenient to carry.\n\nEasy to clean.\n\nLong service life.\n\nFor both kids and adults, beginners and professionals.\n\nIdeal for acrylic painting, oil painting, watercolor painting, gouache painting etc.\n\nSuitable for painting class & training, games & parties, art, miniature, scale model, face and body painting.\n\nPackage included:\n\n32pcs x Paint Brushes\n\nNote:Thank you for your attention ,and wish you have a beautiful mood every day."
    },
    {
        "title": "[SG Seller] Kids Paint Sponges, Early Learning Kids Toddlers Point Brushes Stamps foam Art Craft Drawing Tools (30PCS) G",
        "path": "SG-Seller-Kids-Paint-Sponges-Early-Learning-Kids-Toddlers-Point-Brushes-Stamps-foam-Art-Craft-Drawing-Tools-30PCS-G-i.255292169.13492148665",
        "image": "https://down-sg.img.susercontent.com/file/8b8e2bc279b80c3817eb4c569f7a3d21",
        "price": 579000,
        "location": "SG",
        "rating": 4.888888888888889,
        "sold": 2,
        "description": "* This early learning kids paint set have 30pcs different design paint sponges/Roller can fully unleash kids imagination and creativity.\n\n* The color for the sponge are random pick.\n\n* Easy to clean and operate. The painting brushes are easy to clean up.\n\nThe washable paint pad is suitable for age 3+\n\n30Pcs Set - there is no Paint Pad.  Paint Pad sold separately."
    },
    {
        "title": "🎁EVA Foam Art n Craft Educational toy Kids Goodie Bag Children Day Gift Stay home Activity",
        "path": "EVA-Foam-Art-n-Craft-Educational-toy-Kids-Goodie-Bag-Children-Day-Gift-Stay-home-Activity-i.8121841.4726607008",
        "image": "https://down-sg.img.susercontent.com/file/048da80087a7d04057a628eae52c664b",
        "price": 117000,
        "location": "SG",
        "rating": 4.902439024390244,
        "sold": 8,
        "description": "👉Min purchase 5pcs or below 5pcs if total purchase amount more than $5 with other items from my shop (excluding shipping fee) PM us you need lesser than that.\n\n👉Min purchase 5pcs or below 5pcs if total purchase amount more than $5 with other items from my shop (excluding shipping fee) PM us you need lesser than that.\n\nEVA foam art kids goodie bag stay home activity\n\nSize 18.5 x2.6cm"
    },
    {
        "title": "NEW ARVL | Marie's Acrylic Colour Waterproof Paint Arcylic Colors 50ml Cat Arklirik Art Supplies Stationery Craft Studen",
        "path": "NEW-ARVL-Maries-Acrylic-Colour-Waterproof-Paint-Arcylic-Colors-50ml-Cat-Arklirik-Art-Supplies-Stationery-Craft-Studen-i.550052911.21835085639",
        "image": "https://down-sg.img.susercontent.com/file/0403e0be6613a18d6c05502854e4cdd9",
        "price": 529000,
        "location": "Malaysia",
        "rating": 5,
        "sold": 0,
        "description": "🌈 Colourhands x Marie's Acrylic Colours 🎨 Marie's 丙烯颜料 \n\n\n🎨 Product Details:\n- Fine painting material. \n- Available in 32 colours\n- Suitable for all kind painting\n- Rich in colours\n- Apply the paint on paper, fabric, wood, metal and etc.\n\n\nWelcome to Colourhands Studio ♥\n• Focus on providing canvas paintings, painting accessories, joy & fun! :)\n\n\nDIY acrylic painting on canvas with colour paint set given, instruction manual and graphical reference are provided for guidance. :)\n\nThank you for your support!\n★★★★★\n\nWarmest regards,"
    },
    {
        "title": "Slime Supplies, Fimo Slices, Nail Art and Craft, Resin Art",
        "path": "Slime-Supplies-Fimo-Slices-Nail-Art-and-Craft-Resin-Art-i.236457540.5962445965",
        "image": "https://down-sg.img.susercontent.com/file/cdc1397d62ebc0be2c6a5822a0bab45f",
        "price": 1200000,
        "location": "SG",
        "rating": 5,
        "sold": 1,
        "description": "25g for 4 designs (Random)"
    },
    {
        "title": "JULA  12 Colors Acrylic Painting Pigment Paint Brush Set DIY Art Craft Drawing Tool",
        "path": "JULA-12-Colors-Acrylic-Painting-Pigment-Paint-Brush-Set-DIY-Art-Craft-Drawing-Tool-i.129924052.2299263591",
        "image": "https://down-sg.img.susercontent.com/file/26abd496eae076a24efc1c24f8181f30",
        "price": 186000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Specifications:\nIdeal for artwork, art projects, school projects and more.\n12pcs a set with a paintbrush, develop your imagination and express it by drawing.\nAcrylics can be used on both smooth and textured surfaces, giving you more flexibility with your projects. \n\nType: Painting Pigment Set\nMaterial: Acrylic Paint\nQuantity: 12Pcs/Set\nCapacity: 3ml/Pc\nPaintbrush Color: Random Color\nFeatures: Easy to Use, DIY Painting Tool, 12 Colors\n\nNote:\nPlease pay attention that the painting brush is sent randomly.\nDue to the light and screen setting difference, the items color may be slightly different from the pictures.\n\nPackage Includes:\n1 Set of Painting Pigment\n2 x Paintbrush (Random Color)\n\n#Club #Glow #Makeup #Paint #Party #PartySupplies #Pub #Skinfriendly #Uv #Washable。"
    },
    {
        "title": "Diamond Gem Art Craft Kit",
        "path": "Diamond-Gem-Art-Craft-Kit-i.14962.7715802818",
        "image": "https://down-sg.img.susercontent.com/file/a1b56a73e7a74f2f282b2fb999466791",
        "price": 800000,
        "location": "SG",
        "rating": 5,
        "sold": 0,
        "description": "Suitable age: 5+ and above\n• Create a blinging masterpiece \n• Easy & fun\n• Easy number guide \n\nPack includes: Picture board, gems, tool, tray and wax\n\n#Mermaid\n#Unicorn\n#Dinosaur\n#Butterfly"
    },
    {
        "title": "Journamm 80pcs Cute Vintage Paper for Phone Decoration Stationery Supplies Craft Paper Junk Journal Label Scrapbooking Material",
        "path": "Journamm-80pcs-Cute-Vintage-Paper-for-Phone-Decoration-Stationery-Supplies-Craft-Paper-Junk-Journal-Label-Scrapbooking-Material-i.392853638.10605791396",
        "image": "https://down-sg.img.susercontent.com/file/34fa49ae93edc07f390135a564b591d2",
        "price": 200000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Origin: CN(Origin)\nModel Number: 20210506\nAge: <3 YEARS OLD\nShape: rectangle\nMaterial: Paper\nMaterial: Craft paper\nSpecs: 80 pcs\nPackage Size: 46*68mm\nWeight: 22g \n \n \n \n \nNotes:\n1.The real color of the item may be slightly different from the pictures shown on website caused by many factors such as brightness of your monitor and light brightness.\n2.Please allow slight deviation for the measurement data.\n\n🎤🎤🎤Benefits：\n1.Follow the store to receive coupons;\n2.There's other coupons in shop's main page;\n\n🔅🔅🔅Attention store Benefits:\n1.You can get exclusive coupons for fans\n2. You can know the various discount activities of the store at any time\n\n❤❤❤We Concentrates on stationery Supplies, DIY handmade supplies, accept wholesale and offer dropshipping service. We Strive to Offer the Best quality and most sincerely Service .\nyour feedback is very important to our business's development,so please give us 5-stars feedback if you are satisfied with the product received!!!\n\nThank you for coming, i wish you a happy shopping!😘😘😘"
    },
    {
        "title": "20 Pieces Lots Mixed DIY Flatbacks Resin Flat Back Mermaid tail shell starfish Cabochon Buttons Scrapbooking Slime Charm DIY Embellishment Craft",
        "path": "20-Pieces-Lots-Mixed-DIY-Flatbacks-Resin-Flat-Back-Mermaid-tail-shell-starfish-Cabochon-Buttons-Scrapbooking-Slime-Charm-DIY-Embellishment-Craft-i.238364946.7834932100",
        "image": "https://down-sg.img.susercontent.com/file/e95d047c1daa851b1ca4a42392e8fa3c",
        "price": 376000,
        "location": "Mainland China",
        "rating": 4.947368421052632,
        "sold": 3,
        "description": "Description:\nMaterial: Resin\nSize: Approx. Mermaid tail: 4.2 x 3.2cm / 1.65 x 1.26 inch, shell: 1.9 x 2cm / 0.75 x 0.79 inch, star: 4cm / 1.57 inch\nColor: assorted colors, randomly pick from many different styles, all of them are very cute.\nLovely designs sequined  glitter resin flat back, perfect for attaching to many different surfaces\n\nGreat for making all types of jewellery making, decoration, phone case DIY,scrapbooking, card making, hair accessories, any other art & craft projects.\n\nPackage Includes:\n20 Pieces Flatback Cabochons"
    },
    {
        "title": "208pcs/set,Crayola Masterworks Art, color pens/pencil/maker,Coloring and Painting Supplies,Arts and Crafts,Gift for Kids",
        "path": "208pcssetCrayola-Masterworks-Art-color-penspencilmakerColoring-and-Painting-SuppliesArts-and-CraftsGift-for-Kids-i.140736052.5138395529",
        "image": "https://down-sg.img.susercontent.com/file/fd1dfc02a729b3a10ba89e207aaf8f60",
        "price": 3002000,
        "location": "Mainland China",
        "rating": 4.75,
        "sold": 0,
        "description": "Let kids’ creativity flow! Draw and color a big picture with any of the pens.Get arts and crafts projects underway with this must-have art set\n\nDescription:\n1,208 art tools: as the picture showing.\n2,Art case: Encourage kids to keep their coloring supplies organized and protected with this portable craft and coloring set.\n3,Safe and nontoxic: Crayons, Colored Pencils, and Markers for kids, ages 3 & up.\n4,Gift for Kids: Inspire creativity and encourage self-expression with over 200 art supplies for coloring, drawing, and crafting.Whether for girls or boys, these awesome art supplies are a great birthday gift or holiday surprise. \n\nDetail:\n208 art tools: as the picture showing\nCase size:41x31x6cm\nOpen size:41x104x6c,\nCase material:plastic"
    },
    {
        "title": "Transparent Resin Dye Pigment Colouring | Epoxy UV Resin | Art Craft DIY",
        "path": "Transparent-Resin-Dye-Pigment-Colouring-Epoxy-UV-Resin-Art-Craft-DIY-i.251530660.13773957493",
        "image": "https://down-sg.img.susercontent.com/file/1e2b08cc3bf77dc8894923abe9976eed",
        "price": 350000,
        "location": "SG",
        "rating": 4.818181818181818,
        "sold": 3,
        "description": "Transparent Resin Dyes that can be used for many batches of resin! All are translucent except for white. Use white to turn your resin into a solid or pastel colour. These dyes can be mixed to form new colours! \n\nDimension of bottle: \n6cm tall \nEst 10ml of dye per bottle\n\n-----------------------------------------------------------------------\nWe thank you for your support on small and local businesses! \nTo help us keep the business going, with your purchase, you will also agree to the following terms and conditions :\n1. Should you receive a faulty product upon delivery, please inform us immediately. No exchanges will be addressed beyond 14 days of point of sale. \n2. Only the following constitutes as a faulty product upon delivery - Major wear and tear that affects the usability of the product (The product must not have been used). \n3. Replacement of faulty products will be looked at on a case-by-case basis. If found to be faulty due to delivery, seller will replace the item 1 to 1 and cover shipping. Should the item be used, found to be faulty, and if seller agrees to replace the product, buyer will have to cover the shipping of the new product (+$3).\n4. Items purchased will require 1-2 days processing time. Once shipping is arranged, no exchanges will be allowed."
    },
    {
        "title": "Ready stock craft Buttons Assorted Sizes Multicolours Hobby Crafts Fun Creative Cute Adorable Patterns Handicraft",
        "path": "Ready-stock-craft-Buttons-Assorted-Sizes-Multicolours-Hobby-Crafts-Fun-Creative-Cute-Adorable-Patterns-Handicraft-i.121903432.14283124090",
        "image": "https://down-sg.img.susercontent.com/file/5ebd409547e552570c8550f32e9044eb",
        "price": 1000000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Ready stock craft Buttons Assorted Sizes Multi colours Hobby Crafts Fun Creative Cute Adorable Patterns Handicrafts Arts Supplies DIY Projects Tutorials Workshops Handmade Innovative Artwork Sewing Dressmaking Design Classes For Kids Pre schoolers\n\nAssorted buttons with sizes from about 8mm diameter to about 40mm diameter for craft needs, chat with us if you cannot find a combination you want,  or you need to customise for certain craft works, we will work out something for you! \n\nBelow ready stock for your selection: \n\n- regular pack multicolour 8mm-25mm about 400pcs\n- big pack multicolour 18mm-30mm about 100pcs\n- large pack multicolour 30-40mm about 50pcs\n- printed multicolour 15mm about 200pc\n- printed multicolour 30mm about 50pc\n- star shape multicolour 10-19mm about 200pc\n- flower shape multicolour 10-20mm about 200pc\n- silver multidesign about 200pc\n- go;d multi design about 200pc\n\nWe also customise button craft for bonding workshop, children party or friendship keepsake 😘, please chat with us your requirement and we can work something out for you!"
    }
]