[
    {
        "title": "b valgus correction XO type leg straight leg beauty artifact足弓训练器腿型矫正腿部锻炼拇指外翻矫正XO型腿直腿美腿神器 jiumei025.sg7.10",
        "path": "b-valgus-correction-XO-type-leg-straight-leg-beauty-artifactXO-jiumei025sg710-i.446003910.20922188466",
        "image": "https://down-sg.img.susercontent.com/file/6a703d034f343216f81185b2e2cf7283",
        "price": 806000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "00\n\n👉欢迎来到我的在线商店\n❤所有产品都是现货！\n❤定期会进行折扣活动，价格最低，质量保证！\n❤可以多多关注商城，产品会及时更新满足您的喜爱！\n --------------\n❤❤注意：\n所有商品从中国发货，因此请理解发货时间需要10-15天。\n祝您开心购物！生活变得更愉快！"
    },
    {
        "title": "Portable Facial Micro-current Beauty Instrument For Lifting Thinning And Reducing Edema With Double Roller Massager",
        "path": "Portable-Facial-Micro-current-Beauty-Instrument-For-Lifting-Thinning-And-Reducing-Edema-With-Double-Roller-Massager-i.397126328.16280264757",
        "image": "https://down-sg.img.susercontent.com/file/72c422786fd1dddd0e1586b489857821",
        "price": 886000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Features:\n-Relieve muscle tension: Press acupuncture points on the face to relieve muscle tension.\n-Multi-acupoint stimulation: Multi-acupoint stimulation stimulates facial reflex points by stimulating facial acupoints to clear facial meridians.\n-Scraper micro-chain: The specially designed scraper micro-chain can fit the skin well and help you massage your face or body to achieve the effect of firming and lifting.\n-USB charging: Lightweight and portable packaging can be put in wallets, handbags and cosmetic bags, so it can be used anytime, anywhere.\n-Reduce swelling around the eyes: You will reduce the appearance of swelling and wrinkles around the eyes, improve the microcirculation of the facial blood vessels, and increase the flow of blood, lymph and body fluids. Make you look presentable, energetic and healthy.\n\n\n\n\nDescription:\nThis product is a massager with USB charging and lightweight and portable packaging that can be put in a wallet.\n\n\nSpecifications:\nMaterial: plastic+silicone\nCurrent intensity: Grade 3\nBattery capacity: 150mA\nCharging mode: USB cable\nPower on mode: press and hold for 1 second\nProduct size: 5.5 * 5 * 2cm\nColor:white\n\n\nPackage Included:\n1 * Massager\n\n\nNotes:\n-Please allow 0-1 inch error due to manual measurement. Thanks for your understanding.\n-Monitors are not calibrated same, item color displayed in photos may be showing slightly different from real object."
    },
    {
        "title": "Upgrade 2.0 Macaron Color Continuous Mist Sprayer 300ml/200ml High-Pressure Spray Bottle for Alcohol, Personal Care & Gardenin",
        "path": "Upgrade-20-Macaron-Color-Continuous-Mist-Sprayer-300ml200ml-High-Pressure-Spray-Bottle-for-Alcohol-Personal-Care-Gardenin-i.368789487.11494680720",
        "image": "https://down-sg.img.susercontent.com/file/9bf4f91de1ae47c2be69e1bf884c3547",
        "price": 85000,
        "location": "Mainland China",
        "rating": 4.766666666666667,
        "sold": 2,
        "description": "【New Arrival】\n①Spray time up to 5s (compared to the old model, the spray time is longer)\n② LEAK-PROOF (optimized product structure, more reliable and durable products)\n③HEAT-PROOF (material optimization, wider application range)\n***If you have any questions after receiving the product, please contact customer service in time.\n\nPacking includes:\n1PC * 200/300ml CONTINUOUS SPRAYER BOTTLE\n\nStickers are not included, buy 2 or more contact the store to get a free one\n\nProduct Specification\nMaterial: PET (Polyethylene terephthalate)\nSize: 200/300ml\n\nColor: white; Blue; Green; Purple; Gold; Yellow; Pink\n\n\n-Screw-neck Bottles Design: LEAK-PROOF, convenient for filling Can match other bottle same screw\n-NEW Continuous spray time: Spray time is up to 5 seconds\n-Heat-Proof: Can hold 60 degrees Celsius water\n-Ultra fine mist spray pattern distributes water evenly-it provides the right amount of water to mildly saturate the hair without getting gunked like the old kinds, refreshing curls or taming a bed-head in the mornings.\n-Continuous Spray-Produces a stream of sustained mist that lasts a few seconds, allowing large areas to be covered quickly and easily. Besides, the ergonomic design reduces hand fatigue compared to traditional trigger and finger tip sprayers.\n-360 Degree Spraying Option-you can even spray with the bottle upside down without leakage or loss of prime, thus all areas can be reached.\n-99% Bottle Evacuation-keeps spraying until the water is gone-fixed volume provides 1.25CC per spray consistently from the first to last drop.\n\n\nNOTE:\n1. In order to ensure the normal work of the product, we will carry out sampling tests on it. There may be some water in some bottles, please do not mind. If you have any questions, please feel free to contact.\n2. 1. If unfortunately the bottle does get clogged, please be advised to try fill it with diluted vinegar and spray the vinegar all out to see if the clogging inside the nozzle would get dissolved.\n3. The solution to the problem of continuous spraying without water is as follows(Because the The product has just left the factory, the spray valve port is too tight):\na). Fill the bottle with water and screw it onto the nozzle, squeeze the bottle (Bottle Body) a few times, and then use it.\nb). It is better to put the product in a place with a higher temperature for a while"
    },
    {
        "title": "Boys Girls Adjustable Posture Corrector Back Support Children Shoulder Belt Rectify Straighten Correction Pain Relief Beauty Kid",
        "path": "Boys-Girls-Adjustable-Posture-Corrector-Back-Support-Children-Shoulder-Belt-Rectify-Straighten-Correction-Pain-Relief-Beauty-Kid-i.314275897.6194955132",
        "image": "https://down-sg.img.susercontent.com/file/2719cf5ebd82b23117114fe803f8010f",
        "price": 728000,
        "location": "Mainland China",
        "rating": 4.5227272727272725,
        "sold": 7,
        "description": "Boys Girls Adjustable Posture Corrector Back Support Children Shoulder Belt Rectify Straighten Correction Pain Relief Beauty Kid\n\nFunctions: Muscle pain relief The coronal and lumber section of the frontal plane maintains the gravity balance of the body, reduces the burden on the muscles, corrects and relieves pain, and bad postures would cause sore necks and shoulders, and even headaches The role of protection Wearing is comfortable and breathable,, it can play a good role in Children correcting the back.Applicable to those workers with pain in back and shoulder due to the long time standing, sitting or keeping of the same posture Easy to adjust and wear Universal size, easy to wear, without any help, you can take off and wear a pose corrector by yourself Size: S/L Size S: suit for weight 20-40KG Size L: suit for weight 40-80KG Package Included: 1*POSTURE CORRECTOR"
    },
    {
        "title": "Neck beauty equipment home lift firming facial mas美颈美容仪器家用脸部按摩器提拉紧致去颈纹抬头纹法令纹消除神器9.5",
        "path": "Neck-beauty-equipment-home-lift-firming-facial-mas95-i.594907807.21542400472",
        "image": "https://down-sg.img.susercontent.com/file/81158ae04a9c8a0dfb644d45db59335e",
        "price": 1445000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Brand: the bond < br / > function: import warm vibration massage品牌：邦洋<br/>功能：导入 温热 震动按摩"
    },
    {
        "title": "Magnetic Therapy Meridian Brush Body Brush Beauty Salon Massager Shoulder Neck Open Back Scraping Legs Five Elements Triangle Brush Magic Scor",
        "path": "Magnetic-Therapy-Meridian-Brush-Body-Brush-Beauty-Salon-Massager-Shoulder-Neck-Open-Back-Scraping-Legs-Five-Elements-Triangle-Brush-Magic-Scor-i.858014453.21845162678",
        "image": "https://down-sg.img.susercontent.com/file/4cdd4c1fb537395c8bf153515aacdfc8",
        "price": 1026000,
        "location": "Mainland China",
        "rating": 3,
        "sold": 0,
        "description": "Magnetic Therapy Meridian Brush Body Brush Beauty Salon Massager Shoulder And Neck Open Back Scraping Legs Five Elements Triangle Brush Magic Scorpion Brush Live Tendon (The Same Different Quality Original Chenshi Genuine)\nBrand: Chenshi"
    },
    {
        "title": "AMBER 28pcs/set Beauty Teeth Veneers Lower Anterior Tooth Tool Simulation Teeth Synthetic Resin New Health Oral Care Temporary Crown Resin Acrylic",
        "path": "AMBER-28pcsset-Beauty-Teeth-Veneers-Lower-Anterior-Tooth-Tool-Simulation-Teeth-Synthetic-Resin-New-Health-Oral-Care-Temporary-Crown-Resin-Acrylic-i.460946790.14425811471",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcw-ljjohbtd4nyubb",
        "price": 225000,
        "location": "Mainland China",
        "rating": 4.626168224299065,
        "sold": 13,
        "description": "<div><p>Quantity: 28Pcs/set\nType:A2\nEvery box of teeth respectively upper and lower layer\nMaterial: Resin\n100% Brand New and High Quality\nAcrylic resin teeth, tooth loss and oral use, and denture.\nPackage List :28 Pcs/Set</p></div>"
    },
    {
        "title": "【ready stock】Folding Massage Bed - Home Chinese Medicine Physiotherapy Bed - Fire Therapy Moxibustion - Beauty Bed",
        "path": "ready-stockFolding-Massage-Bed-Home-Chinese-Medicine-Physiotherapy-Bed-Fire-Therapy-Moxibustion-Beauty-Bed-i.297817635.7363165365",
        "image": "https://down-sg.img.susercontent.com/file/30c47053885f865231c5097d9677e8ac",
        "price": 3599000,
        "location": "Mainland China",
        "rating": 4.6,
        "sold": 3,
        "description": "Stabilizer/metal lock non-slip footpad  \nEasy to store/fast folding in 30 seconds  \nLight/high strength aluminum alloy skeleton  \n \n• Back function, will be more comfortable  \n• High-end quality, exquisite taste of life  \n• Fashionable and comfortable, with bright details  \n- 500 - kg bearing  \n-- Adjustable height  \n-- Good quality rubber floor MATS  \n\nOur Advantages\n1. Registered brand Kanglu, with 16 years of industry experience, has exported to more than 60 countries\n2, high-quality materials imported from Germany beech, sponge, imported PU leather, CE certification, weight detection, complete certificates\n3, buy to send distribution of nylon backpack\n4, the same day delivery before four o 'clock on the same day, we can be delivered on the same day, stock is sufficient\n----------------------------------------------------------------------------------------------------------\n\nColor: black, white\nSize: 186 * 60cm\nInternal filler: sponge\n----------------------------------------------------------------------------------------------------------\n\n - - - - - - Welcome to niniFeng.sg Home Life Flagship store - - - - - - \n📢 products in stock, we will deliver within 12 hours after payment.\n🌟 store coupons, before placing order, you can use the coupons.\n🌟 if you have any questions, please chat with us\n🚢 This product must be shipped by international sea.Logistics is valid for 9-30 days \n💖 The origin of this product is mainland China\nAlthough the sales volume of new products is not much, but please rest assured that the quality and service will make you satisfied"
    },
    {
        "title": "TONYMOLY Personal Hair Cure Argan Lotion 300ml",
        "path": "TONYMOLY-Personal-Hair-Cure-Argan-Lotion-300ml-i.237625616.10396522942",
        "image": "https://down-sg.img.susercontent.com/file/fa996275f8a5ce3096d4c1bf43324242",
        "price": 2452000,
        "location": "Korea",
        "rating": 0,
        "sold": 0,
        "description": "TONYMOLY Personal Hair Cure Argan Lotion 300ml\n\nA no-wash type treatment lotion that fills in moisture with a fresh finish with quick absorption to make your hair moist.\n\nHow to use\nAfter shampooing, remove moisture and apply an appropriate amount to your hands as if massaging the damaged or loose areas.\n\ningredient\nPurified water, glycerin, mineral oil, dimethicone, isopropyl myristate, cyclopentasiloxane, stearyl alcohol, PEG-60 hydrogenated castor oil, ceteth-1, argan kernel oil (1,000ppm), ceteth -20, PEG-14M, PEG-100 stearate, dimethiconol, hydroxyethylcellulose, carbomer, glyoxal, potassium hydroxide, sodium nitrate, alanine, arginine, aspartic acid, Butylene glycol, cysteine, glutamic acid, glycine, histidine, isoleucine, leucine, lysine, methionine, phenylalanine, proline, serine, threonine, tyrosine, valine, Spanish licorice root extract, hydrolyzed collagen extract, hydride Rolled keratin, tea tree extract, PVP, glyceryl stearate, disodium EDTA, ethylhexyl glycerin, 1,2-hexanediol, phenoxyethanol, fragrance\n\nproduct information\nNet weight: 300ml\nBrand: TONYMOLY\nMade in Korea"
    },
    {
        "title": "spemall Beauty  Personal Care  Mini Hair Volume Powder Hair Volume Shaping Powder Portable for Men",
        "path": "spemall-Beauty-Personal-Care-Mini-Hair-Volume-Powder-Hair-Volume-Shaping-Powder-Portable-for-Men-i.129725227.3287444120",
        "image": "https://down-sg.img.susercontent.com/file/478458ddbaa56d0b79f76692b9c099e5",
        "price": 311000,
        "location": "Mainland China",
        "rating": 4.857142857142857,
        "sold": 70,
        "description": "Specifications: \nIt is design with mini size and portable shape, which you can take it to anywhere and use it in anytime.\nThe most important thing is that you can take it to any occasions and use anytime due to its mini size.\nYou can conveniently use it in anytime and anywhere according to its mini size and portable shape.\nWith the design of mini size and portable shape, you can use it easily for anywhere and in anytime.\nFeaturing the mini size and portable shape design, it can be taken to anywhere and anytime to use it.\n\nFeatures: \nThis powder has the function of removing the oil of head and to styling the fashion beautiful hair shape.\nIt is important that this powder can remove oil of head and dispel head flavor to shape a fashion charming hair.\nWhat this powder can offer you is that it can provide you with a clean head flavor and remove the oil for styling a fashion hair.\nYou can use the powder to remove the oil of head and dispel flavor to shape a fashion and charming\nIt can be used to remove the oil of head and to dispel the smell of hair for shaping a charming fashion style.\n\nNotes: \nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.Please allow slight dimension difference due to different manual measurement.\n\nPackage Includes: \n1 x Hair Volume Powder"
    },
    {
        "title": "[HOT!] Electric Breast Massager Simulation Human Massage Adjustable ,Rechargeable Shutdown Timer Beauty Massager Booster Vibration for Women Health",
        "path": "HOT-Electric-Breast-Massager-Simulation-Human-Massage-Adjustable-Rechargeable-Shutdown-Timer-Beauty-Massager-Booster-Vibration-for-Women-Health-i.405874092.10486972179",
        "image": "https://down-sg.img.susercontent.com/file/97106aa6f4906048e53d83d565f8e3ba",
        "price": 1430000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nElectric Breast Beauty Massager: 3D Stereo Shaping, help to create the curve of your breast. You can use it when sleeping, working, learning, etc.\nBoobs Enlargement Massager: Simulation human massage, High frequency bionic pulse, promote chest development.\nChest Chest Magnetotherapy: Accurate acupoint identification massage, built-in magnet, magnetic massage to achieve auxiliary healthy care, keep the chest disease away from you.\nWashable and Removable: The massage tablets are washable,reusable and easy to clean, shutdown timer function for easily use.\nDurable Material: Made of durable ABS and environmental friendly rubber paint.\nSpecification:\nMaterial: ABS Plastic + Rubber\nSize: Approx. 97.5x64x25mm/3.84x2.52x0.98inch\nPower: DC3V /200mA\nWorking Mode: Vibration Massage\nWire Length: 90mm/3.54inch\nRated Voltage :220V/50HZ\nRated Power: 32W (suitable for chest)\nRated Current :0.15A\nAmbient Temperature: ±5°C~+40°C\nNormal use of the Surface Temperature: 55°C±5°C\nPackage Includes:\n1 Piece Breast Massager\n1 Piece Charging Cable\nNote:\n1. Please allow slightly error due to manual measurement.\n2. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n3. Wish you a wonderful on-line shopping!"
    },
    {
        "title": "%%Beauty accessories%% Sandal Massage Comb Head Meridian Scalp Shoulder Neck Anti-static Wide Tooth .",
        "path": "Beauty-accessories-Sandal-Massage-Comb-Head-Meridian-Scalp-Shoulder-Neck-Anti-static-Wide-Tooth-i.169900643.19848279899",
        "image": "https://down-sg.img.susercontent.com/file/08e68973e89eedb13450562a74a1d094",
        "price": 242000,
        "location": "Mainland China",
        "rating": 4.8053333333333335,
        "sold": 331,
        "description": "Features:\n100% brand new high quality\nIt is made of precious  materials and polished by hand.\nSuitable for head massage, breast massage.\nVery suitable for long hair, thick hair, curly hair, curly hair, natural hair, fragile hair, and even beards.\nRelieve stress and increase blood circulation.\n\nSpecification:\nMaterial: Sandal\nColor: Brown\nSize:As shown in the figure\n\n \nPackage includes:\n1Pc Massage comb\n\n\nNote:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2.Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "Microcurrent Lonic Electric Gua Sha Scraping Massager Facial Face Lift Beauty instrument Iontophoresis",
        "path": "Microcurrent-Lonic-Electric-Gua-Sha-Scraping-Massager-Facial-Face-Lift-Beauty-instrument-Iontophoresis-i.243246242.4349354775",
        "image": "https://down-sg.img.susercontent.com/file/baf44184326d5dcb003e05d8a91e13c2",
        "price": 1363000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 1,
        "description": "Features:\n\nMicro influenza should be designed (touch board on the scraping board by touching the human body, \nconverting the micro current of the human body to the machine, \nand then converting it to the human body through the micro current).\nMicro current with special design scraping board can be very good fit the skin,\n help you massage the face or body to achieve the effect of lifting tight.\n\nAs long as people used to say very well regardless of the size of skin can not fully take care of the face, pulling the skin, \nsmooth machine radian design is very good, \nwith the massage cream essence is the use of a goods relaxation process.\nPromote collagen regeneration, promote lymph node DU and other effects.\n\n\n\nDescriptions:\nIt shakes the fever, dredge facial blood vessels, facial blood supply, \nyou can go to the face of dark yellow, also play the role of BAI rosy skin.\n\nSpecifications:\nMaterial: metal and plastic\nColor: white, pink, champagne color\nSize: 15x7x3cm\n\nUSB Rechargeable\n\nPackage Include:\n1 x Electric Scraping Massager \n1 x Cable\n\nNotes: \nDue to the difference between different monitors, \nthe picture may not reflect the actual color of the item. \nWe guarantee the style is the same as shown in the pictures."
    },
    {
        "title": "[nis-beauty] Medical Neurological Percussion Knee Percussor Reflex Massage Tendon Hammer Tool",
        "path": "nis-beauty-Medical-Neurological-Percussion-Knee-Percussor-Reflex-Massage-Tendon-Hammer-Tool-i.289926682.3245293879",
        "image": "https://down-sg.img.susercontent.com/file/e1eeb5e3443326745a2910d61eaf430c",
        "price": 551000,
        "location": "Mainland China",
        "rating": 4.809523809523809,
        "sold": 5,
        "description": "Welcome to Nispecial Beauty Shop!\nFeature:\nSoft handle material gives good force experience\nApproximately 20cm long enough to hold\nSilicone material ring cover gives good touching\nRemovable between head and handle\nWith sharp tapered end for testing of plantar reflexes.\n\nDescription:\nThe reflex hammer is a medical instrument used by practitioners to test deep tendon reflexes. Testing for reflexes is an important part of the neurological physical examination in order to detect abnormalities in the central or peripheral nervous system. Reflex hammers can also be used for chest percussion. This Queen Square hammer is made with plastic molds handle, and has a sharp tapered end to allow for testing of plantar reflexes.\nSize:Approx.20cm/7.87in\nColor:Random\n\nPackage Contents:\n1* Percussion hammer\nNote:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2.Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "Hair Straightening Comb Negative Ion Ceramic Heating Hair Straightener Personal Care Mens Beard Tou'f Styling Comb 22MF28",
        "path": "Hair-Straightening-Comb-Negative-Ion-Ceramic-Heating-Hair-Straightener-Personal-Care-Mens-Beard-Touf-Styling-Comb-22MF28-i.778589216.19506568455",
        "image": "https://down-sg.img.susercontent.com/file/d376b2604a142670ccfef228c5e18e59",
        "price": 1737000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Diameter of heat conductor: 15mm or less\nProduct Category: Hair Straightener\nPower supply method: USB charging\nThermal conductor material: tourmaline ceramic\nTemperature control adjustment: 10 segments\nFunction: Comb straight hair, curly hair\nCertificate Type: ce\nApplicable hair: wet and dry\nBest styling time: 1-2 minutes\nColour: Black\nShell process: oil injection\nFixed power cord\ncolor: black gold\nPackaging: 26.2*5.2*8.2CM\nProduct: 0.37KG/PCS\nBare metal: 0.28KG/PCS\nGeneral voltage: 110-240V,\nFrequency: 50 / 60Hz~\nPower: 35W\nPTC heater\nPower cord length: about 2 meters, 360 degree rotation.\n1. Turn on the machine in the heating state, and turn off the machine automatically 30 minutes later.\n2. Heating time: it takes 3 minutes to reach the maximum temperature of 220c.\n3. Press the on / off button for 2 seconds to close this item. All LED lights are off.\n4. Press the on / off button for 1 second to \"start up\". Red light and blue light are on. By default, the low-level blue light (150C / 302F) will flash after 3S, and the machine will start to heat up. When the temperature reaches 150C / 302F, the lamp stops flashing and the two lamps are on. Press the on / off button once more, set the higher temperature 180C / 356f, and the three lights will be on when it flashes to the required temperature. Press the on / off button again, set 220c / 428f, and four lights will be on.\n\nservice\n1)We offer 7/24 full time service, please feel free to contact us if you have any problem about the product, your inquiry will be replied within 6 hours. \n2)Item will be shipped within 2 working days after receiving a verifying payment.please contact us within 30 days from dispatched if you do not receive our item(s). Otherwise ,we would Consider that the item(s) has been received.\n\nShipping\n1.Most of the orders will send in 48 hours after payment confirmed.\n2.It is usually take 5-15 days to ship to the destination\n3.Items are only shipped after payment received\n4.Please check out your address carefully when processing order.\n\nFeedback\n1)We will leave positive feedback upon payment received,it would be greatly appreciated if you could also leave us with a positive feedback and 5 stars for detailed seller ratings\n2)Please DO NOT leave us neutral or negative feedback without letting us know the reason,if you are not satisfied, please contact us and we will provide the best solutions to you\n3)Please feel free to ask questions if there are any questions in relations to our listings."
    },
    {
        "title": "🔥SG LOCAL STOCK🔥 Natural Rose Quartz Jade🔥Roller Facial Body Massager🔥Gua sha🔥Face Lifting Beauty Massage🔥",
        "path": "SG-LOCAL-STOCK-Natural-Rose-Quartz-JadeRoller-Facial-Body-MassagerGua-shaFace-Lifting-Beauty-Massage-i.434162407.13812524494",
        "image": "https://down-sg.img.susercontent.com/file/242245147bd54288169eb4bc340d075e",
        "price": 685000,
        "location": "SG",
        "rating": 4.845059592464437,
        "sold": 662,
        "description": "Special Tips:\nEach one is not the same in color, jade pattern, thickness, it is normal. \n\nAbout the product\n1. Enjoy a Natural and Healthy Massage - resin roller is made from 100% natural jade stone. Anti-aging, anti-wrinkle line, reduce darkness under eyes, better skin, and health without chemicals or irritants.\n2. Double-Sided Rose Quartz Roller - The large roller is ideal for the neck, chin, cheeks, and forehead while the smaller one is perfect for around the eyes, nose, and lips. The roller promotes blood circulation, which can reduce puffiness and creases.\n3. Rose Quartz Stone Gua Sha - There is a rose quartz healing stone in the package too. It is a very good jade gua sha scraping tool, great for using on your body, and very useful for relieving pressure, always with a relaxing and graceful mood.\n\nRose Quartz Roller function\n1. Relieves facial tension.\n2. Improves skin elasticity by tightening and toning the skin.\n3. Reduces puffiness, eye bags, and dark circles around the eyes.\n4. Helps penetrate beauty products like face creams and serums deeper into the skin for better absorption.\n5. Promotes blood circulation to the face for a natural healthy glow.\n\nHow to use\n1. Wash the face with normal cleansers.\n2. Apply all-night creams to your face and neck.\n3. Use upward motions to move the Jade Roller gently over your forehead, cheeks, around the lip and neck area. Close your eyes and gently roll over your eyelids if you have puffy eyes or bags under your eyes.\n4. Use the roller on your face and neck for 5-10 minutes.\n5. Use the Jade Roller three times a week to reduce fine lines and wrinkles."
    },
    {
        "title": "【GOGO】 Efficient Beauty Scar Removal Silicone Gel Self-Adhesive Silicone Gel Tape Patch .",
        "path": "GOGO-Efficient-Beauty-Scar-Removal-Silicone-Gel-Self-Adhesive-Silicone-Gel-Tape-Patch-i.84683145.17728717807",
        "image": "https://down-sg.img.susercontent.com/file/097494b885ea36c7d0a0525c93cf81da",
        "price": 324000,
        "location": "Mainland China",
        "rating": 4.8,
        "sold": 9,
        "description": "Features:\n1. Reduces the appearance of existing scars, Helps prevent the formation of new scars\n2. Silicone scar gel strips is made from the finest safe silicone - Reusable, washable.\n3. Easy to use, comfortable and can be cut to fit any scar\n4. Combines the of silicone gel sheets with the advantages of self-adhesiveness and durability.\n5. Suitable for all kind of scars, effectively cover and reduce scars.\n\n\nSpecification:\nColor: as picture show\nSize:As the picture show\nProperties: self-adhesive silicone gel tape\nIngredients: polyurethane, TPU, silicone gel\nInstructions:\n1. Clean the scar with water and remove the outer packaging of the silicone gel dressing\n2. According to the size of the scar, cut the appropriate size with scissors\n3. Tear off the separation paper and stick the scar on the scar\nPrecautions:\n1. Make sure your skin is clean and dry before each application, so that it can produce maximum adhesion\n2. The scar sticker can be replaced every 14 days, or when its stickiness is lost.\n3. In order to adapt to the skin, the time of pasting can be increased from 8 hours a day to 20 hours a day\n\nPackage Includes:\n1 x Scar Removal Silicone Gel Tape\n\nNotice:\n1. Actual color may be slightly different from the image due to different monitor and light effect. Please allow 1-3cm deviation due to manual measurement."
    },
    {
        "title": "nis-beauty Multicolor Soft Menstrual Cup Silicone Feminine Hygiene Period Cup Reusable Cup",
        "path": "nis-beauty-Multicolor-Soft-Menstrual-Cup-Silicone-Feminine-Hygiene-Period-Cup-Reusable-Cup-i.289926682.3552570086",
        "image": "https://down-sg.img.susercontent.com/file/1c9130e3c76d3e71cc550304d438577c",
        "price": 202000,
        "location": "Mainland China",
        "rating": 4.826086956521739,
        "sold": 2,
        "description": "Welcome to Nispecial Beauty Shop!\nUsage and Tips\nThe handle can be trimmed to fit each women's vagina.\nSterilize the menstrual cup in boiled water 2-3 minutes. (The cup will not be distorted)\nOnce your menstrual cup is in place, give it a gentle spin to help set it in place.\nThe menstrual cup creates a vacuum seal inside you, preventing leaks.\nYou can wear a menstrual cup up to 12 hours!\nBreak the seal before removing your menstrual cup.\n\nOperation details:\nBefore handling the Menstrual Cup, make sure that your hands are thoroughly clean.\nSterilize the Cup before the first insertion.\nRecommend to insert the cup any of following positions: sitting, squatting, kneeling or standing-try one of these positions and choose what is most suitable for you.\nTo facilitate the insertion, you can moisten the Cup with water or water\nBased lubrication gel.\nGrip the Cup with your fingers and press.\nAfterward fold the Cup lengthwise in half using fingers of the other hand.\nHold the Cup using fingers of one hand at the lowest position possible and insert the\nCup in the vagina obliquely, toward the back.\nThe proper position of the Cup is lower than in case of tampons. Upon insertion in\nThe vagina, release the fingers and let the Cup unfold fully and adhere to the wall.\nPls notice that the Mentrual cup is for private using, Return is not allowed.\n\nSpecification:\nMaterial: medical silicone\nColor: As the picture\nSize:S,L.As the picture\n\nPackage Includes:\n1 * Menstrual cup\n\nNote:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2.Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "[KLOWARE] Detachable Chest Pillow Breast Pillow for SPA Beauty Salon Home",
        "path": "KLOWARE-Detachable-Chest-Pillow-Breast-Pillow-for-SPA-Beauty-Salon-Home-i.140625136.10547244546",
        "image": "https://down-sg.img.susercontent.com/file/391cc8ddd0140a842cd05a49c8cf3408",
        "price": 1067000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Description:\nMade of premium velvet and cotton materials, lightweight and comfortable for daily use. \nDetachable design make it more convenient for cleaning, washable and reusable.\nFunction: Provides breast support and comfortable nights' sleep for side, back or stomach sleepers. Reduces discomfort caused by tender breasts.\nEncourages better posture during breastfeeding, alleviating strain in your back, neck, and arms.\nOccasion: Perfect for beauty salon, home and travel use.\nSpecification:\nMaterial: Crystal velvet pearl cotton\nSize: approx. 43x28cm/ 16.9x11 inch\nWeight: 220g\nPackage Includes:\n1 Piece Beauty Salon Chest Pillow\nNote:\n1. Please allow 1-3mm measuring deviation due to manual measurement.\n2. Due to the different monitor and light effect,the actual color of the item might be slightly different from the color showed on the pictures.Thank you!"
    },
    {
        "title": "3 Color Light 8X Adjustable LED Magnifying Floor Stand Lamp Magnifier Glass Rotated Len Facial Beauty Salon Nail Tattoo",
        "path": "3-Color-Light-8X-Adjustable-LED-Magnifying-Floor-Stand-Lamp-Magnifier-Glass-Rotated-Len-Facial-Beauty-Salon-Nail-Tattoo-i.325403225.13637508527",
        "image": "https://down-sg.img.susercontent.com/file/735f94fd9fc6a41f50eb8b21ca882bdd",
        "price": 7549000,
        "location": "Mainland China",
        "rating": 3.6666666666666665,
        "sold": 2,
        "description": "Features：\n-8X Clear and illuminating magnifying lens.Power on and off switch, can adjust the light intensity.\n-Conveniently adjustable height and arm for magnification in any position.\n-Lens can be rotated left and right or flip up and down for your direction.\n-Adjustable gooseneck to meet height requirement.\n-Suitable for crafts, salon hobbyists, jewelers, electricians, beauticiansetc.\n-Three colour lights are switched at will, and the brightness is constant.\n-The brightness of the light can be adjusted as needed.\nSpecifications:\nColor: black\nPower: 25 w\nMaterial: ABS+ hardware\nLight source:LED\nTotal height: 180cm\nSize:As is shown in\nPackage Includes:\n1 x Lamp\n1 x Base"
    },
    {
        "title": "🔥SG LOCAL STOCK🔥 Natural Rose Quartz Jade🔥Roller Facial Body Massager🔥Gua sha🔥Face Lifting Beauty Massage🔥",
        "path": "SG-LOCAL-STOCK-Natural-Rose-Quartz-JadeRoller-Facial-Body-MassagerGua-shaFace-Lifting-Beauty-Massage-i.434162407.13812524494",
        "image": "https://down-sg.img.susercontent.com/file/242245147bd54288169eb4bc340d075e",
        "price": 685000,
        "location": "SG",
        "rating": 4.845059592464437,
        "sold": 662,
        "description": "Special Tips:\nEach one is not the same in color, jade pattern, thickness, it is normal. \n\nAbout the product\n1. Enjoy a Natural and Healthy Massage - resin roller is made from 100% natural jade stone. Anti-aging, anti-wrinkle line, reduce darkness under eyes, better skin, and health without chemicals or irritants.\n2. Double-Sided Rose Quartz Roller - The large roller is ideal for the neck, chin, cheeks, and forehead while the smaller one is perfect for around the eyes, nose, and lips. The roller promotes blood circulation, which can reduce puffiness and creases.\n3. Rose Quartz Stone Gua Sha - There is a rose quartz healing stone in the package too. It is a very good jade gua sha scraping tool, great for using on your body, and very useful for relieving pressure, always with a relaxing and graceful mood.\n\nRose Quartz Roller function\n1. Relieves facial tension.\n2. Improves skin elasticity by tightening and toning the skin.\n3. Reduces puffiness, eye bags, and dark circles around the eyes.\n4. Helps penetrate beauty products like face creams and serums deeper into the skin for better absorption.\n5. Promotes blood circulation to the face for a natural healthy glow.\n\nHow to use\n1. Wash the face with normal cleansers.\n2. Apply all-night creams to your face and neck.\n3. Use upward motions to move the Jade Roller gently over your forehead, cheeks, around the lip and neck area. Close your eyes and gently roll over your eyelids if you have puffy eyes or bags under your eyes.\n4. Use the roller on your face and neck for 5-10 minutes.\n5. Use the Jade Roller three times a week to reduce fine lines and wrinkles."
    },
    {
        "title": "【GOGO】 Efficient Beauty Scar Removal Silicone Gel Self-Adhesive Silicone Gel Tape Patch .",
        "path": "GOGO-Efficient-Beauty-Scar-Removal-Silicone-Gel-Self-Adhesive-Silicone-Gel-Tape-Patch-i.84683145.17728717807",
        "image": "https://down-sg.img.susercontent.com/file/097494b885ea36c7d0a0525c93cf81da",
        "price": 324000,
        "location": "Mainland China",
        "rating": 4.8,
        "sold": 9,
        "description": "Features:\n1. Reduces the appearance of existing scars, Helps prevent the formation of new scars\n2. Silicone scar gel strips is made from the finest safe silicone - Reusable, washable.\n3. Easy to use, comfortable and can be cut to fit any scar\n4. Combines the of silicone gel sheets with the advantages of self-adhesiveness and durability.\n5. Suitable for all kind of scars, effectively cover and reduce scars.\n\n\nSpecification:\nColor: as picture show\nSize:As the picture show\nProperties: self-adhesive silicone gel tape\nIngredients: polyurethane, TPU, silicone gel\nInstructions:\n1. Clean the scar with water and remove the outer packaging of the silicone gel dressing\n2. According to the size of the scar, cut the appropriate size with scissors\n3. Tear off the separation paper and stick the scar on the scar\nPrecautions:\n1. Make sure your skin is clean and dry before each application, so that it can produce maximum adhesion\n2. The scar sticker can be replaced every 14 days, or when its stickiness is lost.\n3. In order to adapt to the skin, the time of pasting can be increased from 8 hours a day to 20 hours a day\n\nPackage Includes:\n1 x Scar Removal Silicone Gel Tape\n\nNotice:\n1. Actual color may be slightly different from the image due to different monitor and light effect. Please allow 1-3cm deviation due to manual measurement."
    },
    {
        "title": "nis-beauty Multicolor Soft Menstrual Cup Silicone Feminine Hygiene Period Cup Reusable Cup",
        "path": "nis-beauty-Multicolor-Soft-Menstrual-Cup-Silicone-Feminine-Hygiene-Period-Cup-Reusable-Cup-i.289926682.3552570086",
        "image": "https://down-sg.img.susercontent.com/file/1c9130e3c76d3e71cc550304d438577c",
        "price": 202000,
        "location": "Mainland China",
        "rating": 4.826086956521739,
        "sold": 2,
        "description": "Welcome to Nispecial Beauty Shop!\nUsage and Tips\nThe handle can be trimmed to fit each women's vagina.\nSterilize the menstrual cup in boiled water 2-3 minutes. (The cup will not be distorted)\nOnce your menstrual cup is in place, give it a gentle spin to help set it in place.\nThe menstrual cup creates a vacuum seal inside you, preventing leaks.\nYou can wear a menstrual cup up to 12 hours!\nBreak the seal before removing your menstrual cup.\n\nOperation details:\nBefore handling the Menstrual Cup, make sure that your hands are thoroughly clean.\nSterilize the Cup before the first insertion.\nRecommend to insert the cup any of following positions: sitting, squatting, kneeling or standing-try one of these positions and choose what is most suitable for you.\nTo facilitate the insertion, you can moisten the Cup with water or water\nBased lubrication gel.\nGrip the Cup with your fingers and press.\nAfterward fold the Cup lengthwise in half using fingers of the other hand.\nHold the Cup using fingers of one hand at the lowest position possible and insert the\nCup in the vagina obliquely, toward the back.\nThe proper position of the Cup is lower than in case of tampons. Upon insertion in\nThe vagina, release the fingers and let the Cup unfold fully and adhere to the wall.\nPls notice that the Mentrual cup is for private using, Return is not allowed.\n\nSpecification:\nMaterial: medical silicone\nColor: As the picture\nSize:S,L.As the picture\n\nPackage Includes:\n1 * Menstrual cup\n\nNote:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2.Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "[nis-beauty] Orthodontic Retainer Case Waterproof Mouthguard Box Container Holder With Mirror",
        "path": "nis-beauty-Orthodontic-Retainer-Case-Waterproof-Mouthguard-Box-Container-Holder-With-Mirror-i.289926682.9304149939",
        "image": "https://down-sg.img.susercontent.com/file/e2b625150d810dc43f058dc9d85ee7a9",
        "price": 342000,
        "location": "Mainland China",
        "rating": 4.793103448275862,
        "sold": 1,
        "description": "Welcome to Nispecial Beauty Shop dear all! Feature:\n100% brand new and high quality\nDurable and handy\nNon-toxic and no odor\nCan storage denture or clean dentures\nCan also be used as a make-up mirror\n\nSpecificaition:\nProduct name: Denture Box With Mirror\nMaterial: Plastic\nColor: Black / White\nQuantity: 1 pc\nApplication: For Denture Storage\n\nPackage Included:\n1 * Orthodontic Retainer Case(The item only includes the denture box, not including the teeth model)\n\nNote:\n1. Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2. Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "[KLOWARE] Detachable Chest Pillow Breast Pillow for SPA Beauty Salon Home",
        "path": "KLOWARE-Detachable-Chest-Pillow-Breast-Pillow-for-SPA-Beauty-Salon-Home-i.140625136.10547244546",
        "image": "https://down-sg.img.susercontent.com/file/391cc8ddd0140a842cd05a49c8cf3408",
        "price": 1067000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Description:\nMade of premium velvet and cotton materials, lightweight and comfortable for daily use. \nDetachable design make it more convenient for cleaning, washable and reusable.\nFunction: Provides breast support and comfortable nights' sleep for side, back or stomach sleepers. Reduces discomfort caused by tender breasts.\nEncourages better posture during breastfeeding, alleviating strain in your back, neck, and arms.\nOccasion: Perfect for beauty salon, home and travel use.\nSpecification:\nMaterial: Crystal velvet pearl cotton\nSize: approx. 43x28cm/ 16.9x11 inch\nWeight: 220g\nPackage Includes:\n1 Piece Beauty Salon Chest Pillow\nNote:\n1. Please allow 1-3mm measuring deviation due to manual measurement.\n2. Due to the different monitor and light effect,the actual color of the item might be slightly different from the color showed on the pictures.Thank you!"
    },
    {
        "title": "Personal Care & Skincare Preservative (Natural & Cosmetic Grade)",
        "path": "Personal-Care-Skincare-Preservative-Natural-Cosmetic-Grade-i.225287598.5416803170",
        "image": "https://down-sg.img.susercontent.com/file/b03783c156f9e15a7f32be30f5491841",
        "price": 810000,
        "location": "Malaysia",
        "rating": 5,
        "sold": 0,
        "description": "Natural Personal Care Preservative is an aqueous blend of naturally occurring fruit acids, suitable for preserving both rinse-off and leave-on products. It has a broad spectrum of activity and is effective against bacteria, yeast, mould and fungi. \n\nThe preservative also contains naturally sourced, GMO free Propanediol which provides improved skin moisturisation characteristics, in addition to boosting the efficacy of the preservative. Natural Personal Care Preservative is therefore the perfect choice of preservative for skin friendly formulations.\n\nINCI Declaration: aqua, lactic acid, propanediol, citric acid, tartaric acid, gluconic acid\n\nProperties: Clear to light yellow liquid; soluble in water.\n\nCountry Origin: UK (United Kingdom)\n\nPreservative free and fragrance free cosmetic ingredients.\n\nUse: Add into the aqueous or oil based formula. Stable at pH 4-8;\n\nDosage 1.o – 1.8%\n\nApplication: All kinds of leave on, rinse off and wet wipes personal care products such as cream, lotion, sunscreen, cleanser, shampoo, shower gel, etc.\n\nRemark: Paraben Free, Thiazolinone Free, Formaldehyde Free, Preservative Free Natural"
    },
    {
        "title": "3 Color Light 8X Adjustable LED Magnifying Floor Stand Lamp Magnifier Glass Rotated Len Facial Beauty Salon Nail Tattoo",
        "path": "3-Color-Light-8X-Adjustable-LED-Magnifying-Floor-Stand-Lamp-Magnifier-Glass-Rotated-Len-Facial-Beauty-Salon-Nail-Tattoo-i.325403225.13637508527",
        "image": "https://down-sg.img.susercontent.com/file/735f94fd9fc6a41f50eb8b21ca882bdd",
        "price": 7549000,
        "location": "Mainland China",
        "rating": 3.6666666666666665,
        "sold": 2,
        "description": "Features：\n-8X Clear and illuminating magnifying lens.Power on and off switch, can adjust the light intensity.\n-Conveniently adjustable height and arm for magnification in any position.\n-Lens can be rotated left and right or flip up and down for your direction.\n-Adjustable gooseneck to meet height requirement.\n-Suitable for crafts, salon hobbyists, jewelers, electricians, beauticiansetc.\n-Three colour lights are switched at will, and the brightness is constant.\n-The brightness of the light can be adjusted as needed.\nSpecifications:\nColor: black\nPower: 25 w\nMaterial: ABS+ hardware\nLight source:LED\nTotal height: 180cm\nSize:As is shown in\nPackage Includes:\n1 x Lamp\n1 x Base"
    },
    {
        "title": "Electric Blackhead Suction Instrument Household Acne Removal Artifact Cleaning Instrument Color Light LCD Import Beauty Instrument Pore Cleaner",
        "path": "Electric-Blackhead-Suction-Instrument-Household-Acne-Removal-Artifact-Cleaning-Instrument-Color-Light-LCD-Import-Beauty-Instrument-Pore-Cleaner-i.171554188.18819745454",
        "image": "https://down-sg.img.susercontent.com/file/8c3f4deff55239d6f412c417330f99f5",
        "price": 958000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Item number: AL-64115539512\nColor: battery model [gift 6 suction heads], charging upgrade model [gift 6 suction heads], distinguished charging heating vibration model [colorful light]\nModel: 8028\nGear adjustment: three\nWorking method: electric rotation\nSpecifications: white, pink\nShell process: ABS\nFunction: IPL, import, remove blackheads, remove acne, LCD display"
    },
    {
        "title": "[Ready Stock]Jinkairui Calf Massager Pneumatic Leg Massager Air Pressure  leg massage Hot Compress Leg Relax Equipment Leg beauty machine best gift for girl",
        "path": "Ready-StockJinkairui-Calf-Massager-Pneumatic-Leg-Massager-Air-Pressure-leg-massage-Hot-Compress-Leg-Relax-Equipment-Leg-beauty-machine-best-gift-for-girl-i.272726189.4044087567",
        "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-linu3a7oqrg639",
        "price": 5514000,
        "location": "Mainland China",
        "rating": 4.764044943820225,
        "sold": 12,
        "description": "😘Hi~Welcome to Jinkairui Official Store!\n😊We are a store that provides high quality products, most items are in stock!\n👆Follow us to get vouchers!\n🚚Ship out within one business day after you place the order, delivery time is about a week!\n⭐If you have any problems about receiving the package, please contact customer service directly for help. Thank you for your understanding and support!\n\n⭐If you have these problem You need us\n1.Tired legs\n2.Leg soreness\n3.Cold legs\n4.Exercise fatigue\n\n⭐Features\nProduct Name: Pneumatic leg massage equipment\nRated frequency: 50-60HZ\nRated voltage: 12V\nProduct net weight: about 1.2KG\nRated power: 24W\nPower cord length: about 150CM\nColor classification: pneumatic leg instrument + pneumatic circulation massage + three-step force adjustment\n\n⭐Comprehensive leg massage experience - Jinkairui air compression leg massager has 2 larger airbags to massage more area around your legs. 3 Massage modes, 3 intensity and 3 Heating adjustment available provide different massage experience.\n⭐Helpful for edema relief - This air compression leg massager can not only relieve fatigue, but also can help people relieve pain who have suffered from restless leg syndrome and leg edema for a long time.\n⭐Adjustable leg wrap size - The leg massager wraps can be adjusted via the Velcro, the maximum calf circumference can be up to 56cm.\n⭐Easy to use - Young people or the elderly both can easily control the leg air massager via the handheld controller, enjoy the best mode and intensity you like. It’s powered by a 12V/1A adapter, safe and reliable.\n⭐Perfect gift for the one you love - It is the great gift for your parents and friends. It will be a great massagist for them to enjoy wonderful massage everyday. You no longer need to massage their legs with your hands.\n\n\n\n\n\n\n\n\n\n\n\n\n⭐Package Included\n 1 Pair beauty leg massager+hand control\n 1 3-pin plug\n 1 user manual\n#legmassager#calfmassager#footmassager#armmassager#airpressure#beauty#legmassage#footmassage#feetmassage#hotcompress"
    },
    {
        "title": "Professional Contact Lens Cleaner Electric Beauty Contact Lenses n Automatic Vibration Ultrasonic Cleaner",
        "path": "Professional-Contact-Lens-Cleaner-Electric-Beauty-Contact-Lenses-n-Automatic-Vibration-Ultrasonic-Cleaner-i.282496461.19435285108",
        "image": "https://down-sg.img.susercontent.com/file/728e3f9e04bdb8524a84db3200144801",
        "price": 750000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Description:\n\nUltrasonic cleaning produces small bubbles blasting, peeling off the stain on the contact lens in short time, causing no damage. 360 degree cleaning with strong power.\nOne button operation, It is recommended washing the contact lens 3 minutes each time, 3 times a week.\nLightweighted and protable, wear-resistant, smooth and easy to clean, you can carry with it into your backpack, pocket, handbag on the go.\nSuitable for families, travel, work, business trips and other occasions, also a great gift choice to your friends who wear contact lens.\nNeeds 1 AAA battery, which is not included.\n\n\n\nSpecification:\n\nMaterial: ABS PP\nPower Supply: 1 AAA Battery (Not included)\nAdjustment Gear: switch single gear\nRated Voltage: 3.7V\nRated Power: 3W\n\n\n\nSize Chart:\n\n85x60x65mm/3.35x2.36x2.56inch\n\n\n\nPackage Includes:\n\n1 Piece Contact Lens Cleaner \n\n\n\nNote:\n\n1. Please allow slightly error due to manual measurement.\n2. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n3. Wish you a wonderful on-line shopping!\n\n❤️For Return / Refund / Replacement items❤️\n✅ We accept:\n📌 Manufacturer Defect – For Item Itself \n📌 Wrong Item\n📌 Missing Accessories/ Less Item Received\n⚠️ Kindly 📷 take photo of the item and provide order number to our customer service agent\n👉 Keep box for warranty claims, void warranty if no box provided.\n📌For servicing: buyer need to bear all the shipping cost"
    },
    {
        "title": "LED Light Photon Therapy Face Mask Beauty Instrument Facial SPA Acne Wrinkle Removal Skin Rejuvenation Moisturizing Tool",
        "path": "LED-Light-Photon-Therapy-Face-Mask-Beauty-Instrument-Facial-SPA-Acne-Wrinkle-Removal-Skin-Rejuvenation-Moisturizing-Tool-i.478933490.16452741149",
        "image": "https://down-sg.img.susercontent.com/file/6c72c7f660d6c67c8a10ac73b20fb86d",
        "price": 2149000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 2,
        "description": "Features:\n◆ Red and Infrared Light Therapy Pannel\nCombo Deep Red 660 and Near Infrared 850nm ,best wavelength for light therapy. Near Infared 850nm is invisible lighht by humen eyes , so it look very dim ,and deep red 660nm is look very bightness ,so you will see half led work ,and look like all red color .but it is normal. \n\n◆ Enjoy Light Therapy at Home\nThis 45W Led light therapy panel perfect use at home ,You can enjoy your light therapyas salon quality at any time and anywhere instead of going to the light therapy beauty salon and paying the expensive cost every time. you can use the light therapy panel when you reading a book in bed , watching TV sitting on sofa ,play computer games .Enjoy light therapy any time and any where. \n\n◆ Target Treatment\nThe led panel light can coverage your partial area which you want .\nCoverage : 3.54*3.62in\n\n◆ How to USE\nSGROW 45W light therapy panel is best target put on back ,near to face, abdomen and leg. 10-20 minutes every time and do 2-14 times every week according your body require. \n\nWhat are the benefits of Red light ?\n\n1. Efficacy for Skin Rejuvenation\nA. Wrinkles and Fine Lines\nB. Tightening and Firming\nC. Anti-aging\nD. Blemishes and Redness\nE. Age spots and hyperpigmentation on the face, hands and neck\nF. Acne scars\nG. Hair growth\n\n2. Efficacy for Skin Problems\nA. Burns\nB. Acne scars\nC. Rosacea\nD. Eczema\nE. Psoriasis\nF. Athlete’s foot\n\n3. Efficacy for Pain Relief\nA. Herniated and bulging discs\nB. Muscle-related back pain\nC. Osteoarthritis\nD. Fibromyalgia\nE. Pulled and strained muscles, Muscles spasms\nF. Inflammation\nG. Nerve injuries\nH. Sports injuries\nI. Neck pain and stiffness\n\nSpecifications:\nType: Therapy Light\nColor: Red&Blue\nLED Numbers: 200 LEDs\nPower: 45W\nColor Ratio：660nm：850nm — 1:1\nLight Size: 90*92mm/3.54*3.62in\n\nPackage Included:\n1 x 200 LEDs Therapy Light\n1 x Stand base\n1 x Plug Cable(AU/US/EU Plug)\n\nNotice:\n1. The irradiation distance is subject to feeling comfortable.\n2. Do not look directly into the infrared bulb with your eyes.\n3. pay attention to stay away from all kinds of flammable materials, equipment attention to ventilation and heat.\n4. When using, the temperature is high. Do not touch the open infrared bulb with your hands. Do not wipe the hot bulb to avoid damage to the special IR-A coating on the bulb surface.\n\nNote:\n1. Please allow 0.5-1cm differences due to manual measurement.\n2. Due to the light and screen difference, the item's color may be slightly different from the pictures."
    },
    {
        "title": "Vococal 25pcs Disposable Waterproof Tattoo Table Tray Clean Pad Sheet Covers Patient Bibs Dental Napkins for Beauty Tattoo Accessories",
        "path": "Vococal-25pcs-Disposable-Waterproof-Tattoo-Table-Tray-Clean-Pad-Sheet-Covers-Patient-Bibs-Dental-Napkins-for-Beauty-Tattoo-Accessories-i.6246308.8813286704",
        "image": "https://down-sg.img.susercontent.com/file/5d35c9d2dcba5aa56880c547413bc898",
        "price": 555000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 2,
        "description": "Vococal 25pcs Disposable Waterproof Tattoo Table Tray Clean Pad Sheet Covers Patient Bibs Dental Napkins for Beauty Tattoo Accessories\nDetails:\n- 25 pcs Disposable tattoo covers clean pad in a bag, each bib measures 12.8 x 17.72 inch in size to provide maximum coverage and protection\n- Used for tattoo bedding desktop at working ,out tattoo tools, prevent ink dirty desk, keep your workbench clean and tidy\n- They are good absorbent for liquid, ink and moisture, and the poly film provides a water resistance layer, the surface has a horizontal embossing that helps prevent liquid or moisture from spreading onto clothing or other surfaces\n- Made of high quality cloth material, soft, yet strength enough to prevent from tearing easily, easy to use, with good water absorption, anti-leakage\n- Great for dental, tattooing, tray covers, table covers, lap cloth and senior care, minimizes cross contamination in a variety of situations, keep the surfaces sanitary\n- Specification:\n- Material: cloth\n- Size: 32.5 x 45cm/12.80 x 17.72inch\n- Package:\n- 25 x Tattoo Bibs"
    },
    {
        "title": "nis-beauty 100ML 8Holes Disposable Vaginal Anal Douche Retractable Wash Cleaning Anus Clean",
        "path": "nis-beauty-100ML-8Holes-Disposable-Vaginal-Anal-Douche-Retractable-Wash-Cleaning-Anus-Clean-i.289926682.7352473583",
        "image": "https://down-sg.img.susercontent.com/file/8dc5a793a18cf92568bfafd30605c05b",
        "price": 132000,
        "location": "Mainland China",
        "rating": 4.909090909090909,
        "sold": 3,
        "description": "Welcome to Nispecial Beauty Shop!\nUsage steps:\n\nStep 1: Clean your hands before usage.\n\nStep 2: Clean the irrigator with warm water, and sterilize it in boiling water for 2 minutes.\n\nStep 3: Inject the solution at required concentration to the irrigator, and tight the irrigator well and pull the head fully out.\n\nStep 4: Maintain at the supine position, squatting position or sitting position, then gently insert the washing head into the deep vagina and squeeze the solution out.\n\n \n\n\n\nSpecifaction\n\nMaterial: Plastics\n\nFunction: Anal or Vaginal Cleanning\n\nColor: Pink/Transprent\n\nCapacity: 100ML\n\nQuantity: 1 piece\n\n \n\n\n\nPackage Included:\n\n1Pcs * Anal Cleaner\n\n\n\nNote:\n\n1.Please allow 1-3mm error due to manual measurement.\n\n2.The color may be different with the true item due to the screen display, pls understand."
    },
    {
        "title": "SALORIE Eyepatch Laser Light Protective Safety Glasses Goggles Ipl Beauty Clinic Patient",
        "path": "SALORIE-Eyepatch-Laser-Light-Protective-Safety-Glasses-Goggles-Ipl-Beauty-Clinic-Patient-i.83213498.3176892252",
        "image": "https://down-sg.img.susercontent.com/file/3911043ec4bf976e2d0663610b7f22c7",
        "price": 150000,
        "location": "Mainland China",
        "rating": 4.857142857142857,
        "sold": 0,
        "description": "❣ Drop shipping ✔\n❣ Resellers are Welcome ✔\n❣ Wholesale price ✔\n❣ CUstom Custom orders ✔\n\nSpecification:\nColor:Black\nSize: about 12.5cm/4.92\"\nCase: about 15.2cm/5.98\"x4.5cm/1.77\"x2cm/0.78\"\n[Conversion: 1cm=0.3937 inch, 1inch=2.54 cm]\nOptical density :OD +4\nProtection wavelength: 190nm-2000nm\nFeature:\n-Cosmetic patient protective eyewear goggles, suitable for cosmetic laser procedures, leds treatment, Remove Tattoo and teeth whitening.\n-Suitable for Intense pulsed light: IPL\n-Protection wavelength:190nm-2000nm Block all wavelength light .\n-Absorbting materials, extensively used in laser and cosmestic field.\n-Static absorbs over 99.9% harmful UV.\n-Since it is for patient, when patient wear it, < 1.2% light can be pass through, it is not suitable for the operator.\nPackage Includes:\n1 x Laser protection goggles\n\n\nNote:\n-Due to different producing batches,product details might be a little different.If you minding the difference,please buy it carefully.\n-Please allow 1-3CM differs due to manual measurement.\n-Due to the different display and different light,the picture may not reflect the actual color of the item.Thanks for your understanding."
    },
    {
        "title": "[LOVOSKI2] SPA Massage Table Skirt with Face Breath Hole for Beauty Salon Facial Bed",
        "path": "LOVOSKI2-SPA-Massage-Table-Skirt-with-Face-Breath-Hole-for-Beauty-Salon-Facial-Bed-i.140392688.4931872829",
        "image": "https://down-sg.img.susercontent.com/file/991825fe30ef66df1f0a874572bfdde4",
        "price": 2286000,
        "location": "Mainland China",
        "rating": 4.9523809523809526,
        "sold": 1,
        "description": "Description:\nSPA Massage Table Skirt Beauty Bed Cover Linen Valance Sheet.\nMake your SPA room professional and tidy, provides a hidden saving space behind skirt for your spa accessories.\nDesigned with face breath hole and side pocket for cellphone.\nSoft fabric surface provides extra comfort feeling for your customers.\nSuit for massage bed within 185x70cm (73x28 inch) size.\nFor beauty salon, massage table, hotel, cosmetic bed, hospital, etc..\nSpecification:\nMaterial: Polyester\nSize(LxW): approx. 185x70cm/73x28 inch+54cm/21inch Drop\nFace Breath Holde Diameter: approx. 10-12cm/3.94-4.72inch\nPackage Includes:\n1 Piece Massage Table Skirt(Pillow Case and Stool Cover on Display not included).\nNote:\nPlease allow 1-3cm error due to manual measurement, make sure that you do not mind before you bid.\nDue to the different monitor and light effect, the actual color may be slightly different from the picture color."
    },
    {
        "title": "真空拔罐器家用抽气式拨火罐气罐吸美容院专用吸湿祛湿罐套装Vacuum cupping device household suction type cupping cup gas tank suction beauty salon special moisture absorp0816",
        "path": "Vacuum-cupping-device-household-suction-type-cupping-cup-gas-tank-suction-beauty-salon-special-moisture-absorp0816-i.847773213.20337444098",
        "image": "https://down-sg.img.susercontent.com/file/b961b1a6021e4b96acaf71bb026201d7",
        "price": 1827000,
        "location": "Mainland China",
        "rating": 4.916666666666667,
        "sold": 4,
        "description": "保益人生<br/>发货地：浙江省<br/>材质：硅胶真空拔罐器家用抽气式拨火罐气罐吸美容院专用吸湿祛湿罐套装Vacuum cupping device household suction type cupping cup gas tank suction beauty salon special moisture absorpBaoyi Life<br/>Origin: Zhejiang Province<br/>Material:Silicone"
    },
    {
        "title": "[nis-beauty] Natural Buffalo Horn No Stress Massage Tool SPA Therapy Massager Scraping Board",
        "path": "nis-beauty-Natural-Buffalo-Horn-No-Stress-Massage-Tool-SPA-Therapy-Massager-Scraping-Board-i.289926682.8804636709",
        "image": "https://down-sg.img.susercontent.com/file/1f37816beaf2f8466f05fbf6c6d68189",
        "price": 189000,
        "location": "Mainland China",
        "rating": 4.8,
        "sold": 4,
        "description": "Welcome to Nispecial Beauty Shop dear all! Description\nThe use of this ancient massage technique can increase blood flow (microcirculation), help soft tissue lymphatic drainage, and possibly stimulate the natural recovery of the skin and heal the opioid system, thereby reducing the appearance of wrinkles and fine lines and alleviating skin tension.\nNote\n1. The color of natural stone may vary. It is natural to have flocs in the crystal. Please understand that. If you have any questions about these items, please feel free to contact us.\n2. Due to the natural of the material, the color and texture of the product may vary, and there may be cracks, polishing marks, scratches, etc. If you are a perfectionist, please be careful to buy.\n3. Please note that this scraper is very thin and suitable for scratching.\nPackage Included\n1pc massage tool"
    },
    {
        "title": "Renhe whitening dental paste tooth whitening quick yellowing artifact student cleaning super bright white cold light beauty dental instrument den仁和美白牙贴牙齿变白速效去黄神器学生清洁超亮白冷光美牙仪牙贴品牌：仁和适用人群：通用功能：美白 去牙渍0107.",
        "path": "Renhe-whitening-dental-paste-tooth-whitening-quick-yellowing-artifact-student-cleaning-super-bright-white-cold-light-beauty-dental-instrument-den-0107-i.473232951.15733255373",
        "image": "https://down-sg.img.susercontent.com/file/07b5be83528d7e0c7f463d2d53ebb4ea",
        "price": 687000,
        "location": "Mainland China",
        "rating": 3.8333333333333335,
        "sold": 0,
        "description": "Brand: Renhe\nApplicable population: General\nFunction: whitening and removing tooth stainsRenhe whitening dental paste tooth whitening quick yellowing artifact student cleaning super bright white cold light beauty dental instrument den仁和美白牙贴牙齿变白速效去黄神器学生清洁超亮白冷光美牙仪牙贴品牌：仁和\n适用人群：通用\n功能：美白 去牙渍"
    },
    {
        "title": "[SG STOCK] Folding Wheeled Massage Table Mobile Backpack Physical Therapy Beauty Foldable Bed Portable Storage Bag",
        "path": "SG-STOCK-Folding-Wheeled-Massage-Table-Mobile-Backpack-Physical-Therapy-Beauty-Foldable-Bed-Portable-Storage-Bag-i.311748540.23620106421",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvg8-lgn8zlnpbx8a3a",
        "price": 4000000,
        "location": "SG",
        "rating": 5,
        "sold": 0,
        "description": "[SG STOCK] Folding Wheeled Massage Table Mobile Backpack Physical Therapy Beauty Foldable Bed Portable Storage Bag\n\nWheels are attached to bag for your convenience, comes with front pocket too! \n\nColour: Black\n\nSizes available:\n180 x 60cm\n180 x 70cm\n\nNote:\nBed is NOT included! \nBed is NOT included!\nBed is NOT included!"
    },
    {
        "title": "Han  1 Set Nose Lift Device Beauty Nose Clip Corrector Massage Tool Soft",
        "path": "Han-1-Set-Nose-Lift-Device-Beauty-Nose-Clip-Corrector-Massage-Tool-Soft-i.135041686.12596452011",
        "image": "https://down-sg.img.susercontent.com/file/42e75526e29db95632627e8d094855c6",
        "price": 217000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Description:\nAim to shaping a straight and high bridge nose that you can wear this nose corrector for each day, it will make your nose more slimming and lifting for a pretty appearance.\nProduced with soft elastic and gentle texture that this nose corrector is comfortable to use, the mini size make it portable to carry to anywhere, and you can easily to clean it, your body or nose will be harmless and safe to use according to its physical principles.\nBy making with PP material that this product will be soft and harmless to use.\nThe length of the set is 13cm, the width is 10cm, the height is 1cm.\nIt is suitable for shaping high bridge nose and lifting your nose bridge for making it beautiful and attractive.\n\nItem Name: Nasal Bridge\nMaterial: PP\nFeatures: Adjustable, Elastic, Mini\nSize Details: \n13cm x 10cm x 1cm/5.12\" x 3.94\" x 0.39\" (Approx.)\n\nNotes:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\n\nHow to Use:\n1.First clean the nostrils, then squeeze the lips, and place the A end of the nasal beauty device vertically upward on the tip of the nose.\n2.Then slowly place the B end of the nose beauty device on the inner side of the nose until it sets off the inner tip of the nose.\n3.Then use two fingertips to gently pinch the tip of the nose to fix the A-end part of the nose beauty device.\n\nReminder:\n1.The first few times of use will be a little painful. Therefore, it is not recommended to use it for too long at the beginning. The first day is 1-2 hours, then 2-3 hours, then 3-4 hours, and so on.\n2.Clean the nose and clip before use, and don't forget to clean it after use.\n3.Not suitable for swimming, sleeping, and strenuous exercise.\n4.Children under 16 years of age and those with rhinitis, nasal function, severe cold, or nasal discomfort should not be used.\n5.Please stop using it when there is pain.\n6.Keep away from children.\n\nPackage Includes:\n3 Pairs of Nasal Bridges\n1 x Nose Dredge"
    },
    {
        "title": "[baipeston] 50pcs Tooth Beauty Diamond  Crystal Tooth Jewelry Ornaments Tooth Gems",
        "path": "baipeston-50pcs-Tooth-Beauty-Diamond-Crystal-Tooth-Jewelry-Ornaments-Tooth-Gems-i.271696500.20947630238",
        "image": "https://down-sg.img.susercontent.com/file/fc8bdb112d41a0236c2311b815e80ca9",
        "price": 447000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Specifications:\nProduct name:  Teeth Crystal Diamond Ornament\nMaterial: Acrylic\nDiameter: 2.5mm\nColor:As show\nApplication: for dental\nQuantity: 50pcs/box\n\nFeatures:\nMake your teeth more beautiful, make your smile with more shining\nIt is colorfast and not easy to fall off\nAdopg high quality crystal, Glittering reflection surfaces\nExcellent tools for DIY amateur of Nail & Teeth decoration.\n \nPacking List: \n50pcs/box Tooth Beauty Diamond"
    },
    {
        "title": "Teeth Whitener LED Light Teeth Whitening Blue Light UV Light Laser Lamp Tool Tooth Beauty Health No Sensitivity Battery Powered",
        "path": "Teeth-Whitener-LED-Light-Teeth-Whitening-Blue-Light-UV-Light-Laser-Lamp-Tool-Tooth-Beauty-Health-No-Sensitivity-Battery-Powered-i.594018322.15588782196",
        "image": "https://down-sg.img.susercontent.com/file/a5767fc751dc3890d53b5055fc53a6ce",
        "price": 421000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Description:\nFast and Convenient\nSimple To Use\nEasy to maintain\nConvenient to carry\nWhitens in just 10 minutes\nPerfect for use before some big days\n2 button batteries, sustainable work for 48 hours\nWhite Light system offers results in as little as 10 minutes.\nUsing light activated chemical technology, the clinically tested\nEnjoy a brighter, whiter smile with the White Light fast teeth whitening system.\nThe powerful and safe whitening gel contains peroxide - the same enamel-safe ingredient used by dentists.\nWhite Light targets and removes tough stains, and provides long lasting results. Fast and easy to use, it can be used conveniently at home.\nPower supply: 2 button batteries (included)\nRated voltage: 6V\nBlue wavelength: 460 ~ 470nM\nFunction: whitening\nVoltage: DC6V\nLED lights: 1 star\nBlue light intensity: 400-600 mcs\nBlue wavelength: 460-465 nm\nProduct color: blue\nLight color:blue\n \nSpecifications:\nFast and Convenient\nSimple To Use\nEasy to maintain\nConvenient to carry\nSustainable work for 48 hours\nTeeth Whitening Light\nPackage Included:\n1 x Teeth Whitening Light (with button battery)\nNotes:\nDue to the difference between different monitors, the pictures may not reflect the actual color of the item.\nCompare the detail sizes with yours, please allow 1-3cm error, due to manual measurement.\nPlease leaving a message before you give the bad feedback, if the products have some problems.\nThanks for your understandings.\n\nProduct name: Single bead household tooth lamp\nColor: blue\nWeight: 22.6 g\nIt contains 2 button batteries. Note that there is an insulation sheet in the middle of the battery, which should be removed before use.\nUse: need to cooperate with gel use! Light alone is useless."
    },
    {
        "title": "10PCS / Lot Hot Spa Rock Basalt Stone Beauty Stones Massage Lava Natural Stone",
        "path": "10PCS-Lot-Hot-Spa-Rock-Basalt-Stone-Beauty-Stones-Massage-Lava-Natural-Stone-i.342003130.11755881065",
        "image": "https://down-sg.img.susercontent.com/file/daf9ecbdf3103490821f13d0302bfe9f",
        "price": 653000,
        "location": "Mainland China",
        "rating": 4.5,
        "sold": 4,
        "description": "100% brand new and high quality\nThese are naturally harvested, unpolished Basalt stones used for hot stone massage therapy. The Basalt stones used for bodywork were created by the long, slow cooling of molten lava spewed from volcanoes located in different regions of the world.\nThese special Basalt stones are chosen for massage since they retain heat better than most any other kind of stone due to their high iron and magnesium content as well as their extraordinary density.\nHot stone massage is a unique variant of massage therapy that employs heated stones to release physical tension and calm the nervous system.\n\nSpecification:\nMaterial: Stone\nColor: Black\nSize: 4*3cm/1.57*1.18&amp;amp;quot;\nQuanty:10PCS\n \nPackage includes:\n10 x Stones\n#Spa,Stone,Natural,Beauty,Rock,healthampbeauty,massagelava,Health Care,massagestone,massageamprelaxation"
    },
    {
        "title": "擀筋棒一根全身通用美容院按摩赶筋棍经络疏通养生刮痧棒榉木锻炼Rolling steel rod is a general body beauty salon massage cast steel ro",
        "path": "Rolling-steel-rod-is-a-general-body-beauty-salon-massage-cast-steel-ro-i.603774947.13991312486",
        "image": "https://down-sg.img.susercontent.com/file/efecd017a6a2c05099a97337131915d8",
        "price": 1091000,
        "location": "Mainland China",
        "rating": 4.882352941176471,
        "sold": 3,
        "description": "擀筋棒一根全身通用美容院按摩赶筋棍经络疏通养生刮痧棒榉木锻炼Rolling steel rod is a general body beauty salon massage cast steel ro"
    },
    {
        "title": "BJIA Personal Hair Comb Plastic Health Care Hair Cutting Portable Transparent Rainbow Salon Equipment Styling Tool",
        "path": "BJIA-Personal-Hair-Comb-Plastic-Health-Care-Hair-Cutting-Portable-Transparent-Rainbow-Salon-Equipment-Styling-Tool-i.152249440.4374518971",
        "image": "https://down-sg.img.susercontent.com/file/144fe9b4d2f14804cd0bcc4b5e63158e",
        "price": 259000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "100% brand  and high quality\nCategory of beauty tools: hairdressing tools \nMaterial: Resin\nColor: colorful \nSize: as shown\nFeatures: \n1. Made of quality material, eco-friendly and safe to use. \n2. No harm and no pain to scalp, perfect for use at home or in travel. \n3. Straight comb teeth, more convenient and easy to comb and use. \n4. Ergonomic handle is non-slip, giving you an easy and convenient grip. \nSuitable for all types of hair, curly or straight, long or short, dry or wet, etc. \n\nPackage includes: \n1 x Hair Comb\n \nNote: \nPlease allow 1-3mm differs due to manual measurement. \nDue to the different display and different light, the picture may not show the actual color of the item. Thank you for your understanding.\nHair Comb Hair Cutting Styling Tool Health Care Salon Equipment Transparent Rainbow Plastic Portable Personal"
    },
    {
        "title": "Orthodontic retainer Cleaning Tablets Washing dentures hidden beauty invisible Braces Agent Teeth Handy Tool Effervescent clean wash optimum braces07233",
        "path": "Orthodontic-retainer-Cleaning-Tablets-Washing-dentures-hidden-beauty-invisible-Braces-Agent-Teeth-Handy-Tool-Effervescent-clean-wash-optimum-braces07233-i.588846477.20426767696",
        "image": "https://down-sg.img.susercontent.com/file/ee3a0ef4558ba287b170c7c9b0e52305",
        "price": 827000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 2,
        "description": "Orthodontic retainer cleaning sheet washing denture invisible beauty invisible braces cleaner cleaning agent tooth artifact effervescent tablet Orthodontic retainer table table dengtures hidden optimum beauty invisible braces"
    },
    {
        "title": "[READY STOCK - SG DISTRIBUTOR] Portable Massage Bed Table Package with Memory Foam / beauty bed / spa bed 60cm 70cm",
        "path": "READY-STOCK-SG-DISTRIBUTOR-Portable-Massage-Bed-Table-Package-with-Memory-Foam-beauty-bed-spa-bed-60cm-70cm-i.311748540.9985071489",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdt-lgn83fdsad0kf4",
        "price": 4500000,
        "location": "SG",
        "rating": 4.968944099378882,
        "sold": 11,
        "description": "❗️❗️❗️Available in 60cm or 70cm width❗️❗️❗️\n\n❗️DELIVERY WITHIN 24 HOURS❗️\n❗️READY LOCAL STOCK❗️\n\nProduct Specification:\n- 100% Brand New item! \n- Colour: Black \n- Non Reclinable And Reclinable Option Available!\n\n2️⃣ FREE GIFTS!\n- 1 x Rectangular Head Rest Pillow (same colour)\n- 1 x Easy Carry Bag \n\n⭐️ Optional Accessories for purchase ⭐️\n- 1 x Extended U Head Cradle (Black)\n- 1 x Front Arm Rest (Black)\n\nCOMFORTABLE AND EXCEPTIONALLY STRONG\n• High density thick sponge (5cm thick) cushioning gives a soft and comfortable experience to lay on. \n• Made of reinforced beech frame with support cables, reinforced hardwood corner blocks for superior strength \n• To enable up to 600kg on the spa massage table.\n\nSIMPLE INSTALLATION\n• This massage bed does not require any tools for installation\n• All we had to do was open/unfold massage bed from the middle and the legs automatically fell into place. \n• Massage table quick installation method is saves valuable time.\n\nHEIGHT ADJUSTABLE MASSAGE TABLE\n• Double Knob Leg Adjustments, more stable and stronger\n• The simple height adjustment method is convenient for the masseur to work better with spa bed.\n\nPORTABLE AND LIGHT WEIGHT\n• Folding design for space saving and easy carry.\n• Easy to move around if you're a traveling esthetician or massage professional\n• Includes a durable carrying storage bag\n• The secure lock ensures safe and convenient carrying of the massage bed. \n\nEXCELLENCE IN DETAIL PROCESSING\n• Cover draped in PU leather, durable, soft, and easy to clean\n• Non-Slip Foot Base\n• Oil and water proof simulated leather covering for good durability.\n• Product Size 185cm x 60cm x 80cm (Adjustable)\n• Height adjustment 62 - 88 cm"
    },
    {
        "title": "[DOLITY2] Beauty Salon Eyelash Bed Cover Elastic Cosmetic Salon Table Cloth New",
        "path": "DOLITY2-Beauty-Salon-Eyelash-Bed-Cover-Elastic-Cosmetic-Salon-Table-Cloth-New-i.89117437.11235528571",
        "image": "https://down-sg.img.susercontent.com/file/934465a09b9c44b7d38014bb9cf769f0",
        "price": 1399000,
        "location": "Mainland China",
        "rating": 4.7894736842105265,
        "sold": 7,
        "description": "Description:\nThis is a Beauty sheets specially prepared for grafting eyelashes. When the eyelashes are grafted, the grafter can let the experiencer lie on the Beauty sheets and enjoy the grafting comfortably.\nThis Beauty sheets is designed to fit the human body, and the curved opening below allows the grafter's feet to be placed with peace of mind.\nMade of soft cloth material, environmentally friendly, healthy and harmless.\nFirm, wearable and durable, Perfect for salon bed use, especially eyelash grafting.\nStretch on all sides to control tables of various sizes, comfortable and elastic, offering a better enjoyment\nSpecification:\nSize: 183X76X76cm\nColor: black\nPackage Includes:\n1X Beauty Salon Cover\nNote:\nPlease allow slightly 0-1cm difference due to manual measurement.\nColors can appear different depending on light and how the listing is viewed.\nThanks for your understanding and attention. Wish you a pleasant shopping experience!"
    },
    {
        "title": "Vanadium Titanium Beauty Instrument Mesotherapy Gun",
        "path": "Vanadium-Titanium-Beauty-Instrument-Mesotherapy-Gun-i.109805447.2583551198",
        "image": "https://down-sg.img.susercontent.com/file/2cf8b42f49c5251420c2c04c5fa4ad99",
        "price": 7452000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Features:\nMesogun is designed for mesotherapy which achieve some skin beautifying effects by injecting small amount of based on the theory that dermal layer, subcutaneous layer and muscle.\nWithout the need of surgery and anesthesia, painless and safety.\nDoes not cause the phenomenon of bleeding, swelling and blood stasis.\nSuper water replenishment, moisturizing and whitening, skin regeneration, skin tightening and brightening, wrinkle removal.\nSmall size, portable and convenient to operate, perfect for home use.\nSuitable for neutral skin, dry skin, sensitive skin, oily skin and acne skin.\n\nSpecifications:\nCondition: 100% Brand New\nItem Type: Anti-Aging Products\nMaterial: ABS + Electronic Components\nVoltage: 110-240V\nPower: 50/60HZ\nColor: As Picture Show\nItem Size: 17.5 * 3.5 * 11.3cm / 6.9 * 1.4 * 2.7inch(L* W * H)\nPackage Weight: Approx. 612g\nItem Type: Skin Rejuvenation Machine\nFunction: Moisturizing, Whitening, Skin Regeneration, Skin Tightening, Wrinkle Removal\nPackage Include:\n1 x Mesogun\n1 x Pack of Accessories\n1 x Adapter\n\n#SkinRejuvenationMachine #WrinkleRemovalMachine #Anti-AgingMachine #"
    },
    {
        "title": "6PCS/Set Stainless Steel Spiral Portable Earpick Spoon Ear Wax Remover Beauty Tool Kit",
        "path": "6PCSSet-Stainless-Steel-Spiral-Portable-Earpick-Spoon-Ear-Wax-Remover-Beauty-Tool-Kit-i.264431311.6339191705",
        "image": "https://down-sg.img.susercontent.com/file/73c2923863e39b11e37a5b6944f8208a",
        "price": 301000,
        "location": "Mainland China",
        "rating": 4.958333333333333,
        "sold": 0,
        "description": "Material: Stainless Steel\n\nThe package include 5 pcs earpicks & 1 pc cleaning brush."
    },
    {
        "title": "COOLDAISY 18/20/24Pcs Acne Patch Pimple Treatment Invisible Spot Sticker Beauty Tools HOT",
        "path": "COOLDAISY-182024Pcs-Acne-Patch-Pimple-Treatment-Invisible-Spot-Sticker-Beauty-Tools-HOT-i.272082816.22625512053",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-c4g4dl8roonv1d",
        "price": 186000,
        "location": "Mainland China",
        "rating": 4.7272727272727275,
        "sold": 21,
        "description": "Features:    \n1.100% brand new and super high quality.\n2. It has a good absorption effect, does not leave scars, relieves pain, keeps the wound moist, promotes wound healing, and reduces the formation of scars.\n3. It can promote the growth of acne, absorb and decompose secretions, and at the same time help the wound to reduce inflammation and heal, promote the growth and repair of the muscle bottom tissue after healing, and avoid the formation of scars.\n4. Breathable, invisible, anti-bacterial, prevent cross-infection and accelerate wound healing.\n5.If you have any problems with the products, please feel free to contact us after you received the itmes.\n\n\nSpecification:\nMaterial: Hydrocolloid\nStyle:Heart, Pentagram, Flower\nColor:As the picture show\nSize:15mm/0.59in\n11mm/0.43in\n12mm/0.47in\n10mm/0.39in\n\n\nPackage includes:\n18/20/24Pcs Acne Patch.\n\n\nNote:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2.Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "Retainer cleaning Tablets lion King Denture Braces Effervescent Teeth Washing Handy Tool Cleaner Disinfection Hidden Beauty T ki",
        "path": "Retainer-cleaning-Tablets-lion-King-Denture-Braces-Effervescent-Teeth-Washing-Handy-Tool-Cleaner-Disinfection-Hidden-Beauty-T-ki-i.839538347.20034401653",
        "image": "https://down-sg.img.susercontent.com/file/7743bc5774ce09ee63ff92835a4f53e1",
        "price": 913000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "LION/狮王\n发货地：浙江省\n适用人群：通用\n功能：去牙渍 除菌LION/Lion King\nPlace of Origin: Zhejiang Province\nApplicable people: general\nFunction: remove tooth stains and sterilize"
    },
    {
        "title": "Natural Ox Horn Gua Sha Board Gouache Scraper Face Massager Facial Lift Neck Body Scraping Massage Beauty Tools Physical Therapy",
        "path": "Natural-Ox-Horn-Gua-Sha-Board-Gouache-Scraper-Face-Massager-Facial-Lift-Neck-Body-Scraping-Massage-Beauty-Tools-Physical-Therapy-i.864110307.17785340150",
        "image": "https://down-sg.img.susercontent.com/file/be2cc5717ddeb85bae3ba31939ed07a1",
        "price": 691000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Materail: Natural OX Horn\n\nSize:\nGua sha board: Approx.9.5*4cm\nAcupoint stick: Approx.12.5*3cm\n\n\nDescription:\nIt can promote metabolism, make it to the skin pores, promote the body's blood flowing at the same time, get rid of toxins, to restore the body's metabolic activity.\nRelaxing tendons and activating collaterals, relieve muscle tension, relieve pain symptoms obviously, is beneficial to the patient.\nAccelerate the facial micro-circulation,reduce facial tension,reduce wrinkles and fine lines.\nGood for your skin product to be absorbed by your face.\n\n\nNote:Due to the variety of natural horn materials and colors, so the finished products may different in color,size,texture from one another,we will send randomly,please refer to the real object.Thanks for understanding!"
    },
    {
        "title": "Folding Beauty Bed Wholesale Household Fire Moxibustion Massage Therapy Body Bed Spa Tattoo Bed Salon Special lrs001.sg",
        "path": "Folding-Beauty-Bed-Wholesale-Household-Fire-Moxibustion-Massage-Therapy-Body-Bed-Spa-Tattoo-Bed-Salon-Special-lrs001sg-i.471755235.16078068569",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-gz9wvcd72mnv84",
        "price": 12420000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Internal filler : Other \nModel : Omn \nColor : X 70 Wide Six Legs Pink White Ladder Head \nColor : X 70 Wide Six-legged Purple And White Ladder Head \nColor : X 60 Wide Six Legs Full Powder Square Head \nColor : X 70 Wide Purple And White Strip Square Head Plate \nColor : X 70 Wide Six-legged Brown Ladder Head-stool \nColor : X 80 Wide Six-legged Brown Square Head-stool \nColor : X 70 Wide Six Legs Pink White Square Head-stool \nColor : X 70 Wide Six-legged Brown Square Head-stool \nColor : X 70 Wide Six Legs Brown Square Head \nColor : X 60 Wide Six-legged Pink White Ladder Head-stool \nColor : X 80 Wide Six-legged Brown Square Head (extra Large) \nColor : X 70 Wide Six Legs Purple White Square Head \nColor : 60 Wide Four-legged Monthly Tooth Powder Ladder Head (limited To 1) \nColor : X 70 Wide Six-legged Pink White Ladder Head-stool \nColor : X 70 Wide Six-legged Purple And White Ladder Head-stool \nColor : X 60 Wide Six-legged Purple And White Ladder Head \nColor : X 70 Wide Six Legs Purple White Square Head-send Stool \nColor : X 60 Wide Six-legged Purple And White Ladder Head-stool \nColor : X 60 Wide Six Legs Pink White Ladder Head \nColor : X 70 Wide Six-legged Brown Ladder Head \nColor : X 70 Wide Six Legs Pink White Square Head \nColor : X 60 Wide Six Legs Pink White Square Head-stool \nColor : X 70 Wide Powder White Strip Square Head Plate-stool \nColor : X 60 Wide Six-legged Purple And White Square Head-stool\n\nSelection Description:\n\nColor:\n1.185x70 Wide six-legged Powder White Ladder head\n2.185x70 Wide six-legged purple White Ladder head\n3.180x60 Wide six-legged full powder square head\n4.185x70 Wide purple and white strip square head with plate\n5.185x70 Wide six-legged brown ladder head-send stool\n6.190x80 Wide six-legged brown square head-stool\n7.185x70 Wide six-legged pink white square head-send stool\n8.185x70 Wide six-legged brown square head-stool\n9.185x70 Wide six-legged brown square head\n10.180x60 Wide six-legged Powder White Ladder head-send stool\n11.190x80 Wide six-legged brown square head (extra large)\n12.185x70 Wide six-legged purple and white square head\n13.60 Wide four-legged monthly tooth powder ladder head (limited to 1)\n14.185x70 Wide six-legged Powder White Ladder head-send stool\n15.185x70 Wide six-legged purple White Ladder head-send stool\n16.180x60 Wide six-legged purple White Ladder head\n17.185x70 Wide six-legged purple and white square head-stool\n18.180x60 Wide six-legged purple White Ladder head-send stool\n19.180x60 Wide six-legged Powder White Ladder head\n20.185x70 Wide six-legged brown ladder head\n21.185x70 Wide six-legged pink white square head\n22.180x60 Wide six-legged pink white square head-send stool\n23.185x70 Wide powder white strip square head with board-send stool\n24.180x60 Wide six-legged purple and white square head-stool\n#FoldingBeautyBedWholesaleBeauty #HomeBeauty #FireMoxibustionMassageBeauty #TherapyBeauty #BeautyBedBeauty #SpaBeauty #TattooBeauty #SalonBeauty #Special\nlrs001.sg"
    },
    {
        "title": "Household Beauty Instrument Hot Cold Hammer Massage Face Ultrasonic Vibration",
        "path": "Household-Beauty-Instrument-Hot-Cold-Hammer-Massage-Face-Ultrasonic-Vibration-i.109805447.1749836684",
        "image": "https://down-sg.img.susercontent.com/file/5da93887fd6c98d06d6b0b69b3408275",
        "price": 3337000,
        "location": "Mainland China",
        "rating": 5,
        "sold": 0,
        "description": "Features:\nErgonomic handle design, easy to grip, convenient to use. \nLED red light care:Deep in the bottom of skin,improve blood criculation,promote skin metabolism,actives cell and collagen,eliminatestoxin and beautifies skin,improves pigmentation,and recovers skin elasticity.\nLED blue light care：Anti-inflammatory,reduces acne,relieves facial flush,good for acne treatment.\n6-42℃ Adjustable Temperature: 10 optional temperature modes, tighten and whiten your facial skin efficiently.\nEasily charged by computer, power bank or phone chargers through USB interface.\nWith its mini size, it is very easy to carry, you can care your skin even on travel or business trip.\nFunction: \nIce sence effect \n1.Help skin maintain flexibility,prevent allergies and other problems; \n2.Shrink pores. lock moisture aand reduce wrinkles; \n3.Can soothe sore muscle, relieve skin fatigue,soothe the skin sence of tention, reduce shin redness,pain ,resistance to repeated groeth of acne. \n Warm effect \n1.Warming, make people feel warm and comfortable, help to relax muscle,relieve pain; \n2.Stimulate the blood circulation acceleration. so the pore open ,can help theskin to quilly import all skin care products absorb double skin. make the skin more elastic and moist; \n3.Putting a sponge to deep cleaning, better able to export the face toxins,blackheads,dirt. \nDescriptions:\nIt works on whitening skin, removing wrinkles, eliminating the stain, fading dark circles, eliminating acne, skin moisturizer and skin tightening, etc.\nIt also can help to burn fat to achieve face-lift effect.\nApplicable for face, waist, leg, hip and other body parts. \nWith LCD display, more convenient for your daily use.\nSpecifications:\nColor: white, champagne color\nSize: 150*50*55mm\nMaterial: ABS\nInput voltage: DC 5V\nUsing power: max 10.5W\nTemperature range:6-42℃\nVibrating frequency: 8200(±10) rpm\nWorking time: 3 minutes per time\nCharge time: 5-6 hours\nCharge power: 2.5W\nBattery capacity: 1000mAh\nPackage included:\n1 x Beauty Instrument\n1 x USB Cable\n1 x User Manual\nNotes:\nPlease allow 0-2mm error due to manual measurement, thanks for understanding.\nDue to the difference between different monitors, the picture may not reflect the actual color of the item. Please understand, thank you!"
    },
    {
        "title": "[WYL] Taping Thighs Body Shaper Beauty Legs Shapewear Slimming Compression Sleeves\r\n **",
        "path": "WYL-Taping-Thighs-Body-Shaper-Beauty-Legs-Shapewear-Slimming-Compression-Sleeves-i.364505628.10746914627",
        "image": "https://down-sg.img.susercontent.com/file/c1ea2131a3b25d9ca804d9da065edd1a",
        "price": 257000,
        "location": "Mainland China",
        "rating": 4.636363636363637,
        "sold": 2,
        "description": "Description:\n100% Brand new and high quality.\nProtect the thigh.\nStrong elastic socks.\nThrough the pressure stovepipe.\nExtremely soft flexible fibre, firmly cover they body while breathe freely NOT stuffy\nRelax the muscles, relieve fatigue, help to regulate blood circulation.\n\nSpecification:\nSize: Free Size\nMaterial:Blending\nQuantity :1 Pair\nLength: About 9.33 inch *4.53 inch (Undrawn)\nColor: Black,Nude.as the picture show（optional）\n\nPackage include:\n1Pair(2pcs) * Leg Shaper Sleeve\n\nNote:\n1. Due to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures.\n2. Please forgive 1 cm/0.39\"-3 cm/1.18\" measuring deviation due to manual measurement."
    },
    {
        "title": "JONY New Orthodontic Braces Silicone Teeth Retainer Mouth Guard Health Care Oral Beauty Anti Bruxism Hot Dental Alignment Straightener",
        "path": "JONY-New-Orthodontic-Braces-Silicone-Teeth-Retainer-Mouth-Guard-Health-Care-Oral-Beauty-Anti-Bruxism-Hot-Dental-Alignment-Straightener-i.460969693.14304831389",
        "image": "https://down-sg.img.susercontent.com/file/714deb7bb1f8ba8740cd42cf6ff6fe11",
        "price": 222000,
        "location": "Mainland China",
        "rating": 4.833333333333333,
        "sold": 13,
        "description": "<div><p>Size:6*5.5*2.5cm\nSuitable for age over 12 years old\nColor: transparent\nMaterial:Medical TPE\nNotice:Please do not soak it in hot water over 70°\n100% Brand new\n*D1 is soft, the first stage, use 2-3months.\n*D2 is moderate, the second stage, use 4-5 months.\n*D3 is hard, the third stage, use 3-4 months.\n*The correction process is divided into three stages. After using D1 for 1 month, you can gradually use D2 together.\nUse D2 on daytime and D1 at night. When you fully adapted to D2, you can be gradually use D3 together. \nUse D3 on daytime and D2 at night. You must wear it every day, normally, there will be noticeable improvement in 4-6 months.\n\nPackage included:\n1 x Teeth Retainer OPP Bag Package without box\n\n*Special structure: \nThe product is made of medical plastic and there is a little plastic smell odor, please rinse with saline or toothpaste before using.\n*Functions:\n1. Lip block, slow muscle contraction, develop good habits.\n2. Upgraded version of the closed design to remove bad oral breathing habits\n3. The tip of the tongue improves the force of the tip of the tongue on the teeth and improves the dislocation of the teeth.\n4. Dental arch track, two-way mechanics, improved teeth, promoted neatly arranged teeth.\n*Appropriate rigidity: \nHas enough thrust force and is comfortable to wear at the same time. Suitable for even metaphase and severe symptom.\n*Multifunctional: \nCan improve bucktooth, large tooth gap, malocclusion and even your chew habits. Wearing it at night can also relief odontoprisis symptom.\n*Convenient: \nTo keep it clean, you just need to soak it in mouth wash for 25-30 minutes.\n\nPay Attention:\n1. A few people may have drooling, toothache, nausea and other inadaptability in the early use, which belongs to normal physiological reaction and needs to adapt for a period of time.\n2. Don't bite too hard or eat too fast or too hard during wearing.\n3. Close your mouth naturally when you wear it. Don't chew with your teeth.\n4. It is not recommended to use during steel wire.\n5.Tooth orthodontic is a long process, please be patient for the effect.</p></div>"
    },
    {
        "title": "[Feature] Portable Physical Hair Removal Nano Hair Remover Tool/Washable Painless Gentle Hair Remover /Fast Painless Hair Removal Personal Care Tool",
        "path": "Feature-Portable-Physical-Hair-Removal-Nano-Hair-Remover-ToolWashable-Painless-Gentle-Hair-Remover-Fast-Painless-Hair-Removal-Personal-Care-Tool-i.157026117.15582242985",
        "image": "https://down-sg.img.susercontent.com/file/4782c6300f6364a9e8a91a13da434110",
        "price": 478000,
        "location": "Mainland China",
        "rating": 4.666666666666667,
        "sold": 0,
        "description": "Welcome To Our Store\n\n1,What our aiming at? \n★ Perfect product: popular & practical & inexpensive.\n★ Fast delivery: ready stock & Quick Shipping\n2,Better consumer protection \n★ Full refund if you don't receive your order.\n★ Full or partial refund , if the item is not as described.\n\nProduct description:\n\nThe primary version is relatively sharp, and the exfoliating effect is better. At the same time, it can remove hair. The upgraded version is relatively mild. It mainly removes hair and can also remove dead and peeling skin.\n\nWhy go through the hassle of getting rid of unwanted hair when you can have one simple and easy solution – Nano Hair Remover. A gentle yet effective 2 in 1 tool that acts as exfoliator while removing unwanted hair in a modern and painless way.\n\nmagic hair eraser is infused with Micro-Nano Technology, which exfoliates dead skin cells while also eliminating hair. Say goodbye to rough skin and unsightly hair in painless and modern method. \n\nPackaging\n\nNano Hair Remover comes together with a gift box which is suitable for storage purpose or even as a gift. \n\nBeauty Benefit \n\nGentle on skin\nSlower hair growth\nremoves dead or dry skin\nprevents ingrown hairs\nprevent razor burns\nexfoliates and rejuvenates the skin\nimprove blood flows\n\nSpecification:\nMaterial: ABS+glass\nSize: About 105*60*35mm\nquantity: 1\n\nPackage contains: 1* Gentle Hair Remover\n\n\n\nHow To Use\n\nCleanbig Hair Remover with water and soap. Then allow it to air dry.\nPrepare your skin by also cleaning with water and soap. Dry your skin with towel.\nFirmly place the Hair Remover on your skin and move gently in a circular motion, cleaning off any removed hair from the tool as you go.\nMoisturize your skin.\n\nSafe For\n\nArms, legs, back, knuckles and bikini line (depends on the coarseness of the hair)\n\nDon’t overuse it or press too hard on the skin. If you have sensitive skin, try it on a small part of your arms/legs before other delicate parts. \n\n\nQ: Does it pain to use this?\nA:Painless & Safety\n\nQ: Can use it all over body?\nA:Yes.\n\nQ:Can use it underarm & Bikini area?\nA:Yes. But some people can't wipe it by themselves. can ask someone to help wipe it.\n\nQ: It can remove the hair until the roots or not?\nA:Can remove hair until the roots and feeling Smooth surface.& remove dead skin.\n\nQ: What are the side effects?\nA: No side effects, no chemical products together,only the hair removal!Safety!\n\nQ: Do I need to use lotion after use?\nA: Some people's skin is dry and rough. It is recommended to apply the lotion after use. After all, exfoliating hair and exfoliating at the same time.\n\nQ:How often use it?\nA: Remove hair until the roots and Exfolid skin, \ncontains Inhibit hair growth essence ,Use it once 1-2 months first,after some times slowly with little or no growth.\n\nQ: Is there any requirement for the thickness and length of the hair?\nA:No po.any style of hair is ok.\n\nQ: I want to buy it, but I'm afraid it's expensive?\nA: On the contrary, it’s cheapest. Because it can be reused and h"
    },
    {
        "title": "🔥Ship 24H🔥Massage Tools Beech Massage Sticks Scraping Supplies Weight Loss Accessories Beauty Massager 减肥美容按摩棒 刮痧擀筋棒",
        "path": "Ship-24HMassage-Tools-Beech-Massage-Sticks-Scraping-Supplies-Weight-Loss-Accessories-Beauty-Massager-i.374794072.17955592404",
        "image": "https://down-sg.img.susercontent.com/file/31561845f72ad6c88191b02381772fa5",
        "price": 799000,
        "location": "Mainland China",
        "rating": 4.862068965517241,
        "sold": 7,
        "description": "Name: Massage stick\nFunction: Scraping/massage/stretching muscles/acupuncture\nMaterial: Beech\nSize: Length 48CM\nApplicable parts: Whole body (except face)\nApplicable people: Men, women and children\nApplicable places: Beauty salon / health center / home\nType: Manual Gua Sha Massage Tool\n\n1, The Wooden Cellulite Tool Can Be Used To Expel And Promote The Reconstruction Of Residual Toxins And Fats.For Tightening Tissue.It Helps Eliminate Excess Fat In The Lymphatic System.Our Wooden Massage Tools Include Large Muscle Groups Such As Upper Arm, Back, Leg Tendons, Thighs, Etc.This Wooden Massage Tool Is A Suitable Tool To Give You The Desired Tissue Stroke And Provide Relief The Body Needs\n2, Special Bump Design, Groove Bending Amplitude Is More Suitable For Human Curves, Different Lengths Are Suitable For Different Parts Of The Body.Effectively Relieve Fatigue, Muscle Pain And Stiffness.\n3, Smooth Edge Massage Stick, Will Not Scratch The Skin.The Size Is Moderate And Comfortable To Hold.\n4, Carbonized Wood, Moisture-Proof, No Burrs, Hard Wooden Floor, Used To Massage Acupoints, Roll Meridians, Acupoint Massage, Scraping.\n5, The Upgraded Massage Comb Is Suitable For Combing Hair, Head Massage, Facial Massage, Hand And Foot Massage, Etc.It Can Help You Relieve Stress, Promote Blood Circulation And Make You Healthier."
    },
    {
        "title": "NEW🧧Facial Moxibustion Artifact Eye Beauty Equipment Moxibustion Rods Cans Peach Blossom Facial Household Smoke-Free War",
        "path": "NEWFacial-Moxibustion-Artifact-Eye-Beauty-Equipment-Moxibustion-Rods-Cans-Peach-Blossom-Facial-Household-Smoke-Free-War-i.518067795.12396561640",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qveo-lfl8gyt0fvs77f",
        "price": 7645000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "🍒 Hello dear customer, welcome to my store 🍒\n\nPlease contact me before placing order to get RM2-RM30 coupon.\n🍀------------------Before Placing an Order，Please Contact Me，Get Discount Coupons ------------------🍀\n\n😋Our products are all factory direct sales\n😘The products are high quality and low price, quality assurance\n😊Welcome to order\n\nItem No.：FRD-LX01\nShape：Round\nColor Classification：Peach Pollen-【with Moxa Cone1Box】-Add to Favorites Get Wormwood Essential Oil for Free1Bottle Pearl White-【with Moxa Cone1Box】-Add to Favorites Get Wormwood Essential Oil for Free1Bottle Peach Pollen-【with Moxa Cone2Box】-Add to Favorites Get Wormwood Essential Oil for Free1Bottle Pearl White-【with Moxa Cone2Box】-Add to Favorites Get Wormwood Essential Oil for Free1Bottle\nHole Count：Single Hole\nProduction Enterprise：Furunda\nType of moxibustion device：Portable\nBrand：Furunda（Household Appliances）\n\n🙋‍♀️Reminder:\n\n🛫 Fast delivery within 1-3 days, received in about 6-11 days🛬\n☎️Please confirm your mobile number and address before placing an order\n👍 All our items are as described in the description.\n🙅‍♀️If you have any questions after receiving your product, please do not give stars or bad reviews first, you can contact our customer service, we will solve it for you as soon as possible. Hopefully a good service will keep you repurchasing.\n🙆‍♀️If the product is normal and there is no problem, please leave a message to give a 5-star praise. ★★★★★Thank you. Every review counts for the store.\n\n▶ We deal directly with the manufacturer to ensure that all items are of good quality and condition, and we carry out proper quality control and assurance. All items are 100% brand new\n▶ Due to the difference of different monitors and screens, the pictures may not reflect the actual color of the item.\n▶ Please allow small errors due to manual measurement.\n\n★ Our price may not be the lowest, but we can guarantee our product quality is the best.\n\n★ Finally, whether you place an order or swipe your card, we still cherish your visit to our products, thank you very much.\n\n😜 Thank you for your support and understanding."
    }
]