[
    {
        "title": "HomeTeamNS - Adventure Centre Singapore Outdoor Rock Climbing Zipline Attractions Tickets Vouchers Travel Team Bonding",
        "path": "HomeTeamNS-Adventure-Centre-Singapore-Outdoor-Rock-Climbing-Zipline-Attractions-Tickets-Vouchers-Travel-Team-Bonding-i.408840252.16512241197",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-23020-8bmv592wc8mv51",
        "price": 3700000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "HomeTeamNS - Adventure Centre\nHoused in our very own Bukit Batok Clubhouse, we offer a variety of activities that will pump up your adrenaline! Tackle our Challenge Rope Course, plunge off on a thrilling 50m Flying Fox zipline and more!\n\nTicket(s) Inclusion:\n- 1 pax: Any 2 adventurous activities (Abseiling, Challenge Rope Course, Rock Climbing, 50m Flying Fox)\n\nHow To Buy:\n1. Select ticket and checkout\n2. Receive confirmation and e-ticket immediately via email (please check your spam folder)\n3. Follow the steps in the email to book your desired date / timeslot (due to capacity limit)\n4. Have fun and enjoy your day!\n\nImportant Note:\n- Guests are required to make a booking reservation before heading down to the attraction.\n- Ticket(s) is valid for 30 days from date of issuance.\n- All attractions reserve the right to alter their opening hours on selected dates, ticket packages, rates and governing terms and conditions without prior notice. Please refer to attractions' official website for more updated information.\n- Please also visit attractions' official website for any updates of operation hours and latest updates on COVID-19 regulations.\n- Cancellations, refunds, or changes are subjected to individual ticket conditions. Please contact us regarding this matters.\n- A minimum of 6pax is required per booking.\n- Minimum height requirement: 1.2m\n- Proper attire is required for all activities - Covered shoes and no sleeveless top. \n- Each time slot is 2 hours \n- Advanced booking of 5 days is required \n- Open Daily: 10am to 5pm\n\nFollow us for our next promotions, discounts, lowest prices, best deals, cheap, open dated e-tickets, activities and attractions."
    },
    {
        "title": "Front Runner Movable Awning Arm for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Front-Runner-Movable-Awning-Arm-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.19880019603",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdt-lh46jyninzwgaf",
        "price": 125900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "How often have you set up your campsite, unrolled the awning, and discovered that the shade you had mid morning, is gone mid afternoon? That’s why Front Runner created the movable awning arm. It swings out, holding the awning, giving more precise control over blocking the sun.\n\nhis Front Runner Slimline II Rack accessory allows you to move a Front Runner Easy-Out Awning as the sun changes position -- providing the maximum amount of shade at all times during the day.\nThe arm can be fitted to either the left or right rear corner of a Front Runner Slimline II Rack.*\nCompatible with the 1.4m, 2m, or 2.5m sized Front Runner Easy-Out Awnings.\nThe awning can be positioned and opened at any angle between the side and the rear of the vehicle and secured using supplied guy-lines.\nThe movable arm has two (2) locking pins to allow securing the arm in windy weather to either the side of the vehicle to the rear.\nEasy-Out Awnings mount directly to the arm.\nCompatible with other retractable awnings brands, but drilling may be required to mount the awning track.\n\n*NOTE: This awning arm only works on racks 1358mm (53.5\") L x 1255mm (49.4\") W and larger. It will not work when Expedition Rails are installed in the same location as the Moveable Awning Arm.\n\n \n\nConsists of:\nMovable awning arm\nInstallation hardware\n\nMaterials used:\nBlack powder-coated steel\n\nProduct Dimensions:\n1234mm (48.6\") L x 356mm (14\") W x 120mm (4.7\") H\n\nWeight:\n11.26kg (24.8lbs)"
    },
    {
        "title": "1 Fashion Backpack multifunctional And Waterproof Companion For All Adventures Outdoor Legionary Fan Backpack Travel Backpack",
        "path": "1-Fashion-Backpack-multifunctional-And-Waterproof-Companion-For-All-Adventures-Outdoor-Legionary-Fan-Backpack-Travel-Backpack-i.642829935.22249951460",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvef-ljv6x2ue7vx267",
        "price": 4039000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nFashion backpack: This backpack is designed to be fashionable , suitable for those looking for fashionable and practical bags. The pressure reducing belt is easy to carry and suitable for any occasion.\nTravel backpack: This backpack is lightweight and has ample storage space, making it a must-have item for your next adventure. Adjustable shoulder straps ensure a comfortable fit, while the durable structure can withstand the rigors of travel.\nOutdoor hiking backpack: This backpack is designed specifically for outdoor enthusiasts and is sturdy and durable. Precision sewing and strong load-bearing capacity make it suitable for long-distance hiking or camping trips. Nylon fabric is waterproof and easy to clean, ensuring that your items remain dry and protected.\nOutdoor corps Fan Backpack: This backpack is designed specifically for outdoor corps fans. The entire webbing allows for the connection of additional tactical bags or equipment, while the compression strap on  the bottom is used to pend sleeping bags or tents.\nSpecification:\nColor: multi-color.\nMaterial: Cloth,Nylon.\nSize: Approx 52*30*15cm/20.47*11.81*5.91inch.\n\nNote:\nThere might be a bit color distortions due to different computer resolutions.\nThere might be a slight errors due to different hand measurement.\nPackage Includes:\nKnapsack 1pcs                                                                                                                                                                                                              \n\n\n*Welcome to  store, we are glad to serve you here and aim to provide you best shopping experience.\n*If any problem, please feel free to chat with us. We owns a broad range of goods with high quality and competitive price .\n*You can enjoy a further discount for batch order ~We provide the products with the high quality and competitive price.\n*we will update product listing timely and promise all products are 100% new. \n*For more promotion,please follow us,get more discount at first time.\""
    },
    {
        "title": "Hannibal Safari Legless Awning 2.4m for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Hannibal-Safari-Legless-Awning-24m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.21180005011",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvg6-lh2vjcutuyvbf0",
        "price": 169900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Hannibal awning sets up in 30 seconds!!! They have no posts, pegs or ropes to trip over or bump into. It basically supports off the roof rack. Awnings provide shade, comfort, and protection against the elements when camping. Speed and ease of setup is of paramount importance to enable usage while en-route, e.g. for a quick stop at lunchtime. Special importance has been given to the design of the structure to ensure strong mounting to guarantee that the awning stays stable when the wind blows. \n\nHannibals premium grade awnings are manufactured in Australia. The awning has no fold down leg posts and does not require pegs or ropes.\nThe awning can be set up by just 1 person and will take approx 30 seconds to complete.\nPolyurethane bushes allow the heavy duty aluminium fold out arms to swivel avoiding wear and tear. The awning arms are completely self supporting making for a quick set up. The awning cover is constructed of Polymide ripstop canvas while the roll out awning is made from the same canvas.\nSimply undo the the travel buckles, pull out the swing arms and walk the rolled canvas out to meet the swing arms. A steel locking mechanism locates at each end of the unrolled canvas, and once located to the arms the awning is ready for use.\nWaterproof, \"Dynaproofed\" 380g polycotton ripstop.\nSeams: Double stitched; edged with binding. All seams have been waterproofed.\nStitching: Superior strength quality thread (S25)\nOutrigger frame poles are aluminium\n\nPrice included installation\nFor more information, kindly contact us. Thank you"
    },
    {
        "title": "[Causeway Link] Adventure Waterpark Desaru Coast Johor Malaysia 1 Day Trip for 4/6 persons (Desaru Waterpark)",
        "path": "Causeway-Link-Adventure-Waterpark-Desaru-Coast-Johor-Malaysia-1-Day-Trip-for-46-persons-Desaru-Waterpark-i.800562399.20831155327",
        "image": "https://down-sg.img.susercontent.com/file/e144c3d641c1bd270d93b1364f73a383",
        "price": 36600000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "𝐀𝐝𝐯𝐞𝐧𝐭𝐮𝐫𝐞 𝐖𝐚𝐭𝐞𝐫𝐩𝐚𝐫𝐤 𝐃𝐞𝐬𝐚𝐫𝐮 𝐂𝐨𝐚𝐬𝐭 𝟏 𝐃𝐚𝐲 𝐓𝐫𝐢𝐩\nITINERARY OF Desaru Coast 1 Day Trip\n7:00am  Pick up from Singapore and transfer to Desaru Coast\n10:00 am Arrive & enjoy at Adventure Waterpark Desaru Coast\n4:00 pm         Transfer back to Johor Bahru for Dinner.\n6:00 pm         Dinner at Johor Bahru Restaurant (Own expenses).\n8:00pm          Transfer back to Singapore\n10:00 pm Arrived at Singapore, Tour End.\n\n✅𝐏𝐀𝐂𝐊𝐀𝐆𝐄 𝐈𝐍𝐂𝐋𝐔𝐃𝐄𝐒✅\n- Private Transfer between Singapore and Desaru\n- Adventure Waterpark Tickets\n\n❌𝐏𝐀𝐂𝐊𝐀𝐆𝐄 𝐄𝐗𝐂𝐋𝐔𝐃𝐄𝐒❌\n- All meals\n- Visa application fee (if any)\n- Travel insurance\n- Own expenses\n- Additional Stopping point\n\n📝𝐍𝐎𝐓𝐄𝐒📝\n- Departure from Singapore, after purchased please chat or email us.\n- Pick up time: 6am\n- Only available on Thursday - Sunday\n- All packages are subject to availability. Causeway Link will confirm the booking within 3 working days.\n- If guest is unable to attend the departure time of the transportation service provider, the guest will need to bear the responsibility to rearrange their own transport to follow the itinerary of the planned trip.\n- All our products are non-exchangeable. Refund will be available in voucher mode.\n- Causeway Link reserve the right to cancel, change or refund all purchase made. Any decision made by Causeway Link in this regards is considered final and binding."
    },
    {
        "title": "Adventure Waterpark Desaru Coast Johor Malaysia Attractions Tickets Vouchers Travel Family Outing Kids Friendly Discount",
        "path": "Adventure-Waterpark-Desaru-Coast-Johor-Malaysia-Attractions-Tickets-Vouchers-Travel-Family-Outing-Kids-Friendly-Discount-i.408840252.21952373379",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-c1ecse91qnlv21",
        "price": 2590000,
        "location": "SG",
        "rating": 4.5,
        "sold": 11,
        "description": "Adventure Waterpark Desaru Coast - Johor\nAdventure Waterpark is one of the biggest waterparks in the world. Set against the backdrop of a traditional Malaysian fishing village, Adventure Waterpark is home to unique rides including the first-ever water coaster in the region and one of the biggest wave pools in the world!\n\nTicket(s) Inclusion:\n- 1 Day Entry Ticket to Adventure Waterpark Desaru Coast (Kids Ahoy, Tidal Wave Beach, Swinging Ship, The Super Twister, Riptide, Penawar Falls, Wild Whirl, Kraken’s Revenge, The Tempest, Penawar River, The Surf Wall)\n\nHow To Buy:\n1. Select ticket and checkout\n2. Receive confirmation of your order via email\n3. Head over to our live chat and provide your email, desired date and timeslot (due to capacity limit)\n4. We will process your order\n5. A booking confirmation and e-ticket will be sent to your email (please check your spam folder)\n6. Have fun and enjoy your day!\n\nImportant Note:\n- Guests are required to make a booking reservation before heading down to the attraction.\n- All attractions reserve the right to alter their opening hours on selected dates, ticket packages, rates and governing terms and conditions without prior notice. Please refer to attractions' official website for more updated information.\n- Please also visit attractions' official website for any updates of operation hours and latest updates on COVID-19 regulations.\n- Cancellations, refunds, or changes are subjected to individual ticket conditions. Please contact us regarding this matters.\n- Please present either mobile or printed voucher along with your IC / passport for entry.\n- Adult: 12 - 59 years OR over 121cm in height\n- Child: 3 - 11 years OR up to 121cm in height (free entry for child below 3 years old)\n- Senior: 60 years and above\n- Below 18 years old must be accompanied by fully vaccinated parents.\n- For your comfort and safety, all visitors are required to comply with appropriate Dress Code when swimming or using the rides in the waterpark.\n- Operating Hours (Thursday-Sunday): 10am - 6pm (last admission 5pm)\n\nFollow us for our next promotions, discounts, lowest prices, best deals, cheap, open dated e-tickets, activities and attractions."
    },
    {
        "title": "60L Backpack Waterproof Outdoor Hiking Large Travel Backpack Adventure Sport Camping Travel Backpacker Luggage Bag Cabin",
        "path": "60L-Backpack-Waterproof-Outdoor-Hiking-Large-Travel-Backpack-Adventure-Sport-Camping-Travel-Backpacker-Luggage-Bag-Cabin-i.208819896.23245265798",
        "image": "https://down-sg.img.susercontent.com/file/my-11134207-7qul0-lh8ituux2ody2a",
        "price": 8521000,
        "location": "Malaysia",
        "rating": 0,
        "sold": 0,
        "description": "✅ We are Preferred+ Seller, top-performing among Preferred Sellers.\n✅ This product will be protected by a box, bubble wrap & fragile label (No additional fee) [Depends On Product type] to ensure shipment arrive safely.\n\n✅ Manufacturer defects?\n✅ Sent wrong?\nAll products will be QC BEFORE SHIP OUT. However, if you still find any problem, please LIVE CHAT us immediately! We will guide you on the following step.\n\n⦿ Order made BEFORE 11.59pm, ship out next day. (Exclude Weekends & Public Holidays). \n\nFeatures:\n- Ideal for various activities such as Climbing, Hiking, Holidays, Traveling and so much more\n- Nano Waterproof Fabric and comes with Rain Cover\n- Multiple Storage Compartment to keep your things\n- Anti-Scratch and Durable Materials, suitable for daily use\n- Light Reflective Straps, provides strong protection at night or somewhere dark, safeguard you from dangerous vehicles and able to enjoy a safe night adventure\n\nSpecification:\n-Brand: Nevo Rhino\n- Material: Water Resistant Polyester Fabric\n- Colour: Turquoise\n- Size: 34cm x 26cm x 78cm\n- Bag Capacity: 60L\n- Product Weight: 1.64kg\n\n\n\nNotices: \n1️⃣ Please allow 1-3 cm measuring deviation due to manual measurement.\n2️⃣ The picture is of actual products but minor color difference maybe exist due to different light and monitor setting.\n3️⃣ Goods sold are not returnable, exchangeable or refundable.\nThanks for your understanding.\n\n\n\n\n\nHello! Nice to meet you! Welcome to our shop!\nCheck out our shop daily for the latest products\nWe are an ethical business where prices are always affordable and reasonable\nNo worries! You are guaranteed to be satisfied with the quality of our products\nIt is checked rigorously multiple times before it reaches you\nFeel free to contact us if you have any questions\nHave a nice day and don’t forget to give us 5 stars if you enjoy your product\nThank you for visiting! Hope you have an outstanding shopping experience!\n\n\nHello! Nice to meet you! Welcome to our shop!\nCheck out our shop daily for the latest products\nWe are an ethical business where prices are always affordable and reasonable\nNo worries! You are guaranteed to be satisfied with the quality of our products\nIt is checked rigorously multiple times before it reaches you\nFeel free to contact us if you have any questions\nHave a nice day and don’t forget to give us 5 stars if you enjoy your product\nThank you for visiting! Hope you have an outstanding shopping experience!"
    },
    {
        "title": "Portable And Easy To Clean Luggage For Any Adventure Carrier Travel Bag Bags Multiple Pockets Stylish Expandable",
        "path": "Portable-And-Easy-To-Clean-Luggage-For-Any-Adventure-Carrier-Travel-Bag-Bags-Multiple-Pockets-Stylish-Expandable-i.42535292.23746685121",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lik75ow4ilwz81",
        "price": 5107000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nTravel Bag: Large capacity and expandable make it for travel. Multiple pockets allow for easy organization of all your essentials.\nLuggage Carrier: Durable and portable, this luggage carrier is convenient to carry and easy to clean. for stylish and convenient travel.\nMultiple Pockets: With multiple pockets and compartments, this travel bag is for keeping all your essentials organized.\nWaterproof and Durable: Made with , waterproof materials and reinforced seams, this travel bag is  to last. for all your travel needs.\nUSB Port : Featuring a side USB charging port extension, this travel bag allows you to charge your phone on-the-go. for all your travel, school, work, and leisure needs.\nSpecification:\nColor: multi-color.\nMaterial: Cloth.\nSize: Approx 46*30*14CM/18.11*11.81*0.00inch.\n\nNote:\nThere might be a bit color distortions due to different computer resolutions.\nThere might be a slight errors due to different hand measurement.\nPackage Includes:\nA Bag 1"
    },
    {
        "title": "[sgstock] Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Children, Kid - [",
        "path": "sgstock-Everything-Everywhere-A-Fact-Filled-Adventure-for-Curious-Globe-Trotters-Travel-Book-for-Children-Kid-i.645219716.23767833374",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qves-lgqn4cn9b1fref",
        "price": 4206000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Children, Kid - [Hardcover]\n*************************\n*************************\nWelcome and enjoy you shopping here\n➕  Only brand new items\n➕  All products are authentic\n➕  Super fast shipment\n\nLike what you see? Feel free to check out my other listings or DM if u have any product enquiry or products not listed.\n⭕  Commited to give the best possible service on Shopee\n*************************\n*************************\n\n\"A swarm of facts and images.\" -\nKirkus Reviews\n\"An explosion of facts and illustrations.\" —\nAfar\n\"From beautiful skylines to unique animals, there are surprises at every turn.\" —\nBrightly\n\"An ebullient outing for armchair travelers.\" —\nPublishers Weekly\n - [Hardcover]"
    },
    {
        "title": "50 PCS Camping Landscape Stickers Outdoor Adventure Climbing Travel Waterproof Sticker to DIY Suitcase Laptop Bicycle Helmet Car",
        "path": "50-PCS-Camping-Landscape-Stickers-Outdoor-Adventure-Climbing-Travel-Waterproof-Sticker-to-DIY-Suitcase-Laptop-Bicycle-Helmet-Car-i.876484752.10098187787",
        "image": "https://down-sg.img.susercontent.com/file/5be8bb06bb865ca8d6bcc20f2a1bdde0",
        "price": 270000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "❤ 50 PCS mixed not repeated stickers ❤\n❤ You can see what you can get ❤\n❤Package including: 50 PCS Wilderness Adventure Camping Travel Stickers❤\n❤If you buy more than 1 pack, there will be duplication❤\n🌟 Material: High Quality PVC\n🌟 Features: No-duplicate Waterproof Sun-protection Tear off easily\n🌟 Size :3-10CM (1.2-3.93in)\n🌟 Color: Colorful\n🌟 Packing:50 Pcs/pack ,Opp Bag\nStyle:Outdoor Exploration Travel Climbing Camping Scenery Adventure Trip\nSticker Patterns: Picnic Bonfire Tent Mountaineering Expedition\nUse: Scrapbooking Laptops Skateboards Luggage Cars Bumper Bikes Bicycle Bedroom Travel Case Bicycle Motorcycle Snowboard Guitar Refrigerator\nSuitable for: Men Women Child Teenager Gift for Children\n\n📣 Please note:\n2️⃣ .Due to the shooting condition and hardware devices such as monitor's brigthness and contrast setting etc,there may be some differences between the actual items and the color tone of pictures show.\n🎉🎉🎉 If you like our products, please don't forget FOLLOW us. We have new products every day.✨ If you have any questions, please contact us. Have a nice day.😊"
    },
    {
        "title": "Phuket Rock Beach Swing Thailand Outdoor Scenic Ocean View Adventure Attractions Tickets Vouchers Travel Discount Sale",
        "path": "Phuket-Rock-Beach-Swing-Thailand-Outdoor-Scenic-Ocean-View-Adventure-Attractions-Tickets-Vouchers-Travel-Discount-Sale-i.767436339.20889707508",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvco-li2fph1ze3lm5d",
        "price": 1190000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Rock Beach Swing - Phuket, Thailand\nA swing located on a rocky beach in Phuket, added element of thrill and adventure due to its location and the scenic beauty of the surrounding rocky coastline! Enjoy the contrasting landscape of jagged cliffs and boulders against the turquoise waters while swinging gently or soaring through the air on the beach swing.\n\nTicket(s) Inclusion:\n- Admission to Rock Beach Swing\n- Round-Trip shuttle service from venue parking area to the site of Phuket Rock Beach Swing\n\nHow To Buy:\n1. Select ticket and checkout\n2. Receive confirmation of your order via email\n3. Head over to our live chat and provide your email, desired date and timeslot (due to capacity limit)\n4. We will process your order\n5. A booking confirmation and e-ticket will be sent to your email (please check your spam folder)\n6. Have fun and enjoy your day!\n\nImportant Note:\n- Guests are required to make a booking reservation before heading down to the attraction.\n- All attractions reserve the right to alter their opening hours on selected dates, ticket packages, rates and governing terms and conditions without prior notice. Please refer to attractions' official website for more updated information.\n- Please also visit attractions' official website for any updates of operation hours and latest updates on regulations.\n- Cancellations, refunds, or changes are subjected to individual ticket conditions. Please contact us regarding this matters.\n- Tickets are not applicable for Thai resident.\n- Open Daily (except Wednesday): 9.30am - 6.30pm\n- Child: 5 years old and below\n\nFollow us for our next promotions, discounts, lowest prices, best deals, cheap, open dated e-tickets, activities and attractions."
    },
    {
        "title": "Road Crazy Travel Safety Accessories 45mm Portable Handheld Mini Precision Compass Outdoor Camping Adventure Survival Pointing Tool",
        "path": "Road-Crazy-Travel-Safety-Accessories-45mm-Portable-Handheld-Mini-Precision-Compass-Outdoor-Camping-Adventure-Survival-Pointing-Tool-i.127249066.23207098450",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-y139y1qsd1jv83",
        "price": 164000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Hi Dear ! Welcome to our shop!\nGlad to Visit and Click to \"Follow\" Our Shop， Will Enjoy More Voucher Discount。\n----------------------------------------------------------------------------------------------------------\n★★★Pls Enjoy Our Best service:★★★\n★Fast shipping\n1:Shipment Time：24Hours\n2:Arrived Time： 7-15 days (Southeast Asia）\n15-25 days（Latin America ， Europe）\n\n★ Buyer protection\n1:Fully refund if you don't receive your order\n2:Fully or partially refund,if the item is not as described\n--------------------------------------------------------------------------------------------------------------\n\n★★★Product description★★★:\nSuitable for camping, hiking, climbing and traveling.\nWith a compact design, it is the most important tool in our daily life.\n\nSpecification\nMaterial: ABS, acrylic\nCategory: Compass\nColour: Black\nSize: about 45 mm in diameter\nApplicable: camping, travel, mountain climbing, etc.\nPackage includes: 1* Compass\n\n \n★ Note: Please note that due to lighting effects, brightness/contrast settings of the display, etc., the color of the website photos and actual items may vary slightly.\n★ Dimensions are measured by hand. Please allow 1-3cm size error due to different manual measurement.\n★ Please refer to the actual product,Thank you"
    },
    {
        "title": "1/2/3 Waterproof And Portable Backpack For Outdoor Adventures Travel Travel Backpack Wear-resistant",
        "path": "123-Waterproof-And-Portable-Backpack-For-Outdoor-Adventures-Travel-Travel-Backpack-Wear-resistant-i.33675962.22150398938",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qven-lk20cic16f6z64",
        "price": 1176000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nLarge Capacity: This backpack provides ample storage space for your camping and hiking essentials, allowing you to easily organize and carry all your gear.\nWaterproof and Tear-resistant: Crafted with waterproof and tear-resistant materials, this travel backpack ensures your belongings stay dry and secure in any weather conditions.\nEasy Storage: Featuring a foldable , this backpack can be conveniently folded into a compact size for easy storage.\nBreathable Fabric and Mesh : The breathable fabric and mesh of this backpack provide cool and dry wearing experience, keeping you cool and comfortable during your outdoor adventures.\nSmooth Zipping and Exquisite Craft: The smooth zipping system and exquisite craft of this bag ensure easy and reliable opening and closing, guaranteeing a hassle-free experience.\nSpecification:\nColor: multi-color.\nMaterial: polyester.\nSize: Approx 23*21*3cm/9.06*8.27*1.18inch.\n\nNote:\nThere might be a few color distortions due to different computer resolutions.\nThere might be a slight error due to different hand measurements.\nPackage Includes:\nSports Backpack 1pcs"
    },
    {
        "title": "Adventure Cove Waterpark ACW Sentosa RWS Singapore Water Theme Park Attractions Tickets Vouchers Travel Sale Promotion",
        "path": "Adventure-Cove-Waterpark-ACW-Sentosa-RWS-Singapore-Water-Theme-Park-Attractions-Tickets-Vouchers-Travel-Sale-Promotion-i.408840252.8951354157",
        "image": "https://down-sg.img.susercontent.com/file/340242fd56231b6b1a90607f06557845",
        "price": 2930000,
        "location": "SG",
        "rating": 4.5225225225225225,
        "sold": 0,
        "description": "Adventure Cove Waterpark™ (ACW)\nFrom thrilling water slides full of high-speed twists and turns to mesmerising wonders of a mellower kind up close with our colourful marine life, there’s an experience waiting just for you at Adventure Cove Waterpark.\n\nACW 1-Day Ticket(s) Inclusion:\n- One-Day Admission Ticket to Adventure Cove Waterpark\n\nHow To Buy:\n1. Select ticket and checkout\n2. Receive confirmation of your order via email\n3. Head over to our live chat and provide your email, desired date and timeslot (due to capacity limit)\n4. We will process your order\n5. A booking confirmation and e-ticket will be sent to your email (please check your spam folder)\n6. Have fun and enjoy your day!\n\nImportant Note:\n- Guests are required to make a booking reservation before heading down to the attraction.\n- All attractions reserve the right to alter their opening hours on selected dates, ticket packages, rates and governing terms and conditions without prior notice. Please refer to attractions' official website for more updated information.\n- Please also visit attractions' official website for any updates of operation hours and latest updates on COVID-19 regulations.\n- Cancellations, refunds, or changes are subjected to individual ticket conditions. Please contact us regarding this matters.\n- Adult: 13 years old and above\n- Child: 4 - 12 years old\n- Extension of validity is not permitted.\n\nFollow us for our next promotions, discounts, lowest prices, best deals, cheap, open dated e-tickets, activities and attractions."
    },
    {
        "title": "Premium Quality Backpack Rain Cover with Safety Reflective Strip  Ideal for Travel and Outdoor Adventures (10-70L)",
        "path": "Premium-Quality-Backpack-Rain-Cover-with-Safety-Reflective-Strip-Ideal-for-Travel-and-Outdoor-Adventures-10-70L-i.77514575.19789712115",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve2-lhdv96gacf1r77",
        "price": 255000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Describe:\n* Brand new and high quality\n* Made of high-quality materials, durable and practical\n*Waterproof and durable with safety reflective strips\n\nSpecification:\n*Material: Oxford cloth\n*Color: (As Pictures Show)\n*Size: XS-XL (As Pictures Show)\n\nSize |  XS(10-17L) |  S(18-25L) |  M(26-40L) |  L(41-55L) |  XL(56-70L) |  \nHigh |  25-30CM |  30-40CM |  40-53CM |  53-65CM |  70-75CM |  \nLong |  20-23CM |  20-32CM\n |  20-32CM |  20-35CM\n |  30-35CM |  \nWidth |  15-18CM |  15-20CM |  15-20CM |  19-23CM |  20-23CM |\n\n\n*Weight: about 70g\n\nThe package includes:\n1xBackpack rain cover\n\nNote:\n1. The real color of the item may be slightly different from the pictures shown on website caused by many factors such as brightness of your monitor and light brightness.\n2. Please allow slight manual measurement deviation for the data.\n\n#BackpackRainCover #Foldable #HighQuality #OxfordCloth #Waterproof #WithReflectiveStrips #XS-XL #New"
    },
    {
        "title": "Archaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Lightweight Bird Brand Men Women Mountaineering Travel Folding School Bag[Adventure Traveler]",
        "path": "Archaeopteryx-Backpack-Oxford-Cloth-Waterproof-Sports-Outdoor-Lightweight-Bird-Brand-Men-Women-Mountaineering-Travel-Folding-School-BagAdventure-Traveler-i.1005147801.17494790535",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lha7e9i7l33uaf",
        "price": 2979000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Welcome to Adventure Traveler Store. \n\n***No Rubbish, Only High Quality Products*** \n\n1. Click to follow us, get different COUPONS to save the shipping cost, more gifts and \n\n        discounts are waiting for you!!!\n\n2. We are China seller in Shenzhen city which is near Shenzhen Sorting Center,  all orders \n\n        will be shipped out in 1-3 working day. (You will receive the package in 5-15days）\n\n3. Any question or doubt, feel free to contact us pls. Thanks & have a happy shopping!\n\nProduct details🔥:\n\nArchaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Backpack Lightweight Bird Brand Men And Women Mountaineering Travel Folding Schoolbag\n\nTexture: Oxford Spinning\nApplicable People: General\nPopular Elements: Solid Color\nStyle: Fashion\nClosure: Zipper\nComputer Size: 16 Inches 16inch\nWaterproof Performance: Water Repellent\nLining Material: Polyester (Polyester Fiber)\n\n-------------------------------------------------\n\nShipping\n\n1. All products are shipped From China.\n\n2. Delivery takes 7~12 days.\n\nLooking for the other products\n\n - If you want to purchase other products we don't have, please contact us by chat.\n\nIf you have any questions, please send a message on chat.\n\nWe are trying to reply as soon as possible ^ ^"
    },
    {
        "title": "Aji Brother National Park Adventure Travel Series, Fashion Hand Office, Doll, Gift, Decoration",
        "path": "Aji-Brother-National-Park-Adventure-Travel-Series-Fashion-Hand-Office-Doll-Gift-Decoration-i.547879632.22375417200",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvct-ljnm9bqu3kzp43",
        "price": 2661000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "😊Description:\nAji brother National park adventure travel series Tide play handmade toy gift decoration\n😊Details:\nPlace of import: Asia\nOrigin: Dongguan\nMaterial: PVC\nApplicable age: Youth (15-35 years old)\n\n💖Welcome to our shop!💖\nEvery order can be sent assoon as possible\nShipping instructions:\nHis paid order will be delivered within 48 hours.If the order is out of stock,we will contact you to confirm the delivery time\n💕If you are satisfied with the product.please aive us a good evaluation.Thank you for your support and help!\n😊 # Aji brother National park adventure travel series# fashion play hand office# doll# Gift# ornaments"
    },
    {
        "title": "Cheapest discounted IMG Worlds of Adventure Ticket",
        "path": "Cheapest-discounted-IMG-Worlds-of-Adventure-Ticket-i.78525603.18960942423",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e7714a1a7mjv44",
        "price": 6899000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "IMG Worlds of Adventure Ticket\nOne of the world's largest indoor theme parks covering an area in excess of 1.5 million square feet\nRamp up the thrills riding roller coasters and rides based on iconic Marvel superheroes and Cartoon Network superstars\nStep back in time with a prehistoric dinosaur experience at the Lost Valley Adventure Zone\n\nInclusive Of\n1 Day Attraction Pass to IMG Worlds Of Adventure ticket(s) - Fixed date booking\nUnlimited Rides\n\nAdditional Information\nFor safety purposes, each ride has a height restriction\nFree admission for children who are under 1.05m in height\n\nOpening Hours\nMonday-Thursday: 12:00-22:00\nFriday-Sunday: 12:00-23:00\nHow to Redeem\nEnter the venue directly with your voucher\n\nPlease share your Date of visit, email address via Shopee chat/email (Subject to availability)\n- Voucher is non-refundable & no cancellation allowed\n\nAddress\nIMG Worlds Of Adventure\nE311, Sheikh Mohammed Bin Zayed Road\n\n#Dubai\n#unitedarabemirates\n#imgworld\n#img\n#dubaiattractions"
    },
    {
        "title": "new men commuter business backpack USB rechargeable backpack waterproof computer bag fashion luggage backpack simple travel bag[Adventure Traveler]",
        "path": "new-men-commuter-business-backpack-USB-rechargeable-backpack-waterproof-computer-bag-fashion-luggage-backpack-simple-travel-bagAdventure-Traveler-i.1005147801.17897611987",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfi-lhcrfhotdgdfed",
        "price": 2308000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Welcome to Adventure Traveler Store. \n\n***No Rubbish, Only High Quality Products*** \n\n1. Click to follow us, get different COUPONS to save the shipping cost, more gifts and \n\n        discounts are waiting for you!!!\n\n2. We are China seller in Shenzhen city which is near Shenzhen Sorting Center,  all orders \n\n        will be shipped out in 1-3 working day. (You will receive the package in 5-15days）\n\n3. Any question or doubt, feel free to contact us pls. Thanks & have a happy shopping!\n\nProduct details🔥:\n\nLuggage size: Medium\nCapacity: 20LThe following\nPackage internal structure: Zip pocket,Cell phone pocket,Certificate bag,Computer Socket\nOpening method: Zipper\nHardness: Medium\nLin texture: Polyester\nType of accessories: Fastener\nNumber of shoulder straps: Double root\nPopular elements: Suture\nCarrying parts: Soft Hover\nType of outer bag: Inner patch pocket\nLuggage shape: Vertical square\nWhether or not there is a pull rod: No\nBackpack system: Air Cushion Strap\nWaterproof degree: Fully waterproof\n\n-------------------------------------------------\n\nShipping\n\n1. All products are shipped From China.\n\n2. Delivery takes 7~12 days.\n\nLooking for the other products\n\n - If you want to purchase other products we don't have, please contact us by chat.\n\nIf you have any questions, please send a message on chat.\n\nWe are trying to reply as soon as possible ^ ^"
    },
    {
        "title": "1 Durable And Lightweight Backpack For Travel And Outdoor Adventure - Large Capacity And Adjustable Breathable Folding Bag",
        "path": "1-Durable-And-Lightweight-Backpack-For-Travel-And-Outdoor-Adventure-Large-Capacity-And-Adjustable-Breathable-Folding-Bag-i.36503201.23249830478",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdl-ljss6p4cdt023a",
        "price": 1449000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nWaterproof and Lightweight: This foldable backpack is made of tear-resistant and can keep your belongings dry in rainy days.\nDurable and Adjustable: The backpack is designed with materials and adjustable straps, providing long-lasting performance and a comfortable fit.\nLarge-capacity and Multi-functional: With multiple compartments and pockets, this backpack is for hiking, camping, and other outdoor activities, offering plenty of storage space and organization options.\nBreathable and Easy-to-clean: The breathable back panel and shoulder straps provide added comfort during long trips, and the backpack is easy to clean after use, making it a choice for outdoor adventures.\nShock-proof and UV-resistant: The backpack is made with shock-proof technology to protect fragile items, and the UV-resistant keeps the colors from fading under the sun, ensuring a long-lasting and vibrant appearance.\n\nSpecification:\nColor: multi-color.\nMaterial: polyester.\nSize: Approx 41*24*16 cm/16.14*9.45*6.30inch.\n\nNote:\nThere might be a bit color distortions due to different computer resolutions.\nThere might be a slight errors due to different hand measurement.\nPackage Includes:\nBackpack1 Piece"
    },
    {
        "title": "Hannibal Safari Legless Awning 2.4m for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Hannibal-Safari-Legless-Awning-24m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.21180005011",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvg6-lh2vjcutuyvbf0",
        "price": 169900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Hannibal awning sets up in 30 seconds!!! They have no posts, pegs or ropes to trip over or bump into. It basically supports off the roof rack. Awnings provide shade, comfort, and protection against the elements when camping. Speed and ease of setup is of paramount importance to enable usage while en-route, e.g. for a quick stop at lunchtime. Special importance has been given to the design of the structure to ensure strong mounting to guarantee that the awning stays stable when the wind blows. \n\nHannibals premium grade awnings are manufactured in Australia. The awning has no fold down leg posts and does not require pegs or ropes.\nThe awning can be set up by just 1 person and will take approx 30 seconds to complete.\nPolyurethane bushes allow the heavy duty aluminium fold out arms to swivel avoiding wear and tear. The awning arms are completely self supporting making for a quick set up. The awning cover is constructed of Polymide ripstop canvas while the roll out awning is made from the same canvas.\nSimply undo the the travel buckles, pull out the swing arms and walk the rolled canvas out to meet the swing arms. A steel locking mechanism locates at each end of the unrolled canvas, and once located to the arms the awning is ready for use.\nWaterproof, \"Dynaproofed\" 380g polycotton ripstop.\nSeams: Double stitched; edged with binding. All seams have been waterproofed.\nStitching: Superior strength quality thread (S25)\nOutrigger frame poles are aluminium\n\nPrice included installation\nFor more information, kindly contact us. Thank you"
    },
    {
        "title": "Portable And Easy To Clean Luggage For Any Adventure Carrier Travel Bag Bags Multiple Pockets Stylish Expandable",
        "path": "Portable-And-Easy-To-Clean-Luggage-For-Any-Adventure-Carrier-Travel-Bag-Bags-Multiple-Pockets-Stylish-Expandable-i.42535292.23746685121",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lik75ow4ilwz81",
        "price": 5107000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nTravel Bag: Large capacity and expandable make it for travel. Multiple pockets allow for easy organization of all your essentials.\nLuggage Carrier: Durable and portable, this luggage carrier is convenient to carry and easy to clean. for stylish and convenient travel.\nMultiple Pockets: With multiple pockets and compartments, this travel bag is for keeping all your essentials organized.\nWaterproof and Durable: Made with , waterproof materials and reinforced seams, this travel bag is  to last. for all your travel needs.\nUSB Port : Featuring a side USB charging port extension, this travel bag allows you to charge your phone on-the-go. for all your travel, school, work, and leisure needs.\nSpecification:\nColor: multi-color.\nMaterial: Cloth.\nSize: Approx 46*30*14CM/18.11*11.81*0.00inch.\n\nNote:\nThere might be a bit color distortions due to different computer resolutions.\nThere might be a slight errors due to different hand measurement.\nPackage Includes:\nA Bag 1"
    },
    {
        "title": "SL| Kids Visor Hat with Fan Protection Wide Brim for Outdoor Adventures Summer Hiking Travel and Screen Accessories",
        "path": "SL-Kids-Visor-Hat-with-Fan-Protection-Wide-Brim-for-Outdoor-Adventures-Summer-Hiking-Travel-and-Screen-Accessories-i.134972426.16897916621",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lie58o1t7wq7a5",
        "price": 1151000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description: \n\nOur kids visor hat, a must-have for your little ones!\n\nThis hat is the epitome of comfort and functionality, making it perfect for all their outdoor adventures.\n\nNot only does this visor hat protect your child from the harsh rays, but it also keeps them cool with its unique small fan design.\n\nSay goodbye to sweaty foreheads and hello to a refreshing breeze!\n\n.\n\nThis hat is not only practical but also incredibly convenient.\n\nIt is lightweight and portable, easily rolling into a compact size that can fit into any purse, backpack, or handbag.\n\nNo more worrying about bulky accessories weighing you down.\n\nThe wide brim of this visor hat provides excellent uv protection, ensuring your child's delicate skin is shielded from harmful rays.\n\nThe breathable and open-top design keeps their head cool even in scorching hot weather, guaranteeing maximum comfort.\n\nPerfect for any outdoor activity, this dual-function hat offers the best of both worlds  a fan and a hat.\n\nAdjust the three-speed to your child's liking, allowing them to customize their comfort according to their needs.\n\nTo make life even easier, this fan hat comes with a usb charging function, ensuring that it can be easily charged anytime, anywhere.\n\nNo more fussing over batteries or finding a power source.\n\nConvenience at its finest.\n\nWith an adjustable head circumference of 46-52cm, this visor hat comfortably fits both children and adults.\n\nIt's perfect for family trips or even when your child wants to share their stylish accessory with you.\n\nCarrying and using this hat is a breeze.\n\nIt is designed to be user-friendly, making it the ideal accessory for outdoor travel, beach visits, mountain climbing, cycling, hiking, and any other adventure your child embarks on.\n\nUpgrade your child's outdoor experience with our kids visor hat.\n\nComfort, style, and functionality all rolled into one amazing product.\n\nDon't miss out on this must-have accessory for your little ones!\nItem Name: Kids Visor Hat\nMaterial: Polyester\nUsage: Sun Protection\nFeatures: with Fan, Adjustable, Wide Brim \nSize Detail: \nHat Circumference: 46cm-52cm/18.11\"-20.47\" (Approx.)\nBrim Width: 13.5cm/5.31\" (Approx.)\n\n\nNotes: \nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.Please allow slight dimension difference due to different manual measurement.\n\nPackage Includes: \n1 x Kids Visor Hat\n1 x USB Charging Cable"
    },
    {
        "title": "[sgstock] Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Children, Kid - [",
        "path": "sgstock-Everything-Everywhere-A-Fact-Filled-Adventure-for-Curious-Globe-Trotters-Travel-Book-for-Children-Kid-i.645219716.23767833374",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qves-lgqn4cn9b1fref",
        "price": 4206000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Children, Kid - [Hardcover]\n*************************\n*************************\nWelcome and enjoy you shopping here\n➕  Only brand new items\n➕  All products are authentic\n➕  Super fast shipment\n\nLike what you see? Feel free to check out my other listings or DM if u have any product enquiry or products not listed.\n⭕  Commited to give the best possible service on Shopee\n*************************\n*************************\n\n\"A swarm of facts and images.\" -\nKirkus Reviews\n\"An explosion of facts and illustrations.\" —\nAfar\n\"From beautiful skylines to unique animals, there are surprises at every turn.\" —\nBrightly\n\"An ebullient outing for armchair travelers.\" —\nPublishers Weekly\n - [Hardcover]"
    },
    {
        "title": "GP1 JoJo's Bizarre Adventure Women Men Backpack Cartoon Student School Bag Computer Outdoors Travel Bag Large Capacity ",
        "path": "GP1-JoJos-Bizarre-Adventure-Women-Men-Backpack-Cartoon-Student-School-Bag-Computer-Outdoors-Travel-Bag-Large-Capacity-i.368313731.22274412420",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfv-ljg4izpeg5c688",
        "price": 3116000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Brand new and high quality！！！\n☞☞☞Product information☜☜☜\n\nSize：48*21*34cm\nMaterial: Oxford spinning\nOpening method: flip cover + zipper\nApplicable gender: unisex / both men and women\nCapacity: 20-35L\nFunction: breathable, reduce burden\nPattern: Anime cartoon\n\nNote:\n1. The picture only shows the sample, due to the light, environment, camera, various effects, the picture is slightly different from the real thing.\n2. Manual measurement will have an error of 1-2cm, please understand.\n3. Due to long-distance transportation, if the package you received is slightly damaged, please contact us to resolve it. Please do not give us a bad review, we will compensate you in the form of vouchers.\n\nFeedback:\n1. We appreciate your choosing us and encourage us to do better. Your feedback and evaluation are very important to us.\n2. If you are satisfied with our products or services, please leave us a 5 star rating.\n3. However, if you have any questions or concerns about your order, please do not hesitate to contact us before receiving any feedback, we will do our best to solve the problem for you.\n4. If there are any problems, please contact us first time, don't give a bad comment,thank you for your cooperation, we will always serve you wholeheartedly,wish you a pleasant shopping!\n    greencenturysip.sg"
    },
    {
        "title": "Phuket Rock Beach Swing Thailand Outdoor Scenic Ocean View Adventure Attractions Tickets Vouchers Travel Discount Sale",
        "path": "Phuket-Rock-Beach-Swing-Thailand-Outdoor-Scenic-Ocean-View-Adventure-Attractions-Tickets-Vouchers-Travel-Discount-Sale-i.408840252.23845213296",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvez-li2fph1zfi60a4",
        "price": 1240000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Rock Beach Swing - Phuket, Thailand\nA swing located on a rocky beach in Phuket, added element of thrill and adventure due to its location and the scenic beauty of the surrounding rocky coastline! Enjoy the contrasting landscape of jagged cliffs and boulders against the turquoise waters while swinging gently or soaring through the air on the beach swing.\n\nTicket(s) Inclusion:\n- Admission to Rock Beach Swing\n- Round-Trip shuttle service from venue parking area to the site of Phuket Rock Beach Swing\n\nHow To Buy:\n1. Select ticket and checkout\n2. Receive confirmation of your order via email\n3. Head over to our live chat and provide your email, desired date and timeslot (due to capacity limit)\n4. We will process your order\n5. A booking confirmation and e-ticket will be sent to your email (please check your spam folder)\n6. Have fun and enjoy your day!\n\nImportant Note:\n- Guests are required to make a booking reservation before heading down to the attraction.\n- All attractions reserve the right to alter their opening hours on selected dates, ticket packages, rates and governing terms and conditions without prior notice. Please refer to attractions' official website for more updated information.\n- Please also visit attractions' official website for any updates of operation hours and latest updates on regulations.\n- Cancellations, refunds, or changes are subjected to individual ticket conditions. Please contact us regarding this matters.\n- Tickets are not applicable for Thai resident.\n- Open Daily (except Wednesday): 9.30am - 6.30pm\n- Child: 5 years old and below\n\nFollow us for our next promotions, discounts, lowest prices, best deals, cheap, open dated e-tickets, activities and attractions."
    },
    {
        "title": "1/2/3 Waterproof And Portable Backpack For Outdoor Adventures Travel Travel Backpack Wear-resistant",
        "path": "123-Waterproof-And-Portable-Backpack-For-Outdoor-Adventures-Travel-Travel-Backpack-Wear-resistant-i.33675962.22150398938",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qven-lk20cic16f6z64",
        "price": 1176000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nLarge Capacity: This backpack provides ample storage space for your camping and hiking essentials, allowing you to easily organize and carry all your gear.\nWaterproof and Tear-resistant: Crafted with waterproof and tear-resistant materials, this travel backpack ensures your belongings stay dry and secure in any weather conditions.\nEasy Storage: Featuring a foldable , this backpack can be conveniently folded into a compact size for easy storage.\nBreathable Fabric and Mesh : The breathable fabric and mesh of this backpack provide cool and dry wearing experience, keeping you cool and comfortable during your outdoor adventures.\nSmooth Zipping and Exquisite Craft: The smooth zipping system and exquisite craft of this bag ensure easy and reliable opening and closing, guaranteeing a hassle-free experience.\nSpecification:\nColor: multi-color.\nMaterial: polyester.\nSize: Approx 23*21*3cm/9.06*8.27*1.18inch.\n\nNote:\nThere might be a few color distortions due to different computer resolutions.\nThere might be a slight error due to different hand measurements.\nPackage Includes:\nSports Backpack 1pcs"
    },
    {
        "title": "Premium Quality Backpack Rain Cover with Safety Reflective Strip  Ideal for Travel and Outdoor Adventures (10-70L)",
        "path": "Premium-Quality-Backpack-Rain-Cover-with-Safety-Reflective-Strip-Ideal-for-Travel-and-Outdoor-Adventures-10-70L-i.77514575.19789712115",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve2-lhdv96gacf1r77",
        "price": 255000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Describe:\n* Brand new and high quality\n* Made of high-quality materials, durable and practical\n*Waterproof and durable with safety reflective strips\n\nSpecification:\n*Material: Oxford cloth\n*Color: (As Pictures Show)\n*Size: XS-XL (As Pictures Show)\n\nSize |  XS(10-17L) |  S(18-25L) |  M(26-40L) |  L(41-55L) |  XL(56-70L) |  \nHigh |  25-30CM |  30-40CM |  40-53CM |  53-65CM |  70-75CM |  \nLong |  20-23CM |  20-32CM\n |  20-32CM |  20-35CM\n |  30-35CM |  \nWidth |  15-18CM |  15-20CM |  15-20CM |  19-23CM |  20-23CM |\n\n\n*Weight: about 70g\n\nThe package includes:\n1xBackpack rain cover\n\nNote:\n1. The real color of the item may be slightly different from the pictures shown on website caused by many factors such as brightness of your monitor and light brightness.\n2. Please allow slight manual measurement deviation for the data.\n\n#BackpackRainCover #Foldable #HighQuality #OxfordCloth #Waterproof #WithReflectiveStrips #XS-XL #New"
    },
    {
        "title": "Archaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Lightweight Bird Brand Men Women Mountaineering Travel Folding School Bag[Adventure Traveler]",
        "path": "Archaeopteryx-Backpack-Oxford-Cloth-Waterproof-Sports-Outdoor-Lightweight-Bird-Brand-Men-Women-Mountaineering-Travel-Folding-School-BagAdventure-Traveler-i.1005147801.17494790535",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lha7e9i7l33uaf",
        "price": 2979000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Welcome to Adventure Traveler Store. \n\n***No Rubbish, Only High Quality Products*** \n\n1. Click to follow us, get different COUPONS to save the shipping cost, more gifts and \n\n        discounts are waiting for you!!!\n\n2. We are China seller in Shenzhen city which is near Shenzhen Sorting Center,  all orders \n\n        will be shipped out in 1-3 working day. (You will receive the package in 5-15days）\n\n3. Any question or doubt, feel free to contact us pls. Thanks & have a happy shopping!\n\nProduct details🔥:\n\nArchaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Backpack Lightweight Bird Brand Men And Women Mountaineering Travel Folding Schoolbag\n\nTexture: Oxford Spinning\nApplicable People: General\nPopular Elements: Solid Color\nStyle: Fashion\nClosure: Zipper\nComputer Size: 16 Inches 16inch\nWaterproof Performance: Water Repellent\nLining Material: Polyester (Polyester Fiber)\n\n-------------------------------------------------\n\nShipping\n\n1. All products are shipped From China.\n\n2. Delivery takes 7~12 days.\n\nLooking for the other products\n\n - If you want to purchase other products we don't have, please contact us by chat.\n\nIf you have any questions, please send a message on chat.\n\nWe are trying to reply as soon as possible ^ ^"
    },
    {
        "title": "JOYMEMO Global Travel Theme Birthday Party Decor for kids, Adventure Birthday Supplies with Happy Birthday Banner,Plane Bus Car Vehicle Pattern Printed Balloons and Cupcake Toppers",
        "path": "JOYMEMO-Global-Travel-Theme-Birthday-Party-Decor-for-kids-Adventure-Birthday-Supplies-with-Happy-Birthday-BannerPlane-Bus-Car-Vehicle-Pattern-Printed-Balloons-and-Cupcake-Toppers-i.580460816.18879093775",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lfxs0xipm15i99",
        "price": 401000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 2,
        "description": "WHAT YOU WILL GET:\nset 1: 1*happy birthday banner 1*cake toppers 12*cupcake toppers 18*latex balloons\nset 2: 1*happy birthday banner\nset 3: 12*cupcake toppers\nset 4:1*cake toppers \nset 5: 18*latex balloons\nHIGH QUALITY：Our balloons are made of high quality latex, which is safe, durable and non-polluting, and the ingredients are safe for children. Our banners and toppers are made of durable paper, odorless, thick and reusable.\nGLOBAL TRAVEL SET: Become a little traveler. Everyone has a dream of traveling around the world. If there is no way to have a trip without delay, then choosing our global travel set at a birthday party can also be considered a small wish. If this is a surprise party, then the protagonist of this birthday will definitely be full of praise.\nOUTSTANDING DESIGN:This global set fulfills the wishes of anyone who wants to go out but cannot. Balloons and cupcake tops are printed with various patterns of transportation, including airplanes, cars, cruise ships, and travel packages. Blue symbolizes rivers and oceans, while green symbolizes mountains and forests. These two colored decorations are interwoven perfectly with the colors of the map. This set of decorations is definitely worth it!\nENJOY YOUR TIME：You don't need to be a DIY expert or spend hours assembling everything. Because we have selected the whole set decorations that are easy to assemble for you. These around the world party supplies with travel themes and delicate designs are suitable for travel themed birthday parties, baby showers, first birthday, adventure themed party, family reunions, etc., and they will make for an enjoyable party experience for you and your friends.\nBEST AFTER-SALES SERVICE: Customer satisfaction makes our highest pursuit. If you have any questions, please contact us at any time, We will solve them for you within 48h."
    },
    {
        "title": "Cheapest discounted IMG Worlds of Adventure Ticket",
        "path": "Cheapest-discounted-IMG-Worlds-of-Adventure-Ticket-i.78525603.18960942423",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e7714a1a7mjv44",
        "price": 6899000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "IMG Worlds of Adventure Ticket\nOne of the world's largest indoor theme parks covering an area in excess of 1.5 million square feet\nRamp up the thrills riding roller coasters and rides based on iconic Marvel superheroes and Cartoon Network superstars\nStep back in time with a prehistoric dinosaur experience at the Lost Valley Adventure Zone\n\nInclusive Of\n1 Day Attraction Pass to IMG Worlds Of Adventure ticket(s) - Fixed date booking\nUnlimited Rides\n\nAdditional Information\nFor safety purposes, each ride has a height restriction\nFree admission for children who are under 1.05m in height\n\nOpening Hours\nMonday-Thursday: 12:00-22:00\nFriday-Sunday: 12:00-23:00\nHow to Redeem\nEnter the venue directly with your voucher\n\nPlease share your Date of visit, email address via Shopee chat/email (Subject to availability)\n- Voucher is non-refundable & no cancellation allowed\n\nAddress\nIMG Worlds Of Adventure\nE311, Sheikh Mohammed Bin Zayed Road\n\n#Dubai\n#unitedarabemirates\n#imgworld\n#img\n#dubaiattractions"
    },
    {
        "title": "Ridwana.id - Tas Ransel Duffle 3in1 Waterproof For Adventure Backpack Travel Latest Casual Style",
        "path": "Ridwanaid-Tas-Ransel-Duffle-3in1-Waterproof-For-Adventure-Backpack-Travel-Latest-Casual-Style-i.358942541.22975230280",
        "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul5-ljrxy267juoy54",
        "price": 1674000,
        "location": "Indonesia",
        "rating": 0,
        "sold": 0,
        "description": "Material: Bimo\nColor: Ashes\nSize Dimension:\n- Length: 26 cm.\n- Width: 25 cm\n- Height: 44 cm"
    },
    {
        "title": "1 Durable And Lightweight Backpack For Travel And Outdoor Adventure - Large Capacity And Adjustable Breathable Folding Bag",
        "path": "1-Durable-And-Lightweight-Backpack-For-Travel-And-Outdoor-Adventure-Large-Capacity-And-Adjustable-Breathable-Folding-Bag-i.36503201.23249830478",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdl-ljss6p4cdt023a",
        "price": 1449000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nWaterproof and Lightweight: This foldable backpack is made of tear-resistant and can keep your belongings dry in rainy days.\nDurable and Adjustable: The backpack is designed with materials and adjustable straps, providing long-lasting performance and a comfortable fit.\nLarge-capacity and Multi-functional: With multiple compartments and pockets, this backpack is for hiking, camping, and other outdoor activities, offering plenty of storage space and organization options.\nBreathable and Easy-to-clean: The breathable back panel and shoulder straps provide added comfort during long trips, and the backpack is easy to clean after use, making it a choice for outdoor adventures.\nShock-proof and UV-resistant: The backpack is made with shock-proof technology to protect fragile items, and the UV-resistant keeps the colors from fading under the sun, ensuring a long-lasting and vibrant appearance.\n\nSpecification:\nColor: multi-color.\nMaterial: polyester.\nSize: Approx 41*24*16 cm/16.14*9.45*6.30inch.\n\nNote:\nThere might be a bit color distortions due to different computer resolutions.\nThere might be a slight errors due to different hand measurement.\nPackage Includes:\nBackpack1 Piece"
    },
    {
        "title": "[In Stock] Water Resistance Hiking Backpack Adventure 30L Rucksack for Outdoor Travel",
        "path": "In-Stock-Water-Resistance-Hiking-Backpack-Adventure-30L-Rucksack-for-Outdoor-Travel-i.13034017.18890606913",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvey-lj0ucp8acohye0",
        "price": 1200000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nBackpack is made from highly durable, Oxford cloth material abrasion-resistant ,scratch-resistant, waterproof, with metal zippers.\nThe stress point of the carrying system is changed from the thickest part of the whole strap to the webbing on the front of the strap and the top position of the front of the backpack. The increased force position on the front helps balance the center of gravity of the entire bag, and also increases the comfort when carrying it.\nMolle System throughout the bag and shoulder strap very convenient for adding additional pouches.\nBackpack is keeping gear organized, easily accessible. helps you keep gear separated.\nWide application: Great for hiking, camping, climbing and other outdoor activities.\nSpecification:\nMaterial: Oxford Cloth\nSize: 43x24x20 cm/16.93x9.45x7.87 inch\nPackage Includes:\n1 Piece Backpack\nNote:\n1. Please allow slightly error due to manual measurement.\n2. Due to the difference between different monitors, the picture may not reflect the actual color of the item.\n3. Wish you a wonderful on-line shopping!"
    },
    {
        "title": "Hannibal Safari Legless Awning 1.9m for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Hannibal-Safari-Legless-Awning-19m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.23568536202",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvew-lh2vjcutny139f",
        "price": 129900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Hannibal awning sets up in 30 seconds!!! They have no posts, pegs or ropes to trip over or bump into. It basically supports off the roof rack. Awnings provide shade, comfort, and protection against the elements when camping. Speed and ease of setup is of paramount importance to enable usage while en-route, e.g. for a quick stop at lunchtime. Special importance has been given to the design of the structure to ensure strong mounting to guarantee that the awning stays stable when the wind blows. \n\nHannibals premium grade awnings are manufactured in Australia. The awning has no fold down leg posts and does not require pegs or ropes.\nThe awning can be set up by just 1 person and will take approx 30 seconds to complete.\nPolyurethane bushes allow the heavy duty aluminium fold out arms to swivel avoiding wear and tear. The awning arms are completely self supporting making for a quick set up. The awning cover is constructed of Polymide ripstop canvas while the roll out awning is made from the same canvas.\nSimply undo the the travel buckles, pull out the swing arms and walk the rolled canvas out to meet the swing arms. A steel locking mechanism locates at each end of the unrolled canvas, and once located to the arms the awning is ready for use.\nWaterproof, \"Dyna proofed\" 380g polycotton ripstop.\nSeams: Double stitched; edged with binding. All seams have been waterproofed.\nStitching: Superior strength quality thread (S25)\nOutrigger frame poles are aluminium\n\nPrice included installation\nFor more information, kindly contact us. Thank you"
    },
    {
        "title": "Road Crazy Travel Safety Accessories 45mm Portable Handheld Mini Precision Compass Outdoor Camping Adventure Survival Pointing Tool",
        "path": "Road-Crazy-Travel-Safety-Accessories-45mm-Portable-Handheld-Mini-Precision-Compass-Outdoor-Camping-Adventure-Survival-Pointing-Tool-i.127249066.23207098450",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-y139y1qsd1jv83",
        "price": 164000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Hi Dear ! Welcome to our shop!\nGlad to Visit and Click to \"Follow\" Our Shop， Will Enjoy More Voucher Discount。\n----------------------------------------------------------------------------------------------------------\n★★★Pls Enjoy Our Best service:★★★\n★Fast shipping\n1:Shipment Time：24Hours\n2:Arrived Time： 7-15 days (Southeast Asia）\n15-25 days（Latin America ， Europe）\n\n★ Buyer protection\n1:Fully refund if you don't receive your order\n2:Fully or partially refund,if the item is not as described\n--------------------------------------------------------------------------------------------------------------\n\n★★★Product description★★★:\nSuitable for camping, hiking, climbing and traveling.\nWith a compact design, it is the most important tool in our daily life.\n\nSpecification\nMaterial: ABS, acrylic\nCategory: Compass\nColour: Black\nSize: about 45 mm in diameter\nApplicable: camping, travel, mountain climbing, etc.\nPackage includes: 1* Compass\n\n \n★ Note: Please note that due to lighting effects, brightness/contrast settings of the display, etc., the color of the website photos and actual items may vary slightly.\n★ Dimensions are measured by hand. Please allow 1-3cm size error due to different manual measurement.\n★ Please refer to the actual product,Thank you"
    },
    {
        "title": "1/2/3 Foldable Outdoor Backpack For Travel And Adventure Travel Backpack Waterproof Camping Hiking",
        "path": "123-Foldable-Outdoor-Backpack-For-Travel-And-Adventure-Travel-Backpack-Waterproof-Camping-Hiking-i.38293403.21582605640",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lk209cejwfx3cb",
        "price": 1176000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description:\nLarge Capacity: This backpack provides ample storage space for your camping and hiking essentials, allowing you to easily organize and carry all your gear.\nWaterproof and Tear-resistant: Crafted with waterproof and tear-resistant materials, this travel backpack ensures your belongings stay dry and secure in any weather conditions.\nEasy Storage: Featuring a foldable , this backpack can be conveniently folded into a compact size for easy storage.\nBreathable Fabric and Mesh : The breathable fabric and mesh of this backpack provide cool and dry wearing experience, keeping you cool and comfortable during your outdoor adventures.\nSmooth Zipping and Exquisite Craft: The smooth zipping system and exquisite craft of this bag ensure easy and reliable opening and closing, guaranteeing a hassle-free experience.\nSpecification:\nColor: multi-color.\nMaterial: polyester.\nSize: Approx 23*21*3cm/9.06*8.27*1.18inch.\n\nNote:\nThere might be a few color distortions due to different computer resolutions.\nThere might be a slight error due to different hand measurements.\nPackage Includes:\nSports Backpack 1pcs"
    },
    {
        "title": "Men's Mountain Bag Backpack Backpack Jumbo Travel Large Carrier Outdoor Hiking Camping Adventure Climber Survival Homecoming Walking Back Sling Cool Boys Aesthetic Import Waterproof 50liter",
        "path": "Mens-Mountain-Bag-Backpack-Backpack-Jumbo-Travel-Large-Carrier-Outdoor-Hiking-Camping-Adventure-Climber-Survival-Homecoming-Walking-Back-Sling-Cool-Boys-Aesthetic-Import-Waterproof-50liter-i.1040626980.20282338924",
        "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul7-licrv99khcwm5d",
        "price": 2862000,
        "location": "Indonesia",
        "rating": 0,
        "sold": 0,
        "description": "*****WELCOME To ZELCROP *****\n\n\nBackpack bags you can use when you climb mountains, hiking, camping, etc. It has very light material, can store enough goods for your purposes. This bag is also effectively carried for adventures because it has waterproof features, you don't have to worry about your luggage getting wet when you go through rivers or water.\n\n👉👉Features:\n✔✔Waterproof:\nThis backpack mountain carrier bag can accompany your journey and secure your camping gear items safely, rainwaterproof or carried through rivers and water.\n\n✔✔Comportable:\nThe back of this bag that adheres directly to your back when worn, using soft and comfortable material. So it can minimize the burden on your body when carrying a lot of stuff through this bag.\n\n✔✔Large Capacity:\nThis backpack mountain bag has a large storage capacity of goods, you can carry a lot of survival gear when you are in the mountains or camping in the wild.\n\n\nFengshang SPECIFICATION 50L\nColor: BLACK\nMaterial: Cordura nylon fabric\nDimensions: 55 x 32 x 22 cm\nOthers: Contents: 50L\n\n\n40l FLAMEHORSE SPECIFICATIONS\nColor: BLACK\nMaterial: Cordura nylon fabric\nDimensions: 30 x 49 x 19 cm\nOthers: Contents: 40L"
    },
    {
        "title": "Large Capacity Roblox Rainbow Friends Backpack Ideal For School Travel And Adventure",
        "path": "Large-Capacity-Roblox-Rainbow-Friends-Backpack-Ideal-For-School-Travel-And-Adventure-i.315440333.22145121837",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134202-23020-i8qeez41v3mve0",
        "price": 1691000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Roblox Rainbow Friends Colourful Backpack Large Capacity Schoolbag Travel Bag \n\nHighlights:\nRoblox\nRainbow Friends\nLarge Capacity\nCartoon Printing\nSchoolbag\nTravel Bag \nCute\nUnisex\n\nDescription:\nThis Roblox Rainbow Friends cute backpack is made of canvas, which is light in weight and not easy to deform. Effectively protect books and other items from being damaged by backpacks.\nLarge capacity and storage space, multiple compartments, and sortable items. Things are cleaner.\nApplicable scenes: schools, tourism and mountaineering, training courses, shopping, zoos, parks, outdoor sports, etc., suitable for men and women\nAs a gift: backpack is the perfect gift for going back to school, birthday or Christmas. They are well made, beautiful in design and affordable. It is the best companion for learning and a must-have for Rainbow Friends fans\n\nFeatures:\nMaterial: Canvas\nOpening Method: Zip\nOccasion: Travel, School, Picnic,Etc.\nFunction: Breathable, Wear-Resistant, Load-Reducing\nAdvantages: Wear Resistant, Lightweight,Big Capacity\nProduct Size：42x29x11cm/16.5x11.4x4.3in\n\nPackage Included:\n1*Backpack\n(Other accessories are not included)\n\nNotes:\n1: Measurement of the item lying on the table may cause 1-3cm difference, please note the sizes for it doesn't fit all people. Please view the details of the size information before your purchase.\n2: The real color of the item may be slightly different from the pictures shown on website caused by many factors such as brightness of your monitor and light brightness when photo taking.\n3: Each product is unique and made by hands, that's why small deviation from the photos in the listing is possible."
    },
    {
        "title": "🎀NEW🎀New Waterproof bag Top Box Panniers Bag Case Luggage Bags For BMW R1200GS LC Adventure R1250GS Motorcycle F650GS G3",
        "path": "NEWNew-Waterproof-bag-Top-Box-Panniers-Bag-Case-Luggage-Bags-For-BMW-R1200GS-LC-Adventure-R1250GS-Motorcycle-F650GS-G3-i.1003462474.18089222325",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdw-lhaumxeor82k2c",
        "price": 5916000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "💖Dear, welcome to our shop\n💖We provide you with quality products\n💖Please follow our shop\n\nSpecial Features：Large capacity\nMaterial Type：1680D PVC material\nItem Diameter：1inch\nItem Weight：1.1kg\nItem Height：1inch\nItem Width：1inch\nItem Length：1inch\nModel Name：For BMW\nItem Type：Werkzeug Taschen\nBrand Name：Otilli\nOrigin：Mainland China\nQuantity:：A set\nColor:：Black\n♥️♥️After sale:\n1.If you have some problem with the item which you received  (like how to use ,did not receive or the item did not work),  please contact us first  thank you \n2.When you received your parcel and give the item five stars rating★★★★★,  you can get a voucher that you can use in your next order"
    },
    {
        "title": "Front Runner Easy-Out Awning 2 Metre for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Front-Runner-Easy-Out-Awning-2-Metre-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.23869468504",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfo-lheke3j7ujb348",
        "price": 79900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Always have shelter from the elements with this Easy-Out Awning / 2m, which mounts to your roof rack. When expanded, this awning measures 2m wide and 2.1m out from the vehicle, making it an ideal size for all medium vehicles.\n\nQuick and easy two-person set up, in under 60 seconds.\nMounts quickly and easily to the side of your Front Runner Roof Rack for instant sun or rain protection.\nWater-repellent, UV-resistant awning measures 2m wide and extends 2.1m from mounting extrusion.\nLightweight, yet durable, vertical support poles have spikes on the end for secure ground placement and extend to 2.4m maximum height for use with taller vehicles.\nTelescopic aluminium twist-lock upright and rafter poles as well as aluminium rafters that ensure rigidity.\nIncludes reflective gut ropes with tent stakes for stability in windy conditions.\nDurable, heavy-duty PVC coated 650g nylon cover protects your awning while stowed and in transit.\nUniversal mounting hardware included. For best mounting results on Front Runner Racks, upgrade to the Quick Release Awning Mount Kit or Easy-Out Awning Brackets.\nAdd additional sun/rain protection to the front or side with Wind/Sun Break for 2M Awning / Front or Wind/Sun Break for 1.4M/2M & 2.5M Awning / Side.\nTurn any awning into a shelter in minutes by adding the Easy-Out Awning Room / 2M or Easy-Out Awning Mosquito Net / 2M.\nFolds into the main carry bag which can be left permanently attached to the vehicle.\nUse the 3 mounting loops to secure the LED Light Strip / 1.2M to illuminate the space under the awning.\nConsists of:\n1 x Awning with adjustable hortizontal & verticle support poles\n1 x Mounting plate with zippered heavy-duty storage bag\n2 x Tent stakes\nGuy Ropes\n\nMaterials used:\nAwning: 400d oxford/polyester ripstop, UV-resistant (UVP 50+), PU-coated 1500mm water-repellant\nAwning Bag: Heavy-duty 650g PVC-coated nylon\n\nProduct Dimensions:\nClosed:\n2040mm (80\") L x 100mm (4\") W x 100mm (4\") H\n\nOpen:\n2100mm (82.7\") L x 2000mm (78.7\") W x 2400mm (94.5\") H (Max Height)\n\nWeight:\n12.5kg (27.6lbs)"
    },
    {
        "title": "Nike2729(37L)-The Ultimate Travel Bag for Adventure Seekers - Water-Resistant, Tear-Resistant, Wet/Dry Separation, Shoe Pocket, Large Capacity QEWJ",
        "path": "Nike272937L-The-Ultimate-Travel-Bag-for-Adventure-Seekers-Water-Resistant-Tear-Resistant-WetDry-Separation-Shoe-Pocket-Large-Capacity-QEWJ-i.1013192516.22170269662",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdn-leyp6gih7fcj88",
        "price": 3834000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Ready to go on a trip? This travel bag is perfect for your needs.\n\nMade of high quality ripstop fabric, waterproof and rainproof design, separate shoe pockets and wet and dry separation pockets, easy to store and keep your items clean and dry.\n\nHandheld or crossbody design, lightweight and convenient. Large enough capacity to store all your essentials. Buy it and enjoy the high quality and many practical features.\n\nThis travel bag is the best choice for your travel."
    },
    {
        "title": "LED Flashlight 350LM COB Long Range Lantern 4 Modes for Outdoor Travel Adventure",
        "path": "LED-Flashlight-350LM-COB-Long-Range-Lantern-4-Modes-for-Outdoor-Travel-Adventure-i.163968906.23070939554",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdf-lhzvf8g2ft5xbe",
        "price": 617000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "350LM COB Portable Flashlight 4 Modes LED Long Range Lantern USB Rechargeable IPX4 Waterproof for Outdoor Travel Adventure\nFeature:\n1. 4 Lighting Modes: Strong light - weak light - flashing - COB side lamp, suitable for different scenes.\n2. Long Range Lantern: The spotlight cup has a long irradiation distance. It is waterproof for daily use and can be used in rainy days.\n3. Rechargeable: Built-in 800mAh 18650 lithium-ion battery, Type-C USB charging, no need to replace the battery, more environmentally friendly.\n4. Power Display: Keep abreast of battery usage, convenient and timely charging.\n5. Wide Application: This rechargeable flashlight can bring you enough brightness, during power failure and emergencies, or scare wild animals when camping, hiking, driving at night and exploring.Specification:\nBody material: ABS\nProduct color: black\nProduct size: about 170x60x60mm/6.69x2.36x2.36inch\nNet weight of product: about 100g\n\nLamp bead parameters:\nLight bulb: 9 * LED+COB\nGear:\n4 gear, strong light - weak light - flashing - COB side lamp\nZoom mode: None\nLumens: 350LM\n\nOther parameters:\nBattery: built-in 800mAh 18650 lithium-ion battery\nCharging method: Type-C USB charging\nUsage time: about 1-2 hours\nCharging time: about 1-2 hours\nWaterproof grade: IPX4\n\n Note:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\n Included: \n\n1 x Flashlight\n1 x USB charging cable (black white random delivery)"
    },
    {
        "title": "🎀NEW🎀For BMW R1200GS LC Adventure Luggage Bag for Vario Case Inner bag for BMW GS R1200 1250 LC Adventure Side Case Inne",
        "path": "NEWFor-BMW-R1200GS-LC-Adventure-Luggage-Bag-for-Vario-Case-Inner-bag-for-BMW-GS-R1200-1250-LC-Adventure-Side-Case-Inne-i.1003457135.22343794545",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvek-lhaex45uohsc25",
        "price": 2650000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "💖Dear, welcome to our shop\n💖We provide you with quality products\n💖Please follow our shop\n\nSpecial Features：Extensible, Water resistant\nMaterial Type：810D PVC-coated polyester fabric\nItem Diameter：20cm\nItem Weight：0.5kg\nItem Height：14cm\nItem Width：30cm\nItem Length：36cm\nModel Name：F1703-03801\nItem Type：Top Cases\nBrand Name：KEMiMOTO\nOrigin：Mainland China\nCondition：100% Brand New\nColor：As photo show\nPackage：1 Bag\nFit：For Vario Side Cases\n1Fit：For BMW R1200GS/ADV\n2Fit：For BMW R1250GS/ADV\n3Fit：For BMW F750GS/ADV\n4Fit：For BMW F850GS/ADV\n♥️♥️After sale:\n1.If you have some problem with the item which you received  (like how to use ,did not receive or the item did not work),  please contact us first  thank you \n2.When you received your parcel and give the item five stars rating★★★★★,  you can get a voucher that you can use in your next order"
    },
    {
        "title": "[Wholesale]45mm Precision Compass For Camping Travel Mountain Climbing Outdoor Adventure Survival Pointing Tool Portable Mini Compass Hiking Practical Guide",
        "path": "Wholesale45mm-Precision-Compass-For-Camping-Travel-Mountain-Climbing-Outdoor-Adventure-Survival-Pointing-Tool-Portable-Mini-Compass-Hiking-Practical-Guide-i.290987482.21890341080",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-29gpz0f0pzkv9c",
        "price": 63000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "——Welcome to Our store——\n \nWe promise:\n--All items are available unless marked as \"sold out”\n--Fast delivery: ready stock & Quick Shipping\n--【Full or Partial refund】\n1:Fully refund if you don't receive your order\n2:Fully or partially refund,if the item is not as described\n \nProduct description:\n100% brand new high quality\nSuitable for camping, hiking, climbing and traveling.\nWith a compact design, it is the most important tool in our daily life.\n \n \nSpecification\nMaterial: ABS, acrylic\nCategory: Compass\nColour: Black\nSize: about 45 mm in diameter\nApplicable: camping, travel, mountain climbing, etc.\nPackage includes: 1* Compass\n \n【Feedback】:\nOur Store Service is available 24 hours\nWe have sufficient stock for our beloved customers\n \nNOTE：\nDue to different lighting conditions and monitors, colors may differ from the colors. Please refer to the actual object.\n \n~Thank you for coming and wish you a happy life~"
    },
    {
        "title": "🎀NEW🎀Motorcycle Tail Bag 22L Rear Seat Bag For R1200GS R1250GS F800GS Z750 Z800 G310R LC Adventure Expandable Back Seat ",
        "path": "NEWMotorcycle-Tail-Bag-22L-Rear-Seat-Bag-For-R1200GS-R1250GS-F800GS-Z750-Z800-G310R-LC-Adventure-Expandable-Back-Seat-i.1003462474.23469273888",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdr-lhajwb54gah304",
        "price": 6137000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "💖Dear, welcome to our shop\n💖We provide you with quality products\n💖Please follow our shop\n\nSpecial Features：Waterproof Oxfords Cloth\nMaterial Type：600D Oxfords Cloth\nItem Diameter：0cm\nItem Weight：0.8kg\nItem Height：20cm\nItem Width：28cm\nItem Length：38cm\nModel Name：F1116-03601BK\nItem Type：Back Seat Bags\nBrand Name：KEMiMOTO\nOrigin：Mainland China\nSuitable：For Tourist,Riding,Hiking,Camping,Climbing\nFitment：Fits most motorcycle\nCapacity：22L\nItem Name：Motorcycle Tail Bag\nFeature 1：Motorcycle Rear Seat Bag\nFeature 2：Back Seat Bags\nFeature 3：Motorcycle Helmet Bag\nFeature 4：Motorcycle Luggage Bag Backpack\nFitment 1：For BMW R1200GS R1250GS Adventure\nFitment 2：For F850GS F800GS F650GS K1200S\nFitment 3：For SUZUKI GSX-R 1000 1300 600 750\nFitment 4：For Honda CB600RR CBR1000RR NC750\nFitment 5：For YAMAHA TRACER 900 MT09 MT10 FZ07 09\nFitment 6：For Road Glide Road King\nFitment 7：For Street Glide For Electra Glide\nFitment 8：For Iron883 Iron 883\n♥️♥️After sale:\n1.If you have some problem with the item which you received  (like how to use ,did not receive or the item did not work),  please contact us first  thank you \n2.When you received your parcel and give the item five stars rating★★★★★,  you can get a voucher that you can use in your next order"
    },
    {
        "title": "M-Power T-shirt Maglietta Camiseta M3 M5 M8 X5 X7 IX E30 530 Personalised Christmas Gifts Travel Adventure Sport",
        "path": "M-Power-T-shirt-Maglietta-Camiseta-M3-M5-M8-X5-X7-IX-E30-530-Personalised-Christmas-Gifts-Travel-Adventure-Sport-i.1035931097.19082178482",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-qwst8yutx4jva6",
        "price": 1755000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Welcome !!\n\nOur Store Specializes In Selling All Kinds Of Fashionable Men's Clothing, Good Quality!!!\n\n\n\n🚛We Are Overseas Sellers, All Goods Have Sufficient Stock.Usually, It Takes 7-10 Days For Transportation.\n\n\n\n💰Click \"+FOLLOW\" To Follow Us, You Will Get An Additional Discount Coupon！\n\n\n\n🔰If You Have Any Problem, Please Feel Free To Contact Us. We Will Try Our Best To Solve It For You!Size: XXS-5XL\nQuality grade: excellent product\nFunction: breathable and hygroscopic\nApplicable gender: male and female\nStyle: sporty and casual\nPurpose: personal customization, company uniform customization, marathon sportswear, travel group uniform, sportswear customization, school uniform customization, optional clothing customization, gift customization, running clothing customization, team clothing customization\nSports trends, fitness, running, cycling, ice sports, hiking, camping, \nshooting, etc.\n\nNote: \n1:Manual measurement, error is 1-3cm, for reference only\nThanks for your understanding.\n\n2: Due To The Reason Of Photographing Lights And Different Displayer, It May Be Small Different From The Picture Color, Please Refer To The Actual Goods!\n\n\n\n3: Tip For Choosing The Right Size: Similar Past Garment Sizes Can Be Measured For Comparison And Confirmation.\n\nProduct Details:\n✅ Thickness      : ⭐⭐⭐\n✅ Breathable     : ⭐⭐⭐⭐⭐\n✅ Value / Price : ⭐⭐⭐⭐⭐\n✅ Adult Crew Neck T-Shirt\n\nSome reference of actual customers\nAndy     : 155CM / 45KG = XS\nBilly       : 170CM / 53KG = S\nColin    : 168CM / 58KG = M\nDanny      : 175CM / 64KG = L\nEnos : 175CM / 88KG = XL\n\nSizes details\n XXS   :Bust 88/  Width 36cm / Length 60cm        height（145-160CM）\n- XS    : Bust 94/  Width 39cm / Length 64cm       height（150-165CM）\n- S      : Bust 96/   Width 41cm / Length 66cm       height（155-175CM）\n- M     : Bust 104/ Width 44cm / Length 68cm      height（160-180CM）\n- L      :Bust 113/  Width 47cm / Length 72cm       height（165-183CM）\n- XL    :Bust 122/  Width 51cm / Length 76cm      height（170-186CM）\n- 2XL  :Bust 128/  Width 53cm / Length 79cm      height（175-190CM）\n- 3XL  :Bust 131/  Width 55cm / Length 81cm      height（175-193CM）\n- 4XL : Bust 134/ Width 56cm / Length 82cm       height（177-196CM）\n- 5XL : Bust 137/ Width 57cm / Length 84cm       height（178-197CM）\n\nPlease come in:\nHow to customize your clothes?\nStep 1: You can send us your logo photo through email.\nStep 2: After receiving your photo, we will show you a pre-packaged photo with your logo.\nStep 3: If you are satisfied with the advance payment, you can place an order\nIf you have any questions, please feel free to contact us. We will contact you within 24 hours."
    },
    {
        "title": "Spacious and Lightweight Travel Backpack for Outdoor Adventures",
        "path": "Spacious-and-Lightweight-Travel-Backpack-for-Outdoor-Adventures-i.1016645076.21082721173",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvea-lk7nutiv6kbv49",
        "price": 3343000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Welcome to our store😘\n💘💘Follow the store with large coupons.It is cheaper to place an order with store coupons\n💘💘We have enough products in stock. Please rest assured to buy. We will process your order within 12 hours.\n💘💘 We guarantee the quality of the products and provide you with the best products and services.\n💓💓 If you have any questions or problems with the product, please contact online customer service.\n1 This lightweight and foldable outdoor backpack is perfect for hiking and traveling Made of waterproof and durable nylon, it offers ample storage space for all your essentials, making it an ideal choice for outdoor adventures\n2 Gear up for your next hiking trip with this versatile and compact folding backpack Crafted from highquality nylon, it is both waterproof and wearresistant, ensuring your belongings stay safe and dry With its large capacity and comfortable shoulder straps, it's the perfect companion for any outdoor activity\n3 Designed for the adventurous souls, this waterproof and durable backpack is a musthave for any traveler Its lightweight and foldable design make it easy to pack and carry, while its spacious compartments provide ample storage space for your belongings Whether you're hiking, trekking, or simply exploring new places, this backpack is the ultimate companion\n4 Experience the convenience and durability of this outdoor backpack during your next trip Made from highquality nylon, it is not only waterproof but also resistant to wear and tear The large capacity allows you to pack all your essentials, while the foldable design makes it easy to store when not in use Get ready for your next adventure with this reliable and functional backpack\n5 Get ready to explore the great outdoors with this versatile and spacious travel backpack Crafted from waterproof and durable nylon, it can withstand any weather conditions, ensuring your belongings stay safe and dry The foldable design and adjustable shoulder straps offer maximum comfort and convenience, making it an essential companion for your hiking and travel adventures"
    },
    {
        "title": "LED Camping Flashlight Portable COB Outdoor Lighting for Travel Hiking Adventure",
        "path": "LED-Camping-Flashlight-Portable-COB-Outdoor-Lighting-for-Travel-Hiking-Adventure-i.217565522.22850744630",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg0-lk7kh9vcccrb87",
        "price": 2501000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "LED Camping Flashlight Portable COB Torch Lamp Type-C USB Rechargeable IPX4 Waterproof for Hiking Fishing Emergency\nFeature:\n1. Dual Light Source: Near and far dual light sources, suitable for different needs.\n2. Anti Slip Texture: Increase friction and prevent flashlight from falling off.\n3. Emergency Power Supply: The flashlight using AAA batteries may not support the emergency power function, while it using 18650 and 26650 batteries support the emergency power function.\n4. Low Battery Reminder: The switch position indicator flashes red when charging, and the switch position indicator always lights green when fully charged and in use.\n5. Satisfaction Guarantee: We strive to provide each customer with the highest standard of customer service to ensure you have a pleasant shopping experience. If you have any issues, inquiries or need assistance, please feel free to contact us directly. \nSpecification:\nLight bulb: XHP70 LED+COB (white light+red light)\nProduct size: 175x43x43mm/6.88x1.69x1.69inch\nNet weight: 192g\nMaterial: aluminum alloy\nSwitch: main lamp switch+side lamp switch\nBattery: 1 * 18650/1 * 26650/3 * AAA (not included)\nCharging method: Type-C USB charging, supporting 5V 1A output\nGear:\nMain lamp 3 gear: strong light - weak light - fast flash\nSide lamp 4 gear: COB strong light - COB weak light - COB red light - COB red light flashing\nZoom mode: telescoping zoom\nWaterproof grade: IPX4\nLumens: 1200-1500 Lumens\nRange: 200-300 meters\n\n Note:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\nIncluded:\n1 x Flashlight (shipped without batteries)\n1 x USB charging cable (black and white shipped randomly)"
    },
    {
        "title": "LED Flashlight 350LM COB Long Range Lantern 4 Modes for Outdoor Travel Adventure",
        "path": "LED-Flashlight-350LM-COB-Long-Range-Lantern-4-Modes-for-Outdoor-Travel-Adventure-i.217565522.18391687805",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdd-lk7ki6osh2mv58",
        "price": 1098000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "350LM COB Portable Flashlight 4 Modes LED Long Range Lantern USB Rechargeable IPX4 Waterproof for Outdoor Travel Adventure\nFeature:\n1. 4 Lighting Modes: Strong light - weak light - flashing - COB side lamp, suitable for different scenes.\n2. Long Range Lantern: The spotlight cup has a long irradiation distance. It is waterproof for daily use and can be used in rainy days.\n3. Rechargeable: Built-in 800mAh 18650 lithium-ion battery, Type-C USB charging, no need to replace the battery, more environmentally friendly.\n4. Power Display: Keep abreast of battery usage, convenient and timely charging.\n5. Wide Application: This rechargeable flashlight can bring you enough brightness, during power failure and emergencies, or scare wild animals when camping, hiking, driving at night and exploring.Specification:\nBody material: ABS\nProduct color: black\nProduct size: about 170x60x60mm/6.69x2.36x2.36inch\nNet weight of product: about 100g\n\nLamp bead parameters:\nLight bulb: 9 * LED+COB\nGear:\n4 gear, strong light - weak light - flashing - COB side lamp\nZoom mode: None\nLumens: 350LM\n\nOther parameters:\nBattery: built-in 800mAh 18650 lithium-ion battery\nCharging method: Type-C USB charging\nUsage time: about 1-2 hours\nCharging time: about 1-2 hours\nWaterproof grade: IPX4\n\n Note:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\nIncluded:\n1 x Flashlight\n1 x USB charging cable (black white random delivery)"
    },
    {
        "title": "Kate Spade Stationery Insulated Tumbler with Reusable Straw Acrylic Travel Cup with Lid - Adventure Stripe",
        "path": "Kate-Spade-Stationery-Insulated-Tumbler-with-Reusable-Straw-Acrylic-Travel-Cup-with-Lid-Adventure-Stripe-i.352772283.15199228860",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve7-lk0pjg7ywufe94",
        "price": 3695000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "• Tumbler with straw holds 24 ounces and features a double wall design that keeps drinks cool and the cup free of condensation.\n• Tumbler cup features a slim design that is easy to carry and fits in most standard cupholders. The lock-tight lid easily screws on/off and includes a reusable straw that won't break.\n• The 3-inch (7.62 cm) opening allows for hassle-free cleaning and makes it easy to fill. For best care, the insulated tumbler cannot be used in the microwave and should be washed by hand.\n• Insulated cup is made of BPA-, lead-, and phthalate-free acrylic so your drink is rid of any harsh chemicals. The non-toxic tumbler can be refilled and reused endlessly to help reduce plastic waste.\n• 24oz tumbler is featured in a fun striped design with a solid pink lid and straw. The Kate Spade New York logo is printed in shiny gold lettering near the base.\n\nProduct Details\n• Design: Adventure Stripe\n• Approx. Measurement\n• Diameter: 8 cm\n• Height: 21.4 cm"
    },
    {
        "title": "GDT 700ml Set of Collapsible Water Bottles Reusable Festival Collapsible Bottle for Hiking, Adventure, Travel",
        "path": "GDT-700ml-Set-of-Collapsible-Water-Bottles-Reusable-Festival-Collapsible-Bottle-for-Hiking-Adventure-Travel-i.183462393.14597936172",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf3-lk7t1jz9lriv4a",
        "price": 869000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "100% New and High Quality！！！ \n\nWelcome to our store   \n\n★Color : as picture shown\n★Size : Tiled size: 22.6*12.8cm, rolled up size: 12.8*7.6cm,\n★Material :  PE\n\nPackage Included:  1Pcs\n   \nNotes:\n1.Due to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\n2.Please allow 1-3cm measuring deviation due to manual measurement"
    },
    {
        "title": "[Qiuxiang Bookstore] Quack Travel Club All 4 Volumes Master Picture Book Tatsue Matsuoka Natural Popular Science 3-6 Years Old Adventure Story",
        "path": "Qiuxiang-Bookstore-Quack-Travel-Club-All-4-Volumes-Master-Picture-Book-Tatsue-Matsuoka-Natural-Popular-Science-3-6-Years-Old-Adventure-Story-i.902608561.14699242120",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdg-lk44ph6t2976a9",
        "price": 4482000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Title Title: Quack Travel Agency\nIsbn Number:9787511060051\nPublisher Name: Dolphin Publishing House\nAuthor: Matsuoka Daying\nTranslator: Tian Xiujuan\nScan, Mind Taking Pictures Carefully"
    },
    {
        "title": "LED Flash Light 3 Modes Camping Flashlight for Travel Hiking Adventure Emergency",
        "path": "LED-Flash-Light-3-Modes-Camping-Flashlight-for-Travel-Hiking-Adventure-Emergency-i.217581377.18190272821",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvex-lik8of7f785p14",
        "price": 408000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "LED Camping Flashlight Torch Lamp 3 Modes USB Rechargeable Life Waterproof for Travel Hiking Emergency Outdoor Lighting\nFeature:\n1. Anti Slip &amp; Waterproof: Anti slip texture, increase friction to prevent the flashlight from falling off; The flashlight is waterproof in daily life and can also be used in rainy days.\n2. Long Irradiation Distance: The spotlight cup has a long irradiation distance. High-brightness and large-area illumination, you are not afraid of the dark when riding at night.\n3. USB Rechargeable: Built-in 500mAh 14500 lithium-ion battery, Micro USB charging, no need to replace the battery, more environmentally friendly.\n4. Emergency Charging: It can be used as emergency power supply for mobile phones.\n5. Wide Applications: This LED flashlight is suitable for outdoor activities, such as hiking, camping, caving, fishing, etc. Perfect for camping, hiking, emergencies.Specification:\nBody material: ABS\nProduct color: black\nProduct size: about 140x30x30mm/5.51x1.18x1.18inch\nNet weight of product: about 58g\n\nLamp bead parameters:\nBulb: 3030 LED\nGear: 3 gear, strong light - weak light - flashing\nZoom mode: None\nLumens: 250LM\n\nOther parameters:\nBattery: built-in 500mAh 14500 lithium-ion battery\nCharging mode: Micro USB charging\nService time: about 1-2 hours\nCharging time: about 1 hour\nWaterproof grade: IPX4\n\n Note:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\n Included: \n\n1 x Flashlight\n1 x White USB charging cable"
    },
    {
        "title": "Quick Pitch Roof Top Tent Quickpitch for Vehicle Expedition, Camping Overland Use (SUV, 4WD, Travel) RoadTrip Adventure",
        "path": "Quick-Pitch-Roof-Top-Tent-Quickpitch-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.18890253246",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvf8-lijmcl3z12o135",
        "price": 619900000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Our \"Quick pitch roof top tent\" works in a similar way to the hard shell tent as it pops open on gas lifts but rather than having a metal outer shell it has a zipped canvas top cover which stays attached to the tent when opened.  The tent has an aluminium base and hinged lifting frame.\n\nThe motivation for developing the Quick pitch tent was to try and produce a tent that was lighter and cheaper than the hard shell tent but still be quick and easy to use.\n\nInformation:\n\n2.2m L x 1.3m W quick pitch roof top tent\n\nEasy self opening tent working on gas assisted springs\n\n3 x Doors/openings on the ripstop canvas with built in mosquito nets\n\nDouble skinned ripstop canvas roof\n\nUpholstered 75mm high density foam mattress\n\nAlumiumium Ladder\n\nShade/weather awning complete with spring rods\n\n2 x Telescopic aluminium tensioning poles\n\nWeight +/- 50kg's"
    },
    {
        "title": "Trips2travel Caterpillar City Adventure Backpack Trolley Black",
        "path": "Trips2travel-Caterpillar-City-Adventure-Backpack-Trolley-Black-i.602156973.14897651667",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvff-lhznjk415cqi43",
        "price": 14710000,
        "location": "SG",
        "rating": 0,
        "sold": 0,
        "description": "Caterpillar City Adventure Backpack Trolley Black\n\n• Large main compartment with padded laptop compartment\n• Pull-out adjustable shoulder straps\nand wheel cover\n• Pull-out Trolley handle \n• Carry handle on top\nDimension : 49.5 x 37 x 30 cm (H x W x D)\nWeight : 1.85kg\nVolume : 32L\nMaterial : 600D RPET"
    },
    {
        "title": "Leo's Play Cool Holiday Series Surprise Toys, Boys Travel Adventure Trendy Doll Figure",
        "path": "Leos-Play-Cool-Holiday-Series-Surprise-Toys-Boys-Travel-Adventure-Trendy-Doll-Figure-i.1037706726.17795405427",
        "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lji6mhvk8fzo47",
        "price": 921000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "♫Hello Customer, Welcome To Our Store!We Strive To Provide Our Customers An Array Of Products That Satisfy Demand For Quality And Efficiency.Buy Our Products From Shopee Mall, We Guarantee 100% Authenticity.Shopping Can't Be Easier Anymore So Start Today!\n♫Pay Attention To Our Store For More Gifts!\n\n---------------------------\n♥Product Attributes ღ\n- Material: Natural Resin\n- Category: Blind Box\n- Packaging: Carton Packaging\n- Color: Leo's Play Cool Holiday Blind Box\n- Size: Random 1pc, End Box (Whole Set Not Repeat)\n- Style: Cartoon\n- Ip Name: Leo's Play Cool Holiday\n-------------------------------------\n♥Product Features ღ\n♪  Leo's Play Cool Holidays – This Product Is A Cool Holiday Blind Box Ornament When LEO Plays This Product, Which Consists Of A Total Of Seven Kinds Of Clothing Represents Each Scene, And Each Clothing Fits The Scene, And Each One Is Fused With The Leo's Things You Want To Complete And Do During The Holiday, The Product Image Is Easy To Identify And Easy To Remember\n----------------------------------------------------\n\n✿Thank You For Your Strong Support To Our Store, Your Satisfaction Is The Purpose Of Our Service, I Wish You A Happy Shopping!"
    },
    {
        "title": "Ridwana.id - Tas Ransel Duffle 3in1 Waterproof For Adventure Backpack Travel Latest Casual Style",
        "path": "Ridwanaid-Tas-Ransel-Duffle-3in1-Waterproof-For-Adventure-Backpack-Travel-Latest-Casual-Style-i.358942541.22975230280",
        "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul5-ljrxy267juoy54",
        "price": 1674000,
        "location": "Indonesia",
        "rating": 0,
        "sold": 0,
        "description": "Material: Bimo\nColor: Ashes\nSize Dimension:\n- Length: 26 cm.\n- Width: 25 cm\n- Height: 44 cm"
    },
    {
        "title": "SL| Kids Visor Hat with Fan Protection Wide Brim for Outdoor Adventures Summer Hiking Travel and Screen Accessories",
        "path": "SL-Kids-Visor-Hat-with-Fan-Protection-Wide-Brim-for-Outdoor-Adventures-Summer-Hiking-Travel-and-Screen-Accessories-i.134972426.16897916621",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lie58o1t7wq7a5",
        "price": 1151000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Description: \n\nOur kids visor hat, a must-have for your little ones!\n\nThis hat is the epitome of comfort and functionality, making it perfect for all their outdoor adventures.\n\nNot only does this visor hat protect your child from the harsh rays, but it also keeps them cool with its unique small fan design.\n\nSay goodbye to sweaty foreheads and hello to a refreshing breeze!\n\n.\n\nThis hat is not only practical but also incredibly convenient.\n\nIt is lightweight and portable, easily rolling into a compact size that can fit into any purse, backpack, or handbag.\n\nNo more worrying about bulky accessories weighing you down.\n\nThe wide brim of this visor hat provides excellent uv protection, ensuring your child's delicate skin is shielded from harmful rays.\n\nThe breathable and open-top design keeps their head cool even in scorching hot weather, guaranteeing maximum comfort.\n\nPerfect for any outdoor activity, this dual-function hat offers the best of both worlds  a fan and a hat.\n\nAdjust the three-speed to your child's liking, allowing them to customize their comfort according to their needs.\n\nTo make life even easier, this fan hat comes with a usb charging function, ensuring that it can be easily charged anytime, anywhere.\n\nNo more fussing over batteries or finding a power source.\n\nConvenience at its finest.\n\nWith an adjustable head circumference of 46-52cm, this visor hat comfortably fits both children and adults.\n\nIt's perfect for family trips or even when your child wants to share their stylish accessory with you.\n\nCarrying and using this hat is a breeze.\n\nIt is designed to be user-friendly, making it the ideal accessory for outdoor travel, beach visits, mountain climbing, cycling, hiking, and any other adventure your child embarks on.\n\nUpgrade your child's outdoor experience with our kids visor hat.\n\nComfort, style, and functionality all rolled into one amazing product.\n\nDon't miss out on this must-have accessory for your little ones!\nItem Name: Kids Visor Hat\nMaterial: Polyester\nUsage: Sun Protection\nFeatures: with Fan, Adjustable, Wide Brim \nSize Detail: \nHat Circumference: 46cm-52cm/18.11\"-20.47\" (Approx.)\nBrim Width: 13.5cm/5.31\" (Approx.)\n\n\nNotes: \nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.Please allow slight dimension difference due to different manual measurement.\n\nPackage Includes: \n1 x Kids Visor Hat\n1 x USB Charging Cable"
    },
    {
        "title": "Nike4574 (44 L)- Gear Up for Your Next Adventure - Waterproof, Tear-Resistant Travel Bag with Comfortable Carrying and High Capacity",
        "path": "Nike4574-44-L-Gear-Up-for-Your-Next-Adventure-Waterproof-Tear-Resistant-Travel-Bag-with-Comfortable-Carrying-and-High-Capacity-i.1013192516.19780612964",
        "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdj-lg566d0g53id88",
        "price": 3877000,
        "location": "Mainland China",
        "rating": 0,
        "sold": 0,
        "description": "Simplify your travels with our functional and stylish travel bag. Made with tear-resistant fabric and waterproof material, it's designed to keep your belongings safe and secure. The large capacity and multiple pocket design offer ample storage space, while the padded straps and handles provide comfort on the move. With its sleek and modern design, it's a perfect choice for the discerning traveler."
    }
]