{
    "query": "Art and Craft Supplies",
    "region": "Singapore",
    "total": 6983,
    "results": [
        {
            "title": "LEOTA Handmade Mosaic Vase, Flower Wooden Mosaic Bottom DIY Art Decoration, Craft Supplies Material Package Mosaic Art Paste Mosaic Tiles Creative Craft Kit Parent Child Toys",
            "path": "LEOTA-Handmade-Mosaic-Vase-Flower-Wooden-Mosaic-Bottom-DIY-Art-Decoration-Craft-Supplies-Material-Package-Mosaic-Art-Paste-Mosaic-Tiles-Creative-Craft-Kit-Parent-Child-Toys-i.455449081.22748936319",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd7-ljgel1dt8m2p3c",
            "price": 2589000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Dear friends, welcome to visit!\n \nName: diy Mosaic Vase\nMaterial: wood\nModel: mine bottom 9 * 9 * 9cm (3.54 * 3.54 * 3.54in), small south bottom 12 * 7.5 * 7.5cm (4.72 * 2.95 * 2.95in), truncate bottom 17 * 8 * 8cm (6.69 * 3.15 * 3.15in)\nStyle: Multiple styles randomly selected\nSuggested age: 7 years old and above(accompanied by parents)\nPackaging: 1set diy Mosaic Vase Material Pack (1PC base embryo+1PC simulation flower+1set material kit)\nFeatures: \nEasy to make, simple and beautiful, the material is round and does not hurt hands\nOperation steps:\n1. Apply glue, and apply the glue even on the bottom blank\n2. Stick the mosaic, pick up the mosaic and paste it one by one according to the desired pattern\n3. After the glue dries, make a paste according to the ratio of water 1 powder\n4. Spread the cake even between the gaps\n5. After10- 20 minutes, use a spring to wet and writing out the excess sealant\n\nNote:\nThis product is not a finished product and requires DIY by oneself\nThe bottom embryo of the vacuum is made of wood flow and cannot be filled with water\nPlease prevent children from eating by mistake\nHandmade Mosaic Vase DIY Art Decoration Mosaic Vase Handmade Vase Creative Craft Kit Handmate Home Decor DIY Supplies DIY Furniture Decor Wooden Mosaic Bottom Mosaic Tiles Flower Mosaic Art Paste Eco friendly Material Package Personalized Gift Idea Gift Toys Home Accessories Decorative Handmate Furnishing Craft Supplies\n \nIf you need assistance, please contact online customer service."
        },
        {
            "title": "♥♥♥ 8pcs Cone- Shaped Foams Trees Crafts Cone Crafts Xmas Tree Materials Christmas Bag Filler Children DIY Supply",
            "path": "8pcs-Cone-Shaped-Foams-Trees-Crafts-Cone-Crafts-Xmas-Tree-Materials-Christmas-Bag-Filler-Children-DIY-Supply-i.82435852.20166016031",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-c543amn3gjkva7",
            "price": 700000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Description\n\nPerfect for your kid’s DIY project. Easy to make into whatever you want. Great for children activities in church, preschool, kindergarten, or at home. Great DIY project for all ages! Come and choose one for you and your kids.\n\nFeatures\n\n-Color: White\n-Material: Foams\n-Size: About 25.00X9.50X9.50cm/9.82X3.73X3.73in\n-The perfect accessory DIY material, the cone-shaped foams are perfect for you and your kid’s craft project.\n-It can be a children educational toy to stimulate their imagination and creativity.\n-Great craft project for children in church, nursery, preschool, kindergarten, child care center, home.\n-Practical in use. Can be painted, colored and glued. Great DIY foams cones toys for all ages.\n-Easy to make into whatever you want, very practical to use, you deserve to have one.\n8 x cone-shaped foams"
        },
        {
            "title": "Yuykcei Epoxy Resin Pigment -26 Colour Epoxy Resin Dye - Highly Concentrated Epoxy Resin Colorant for Resin Colour Art, DIY Jewelry Making Supplies - AB Resin Colouring for Paint, Crafts - 10ml Each",
            "path": "Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
            "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
            "price": 2148000,
            "location": "Mainland China",
            "rating": 4.851063829787234,
            "sold": 0,
            "description": "26Colors Epoxy Resin Pigment:Total 26 beautiful translucent colors liquid epoxy pigment,red,fuschia,lemon yellow,brown,sky blue,orange,rose red,pink,yellow,azure,sapphire blue,purplish red,purple,blue,green,beryl green,fluorescence green,golden yellow,grass green,emerald green,peacock blue,cherry red,coffee, violet,white,black with bottled package,each resin colorant 10ml/0.35oz.\nExcellent Choice for Resin Projects: The resin dye mix well into resin, and these epoxy resin color pigments are very concentrated,High concentration of epoxy resin colour pigments, just a drop and you will be shocked by the strong dyeing effect.\nSAFETY & WIDE USE - Our epoxy oily colour dye are all non-toxic, no harsh chemicals, cruelty free.These resin pigments can be widely used on resin jewelry and crafts decorations, jewelry making, paint, garment accessories, or other DIY making.\nEasy To Use: It’s quite easy to squeeze the epoxy resin pigment out of the bottle with specially designed nozzle, transparent and soft bottles you can control the amount easily.Beginner friendly and the experienced/veteran can enjoy it as well.\nNOTE: Liquid resin dye will get best color effect mixed with EPOXY RESIN. Just mix them well and wait it cured, no catalyst needed. lf you have any questions or issues regarding the epoxy resin coloring please do not hesitate to send the seller a message through Amazon and we will respond within 24 hours."
        },
        {
            "title": "30 Pcs Retro Letter Sheet Material Paper Junk Journal Planner Scrapbooking Vintage Decorative Diy Craft Background Paper",
            "path": "30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
            "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
            "price": 210000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 4,
            "description": "Material: Paper\nSize: Approx 110*150mm\nQuantity: 1 pack/30pcs\nCode number: 02688\nApplication for decoration diary, notebook, planner, album, letter, gift box, bottle, cup, scrapbook, cellphone and so on.\nAll items are on hand and ready to ship."
        },
        {
            "title": "20 Pcsbox DIY Real Dried Flowers For Nail Decoration Art Craft Making Jewellery Simulation Decoration Holiday Party Supplies",
            "path": "20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
            "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
            "price": 350000,
            "location": "Mainland China",
            "rating": 4,
            "sold": 0,
            "description": "100% Brand New And High Quality !\n\nspecification:\n\ncolor: As Picture Show\n\nmaterial: Dried Flower\n\nflower Diameter:About 0.7-0.8cm\n\nsuit For:Floating Aromatherapy Epoxy Handmade Accessories\n\n\nNatural dried flowers vary in size. Please pay attention to natural products. The size, shape and color of each flower are different.\n \nWarm reminder: natural dried flowers are inevitably scattered, each flower has a different shape and color\nCan be used for DIY glass cover, nail art, handmade jewelry.\n \nNoted: Dried flowers can be put in glued, but not soaked in water.\n \nPackaging include:\n \n1 box * 20PCS dried flowers"
        },
        {
            "title": "Cream Glue diy Set Gift Box Children's ins Handmade Material Package Creative Toys Kindergarten Wholesale",
            "path": "Cream-Glue-diy-Set-Gift-Box-Childrens-ins-Handmade-Material-Package-Creative-Toys-Kindergarten-Wholesale-i.915290312.21367114067",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e8ge5tudp6jv05",
            "price": 1328000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 3,
            "description": "★Hello!Welcome To The Store!\nRemember To Pay Attention To The Store And Click On Love Goods.There Will Be Discounts To Receive Notifications As Soon As Possible.\n\n★[Shipping Note]\n1.All Items Are In Stock And Will Be Shipped Within 48H After Placing The Order\n2.We Send It From Mainland China, Because It Is An Overseas Seller, You Need To Pass The Customs, Please Ask For Urgent Orders First\n\n★Product Basic Information\nProduct Category: Educational Toys\nSpecification: 22 * 16 * 6cm\nWhether It Can Be DIY: Yes\n\n\n★Precautions/tips\n1.Please Confirm The Specifications Before Placing An Order, If You Want To Change The Content Of The Order After Placing The Order, Please Cancel It Yourself Before Placing The Order Again.\n2.Do Not Remark The Color Style In Chat And Order, Please Confirm The Color Style Before Placing An Order, And Place The Order Correctly.\n3.Please Confirm The Specifications Before Placing An Order, If There Are Additional Needs, Please Notify In The \"Remarks \", After The Order Is Established, It Cannot Be Changed.\n4.The Color Of The Product Is Slightly Different From The Color Rendering Of The Computer Due To The Shooting Lighting Reasons, The Product Picture Can Be Referenced, Please Refer To The Actual Product\n\n★[After-Sales Notice]\nIf There Is Any Problem After Picking Up The Goods: A Small Piece Is Sent Wrong Goods, Defects, Etc., Please Contact Us First, Do Not Communicate In The Evaluation, Please Communicate In The Chat.\n\n★[Customer Service Consultation]\nOnline Quick Consultation, If You Have Any Questions, Please Ask, Make Good Use Of Chat, And Someone Will Serve You Online.\nIf You Find That The Product Is Abnormal When You Receive The Product, Please Take A Photo Of The Product And The Order, And Send It To Chat, And The Customer Service Staff Will Chat About The Large Amount Of Messages On The Working Day, And The Customer Service Will Deal With It In Sequence. If You Are Idle, Please Wait For A While, And Do Not Use Evaluation As A Channel For Communication.\nIf You Like Our Products And Services, Welcome To Give Us Full★★★★★Oh Star!"
        },
        {
            "title": "2mm Thin Basswood Sheet Unfinished Wood Piece for Crafts Building Model DIY Sand Table Materials Decor Board model making scenery diorama wargame scene grass painted architecture",
            "path": "2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
            "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
            "price": 658000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 3,
            "description": "Description:\nWood Board for diy Sand Table Model Building Materials Crafts Decorative\nGreat accessory for model making, sand table scenery, diorama wargame scene\nPerfect for grass or other painted model architecture scenery building\nLightweight materials, easy to carry\nMade of basswood, durable\nSize Chart:\nThickness: 2mm \nSize:approx. \n50x200mm/ 2x7.87inch, Wight: about 12.5g\n100x100mm/ 3.94x3.94inch, Wight: 11.5g\n100x200mm/ 3.94x7.87inch, Wight: 21g \n150x150mm/ 5.9x5.9inch, Wight: 26g\n 200x200mm/ 7.87x7.87inch, Wight: 48g\n200x450mm/ 7.87x17.72inch, Wight: 111g(5 Pieces)\nPackage Includes:\n5/10 Pieces Basswood Sheets\nNote:\nColor might be slightly different due to the color calibration of each individual monitor.\nPlease allow slightly measuring deviation due to manual measurement."
        },
        {
            "title": "2-in-1 Dual Head Marker Pen Set / color pencils for kids / Art and craft materials for children / color pencil",
            "path": "2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
            "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
            "price": 910000,
            "location": "SG",
            "rating": 4.78125,
            "sold": 10,
            "description": "✅ READY TO DISPATCH WITH 24 HRS.\n🔥 30/60 Colors Kid Drawing Sets\n🔥 Made of environmentally friendly and healthy raw materials. They are non-toxic and tasteless and have no harm to the body, They can be used with confidence.\n🔥 A wide range of uses, including: coloring pages, learning rainbow colors, idea development in office use, sketching, drawing, layering, blending, polishing, etc,\n🔥 This set is suitable for primary school students and even college students who like to Draw.\n🔥 Fast Creativity - These coloring sets provide a stylish and natural wood look for your toddler or older kids, making the color more interesting, a great complement to the teen art and craft collection.\n🔥 Satisfactory guarantee: Our products are equipped with gift boxes, which can organize your coloring pencil series. It is the best gift for children on birthday and Christmas."
        },
        {
            "title": "Resin Mixer,Handheld Electric Epoxy Stirrer, Tool for DIY Epoxy Resin Crafts Making tools",
            "path": "Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
            "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
            "price": 521000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 3,
            "description": "Powerful Epoxy Mixer】With high speed rotation of 14000 rpm motor,our small and efficient electric wand can mix epoxy resin fast and well for your epoxy glitter tumblers,no more need to mix the epoxy by hand slowly\n【Easy to use】After put the stirrer into the cup with epoxy,simply press and hold the power button on the end to start mixing,Works efficiently and quiet,time saving.\n【Easy to clean】The stainless steel shaft and spiral head is easy to wipe, rinse, or just wash clean with fresh water (do not immerse ABS handle body in water)\n【Battery Operated】Our hand mixer is powered by two AA batteries (not included),Simple one-touch switch with a powerful motor but low noise level. Cordless mixer handheld, no need to worry about messy wires.\n【Fashion Design】Our resin stirrer is styled in matte black surface and a shiny black stripe,ergonomic handle is very comfortable to grip and hold\n\npackage: 1pcs tools（Batteries not included）"
        },
        {
            "title": "youn Toddler Puzzle Alphabet Learning Cognitive Matching Board Toy Kindergarten",
            "path": "youn-Toddler-Puzzle-Alphabet-Learning-Cognitive-Matching-Board-Toy-Kindergarten-i.135054010.23839685932",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd3-lfqmin7pgnt800",
            "price": 3001000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Toddler Puzzle Alphabet Learning Cognitive Matching Board Toy Kindergarten \nFeatures: Shape Matching  Puzzle:  puzzle with cartoon pattern & shape matching alphabet pieces, well stimulate toddler interests, encourage and improve early learning brain development, exercise child hand & eye coordination.\nSelected Material: Made of qualified solid hard woods, & transparent acrylic, well polished with round edges and no burrs, wear resistant,non toxic water printing, safe friendly to your kids.\nAlphabet Cognitive Matching Board: Transparent alphabet pieces with cartoon colorful patterns to guide toddler find the correct pieces and match quickly, easy to match through shape recognition, the concept of teaching in fun to attract kids concentration, improve their logical thinking and hand-on skills.\nFine Motor Skill Educational Toy: Kids can improve their basic fine motor skill ability through pairing & the process of matching, perfect educational & learning toy for toddler hand grab ability and exercise their hand & eye coordination.\nPerfect  for Toddlers: The Alphabet matching puzzle toy suitable for toddlers as birthday , Christmas , and encourage and improve their hands flexible, also an awesome parent-child funny activity table game playing together.\n\nSpecifications: Product Dimension: approx. 26 x 26cm/10.23 x 10.23 inch\nMaterial: Woods, Acrylic\nNet Weight: approx. 550g/1.21 lbs\n\nPackage Includes: 1 x  Puzzle Alphabet Matching Board Toy\n\nnote: Warning: The toy may contain small pieces and need to pay attention to the swallowed risk.\nPlease allow 1-2cm errors due to manual measurement. \nDue to the difference between different monitors, the picture may not reflect the actual color of the item."
        },
        {
            "title": "B.B-Kids Toys Water Mat Drawing Painting Toddler Board Magic Pen Childrens Gift",
            "path": "BB-Kids-Toys-Water-Mat-Drawing-Painting-Toddler-Board-Magic-Pen-Childrens-Gift-i.51487338.1280564822",
            "image": "https://down-sg.img.susercontent.com/file/f1e5b14546f6d507286cbbc3460f61aa",
            "price": 400000,
            "location": "Mainland China",
            "rating": 4.7690582959641254,
            "sold": 13,
            "description": "Feature:\n100% brand new and high quality.\nQuantity: 1\nDraw, Trace Never Make a Mess\nA Perfect Travel Toy/ Indoor Toy for 1-6 years old.\nJust Fill the Magic Pen With Water and Draw on the Magic Aquadraw Mat\nKids are fascinated as the colorful images Spring Up, the slowly Fade Away\nSo that kids can use the Aquadoodle Mat Again and Agian\nMaterial: Cloth\nSize: 45.5 x 29cm\nColor: As Shown\nPackage Content:\n1X Water Drawing Painting Writing Mat Board\n2X Magic Pen"
        },
        {
            "title": "【MEET】10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories Jewelry Toy DIY Resin Handmade Materials",
            "path": "MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
            "price": 90000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "❤[Store Manager Description]:\nProduct Name: DIY Resin Jewelry\nMaterial: Environmentally Friendly Resin\nQuantity: 10g\nUses: Jewelry DIY, Mobile Phone Case DIY, Hairpin DIY~~~~~\nNote:\n1. This Product Is Not Edible\n❤[Shop Description]\n1. All The Items That Can Be Ordered In The Store Are In Stock. After You Place An Order, We Will Try Our Best To Prepare And Send It Out As Quickly As Possible;\n2. Normal Shipments On Weekends/National Holidays;\n3. If You Have Any Questions, Feel Free To Click On The Top Right To Chat~\n\nBecause The Product Dimensions Are All Measured Manually, There May Be Slight Errors, Please Bear With Me😊\n\n❤[Evaluation Description]\n1if You Are Satisfied With Our Products After Receiving The Baby, Remember To Give Us A \"Five-Star\" Praise, We Need Your Affirmation❤🧡💛💚💙\n2if You Have Any Other Questions In Use Or Have Other Questions, Please Do Not Let Us Know With Bad Reviews, You Can [Chat] Ask First, We Will See The Message And We Will Solve It For You As Soon As Possible~\n\nIf You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘If You Like Xiaobian's Beauty Fans, Remember To Follow Us😘😘😘"
        },
        {
            "title": "PLU* Simulated Remote Control Light Function Sound 3 Languages Number Cognition Identify Colors Hand-eye Coordination Baby Toy TV Remote Control for Toddler",
            "path": "PLU-Simulated-Remote-Control-Light-Function-Sound-3-Languages-Number-Cognition-Identify-Colors-Hand-eye-Coordination-Baby-Toy-TV-Remote-Control-for-Toddler-i.134972817.22146244992",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lho97zcfs12d68",
            "price": 644000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Description:\nHow practical is the educational TV remote control toy to train the intelligence of the babies with the numbers enlightenment.\nIt goes without saying that our products can be used as an auxiliary tool to exercise children's grasping ability and facilitate their cognitive development, as well as a game prop between children and their parents.\nIt is constructed of ABS material.\nThe length of this product is 16.5cm, the width is 5cm and the height is 2.5cm. \nOur product is suitable for kids. It features with English, French and Spanish, interesting sound effect, lighting function.\n\nItem Name: Remote Control Toy\nMaterial: ABS\nBatteries: 2 x AAA Batteries (Not Included)\nFeatures: Educational Teaching, Music, Simulated\nSize Details:\nL: 16.5cm/6.5\", W: 5cm/1.97\", H: 2.5cm/0.98\" (Approx.)\n\nNotes:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\n\nPackage Includes:\n1 x Remote Control Toy"
        },
        {
            "title": "🌷32 Colors🌷DIY 扭扭棒Colourful Chenille Stems, Pipe Cleaners, Craft Stems, Bendable Wire Toys Handmade DIY Craft Supplies",
            "path": "32-ColorsDIY-Colourful-Chenille-Stems-Pipe-Cleaners-Craft-Stems-Bendable-Wire-Toys-Handmade-DIY-Craft-Supplies-i.778855103.18065355611",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-aup4su6mmekvae",
            "price": 571000,
            "location": "Mainland China",
            "rating": 4.545454545454546,
            "sold": 40,
            "description": "💕Hi fans💕\n🔥Welcome to ttsono online store🔥\n✅Let You Experience The Happy Planet\n✅100% preferred Products\n✅Quality Assurance + Price Concessions\n✅Quality Service + Integrity Management\n⚡ Fast shipping ⚡\n\n🌟Diy Colourful Chenille Stems\n✔Color: 32 Kinds\n✔Material: Polyester Wire+Galvanized Iron Wire\n✔Size: 0.6 * 30cm\n✔Applicable Scenarios: DIY, Creative Gifts, Birthdays, Daily Surprises, Blind Boxes, Decoration, Handmade\n👉Rich And Delicate Fluff, High Density, Not Easy To Shed Hair\n👉Variety Shape, Arbitrary Bending, Random Concave Shape\n👉Unlimited Creativity, Inspiring Imagination, The Only Unique Gift\n\n\n🎁🎁 Packing List🎁🎁：\n✅Diy Colourful Chenille Stems *100pcs"
        },
        {
            "title": "DIY Children's Hand-woven Coin Purse Kid Bag Puzzle Felt Cloth Bag Early Education Handmade knitting Wallets School Supplies",
            "path": "DIY-Childrens-Hand-woven-Coin-Purse-Kid-Bag-Puzzle-Felt-Cloth-Bag-Early-Education-Handmade-knitting-Wallets-School-Supplies-i.561005339.15688249462",
            "image": "https://down-sg.img.susercontent.com/file/a64f68a1fc5a3ebd97a76a08360ad5f6",
            "price": 170000,
            "location": "Mainland China",
            "rating": 4.7272727272727275,
            "sold": 21,
            "description": "Why buy from us?\n✔READY STOCK in our store!\n✔SHIP OUT within 1-2 days!\n✔QC our products before ship out!\n✔HAPPY shopping experience!\n✔I do my best to source all the money-valued, quality products to customers like what I do for my family!\n\nDescription:-\n🎗Condition: 100% Brand New, High Quality💯\n🎗Quantity: The price is for 1 piece.\n🎗Type: Early Learning Education Craft Toys\n\n📦Package: 1 plastic needle / some threads / 1 reference picture / double-side tape included/  some cutting parts /  some decorative parts (not every bag has this one)\n \n📣Note:\n📌Please understand that colours may exist little chromatic aberration as the different resolution of monitors and the light brightness, etc. thank you!\n📌There is double-side tape in the package. You don't need to prepare glue.\n\n\n💕Please ADD our store to your FAVORITE STORE list if you like our store!\n\n\n#Wallets #CoinPurse #PuzzleToy #Kids #DIYBag #HandmakeToy #bag #ShoulderBags #MessengerBag #KidBag"
        },
        {
            "title": "1 Set Painting Supplies Kids Pocket Watercolor Painting Book Pocket Water Color Painting Book for Kids Toddler uiran.sg",
            "path": "1-Set-Painting-Supplies-Kids-Pocket-Watercolor-Painting-Book-Pocket-Water-Color-Painting-Book-for-Kids-Toddler-uiransg-i.778792818.23450607516",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lk5co7dsc4hj13",
            "price": 945000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Description\n\nThis exquisite Watercolor Painting Book for children, suitable for children's graffiti and children's drawing learning. The picture book will make your child have more fun. At the same time, the high-grade material makes the book durable, so your children can play with confidence. With a light stroke, exquisite patterns will appear, bringing unlimited fun to your children.\n\nFeatures\n\n-Color:As shown\n-Material:Paper\n-Size:19.00X8.00X1.20cm/7.47X3.14X0.47in\n-Each watercolor book with blank patterns, cartoon and lovely, you kids will like this painting book.\n-The kids watercolor painting book is made of safe and reliable material, thus you can use it at ease.\n-Our DIY Watercolor book is the perfect primer for painting that is very easy to use.\n-Watercolor painting book helps teach color recognition and promotes the use of fine motor skills and hand-eye coordination.\n-Watercolor Painting Book is suitable as novel gifts for children on birthdays, Christmas, Children's Day, holidays and any other occasions.\n1 x Set of Watercolor Painting Book"
        },
        {
            "title": "80G Crushed Glass Stones Resin Filling for DIY Epoxy Resin Silicone Mold Irregular Broken Stone Nail Art Epoxy Crafts Filler",
            "path": "80G-Crushed-Glass-Stones-Resin-Filling-for-DIY-Epoxy-Resin-Silicone-Mold-Irregular-Broken-Stone-Nail-Art-Epoxy-Crafts-Filler-i.187101463.18311988156",
            "image": "https://down-sg.img.susercontent.com/file/c8ebcc81cac81dc787fc9c31af46cd37",
            "price": 502000,
            "location": "Mainland China",
            "rating": 4.708333333333333,
            "sold": 9,
            "description": "Condition: 100% Brand New And High Quality\nColor:As The Picture\nMaterial: Broken Glass Stone\nPackage:80grams crushed stone /box\nFit : Making Materials Handmade DIY Necklace&Bracelet Bangle\n\nShopping Note :As different computers display colors differently, the color of the actual item may vary slightly from the above images, thanks for your understanding"
        },
        {
            "title": "Board For Making Yard MDF Material",
            "path": "Board-For-Making-Yard-MDF-Material-i.872832450.14893396673",
            "image": "https://down-sg.img.susercontent.com/file/470a032c0df9b21821071ae7ab20521e",
            "price": 486000,
            "location": "Vietnam",
            "rating": 0,
            "sold": 0,
            "description": "🎗️Product: MDF board\n\n🎗️ Product properties:\n• • 3mm thick model yard board\n• •Material: Mdf\n• Size: 20cmx20cm - 25cmx25cm - 30cmx30cm - 35cmx35cm - 40cmx40cm - 50cm-50cm\n• •Used To make model yard"
        },
        {
            "title": "Bookmark Homemade by Hand Dried Flower Bookmark DIY Material Package Embossed Plant Specimen Transparent Sticker Relieving Stuffy Handmade/Dry flower handmade DIY bottle self-made plant specimen",
            "path": "Bookmark-Homemade-by-Hand-Dried-Flower-Bookmark-DIY-Material-Package-Embossed-Plant-Specimen-Transparent-Sticker-Relieving-Stuffy-HandmadeDry-flower-handmade-DIY-bottle-self-made-plant-specimen-i.890128855.19578109794",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdx-lfdxrx5f50ajdb",
            "price": 478000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 3,
            "description": "Bookmark homemade by hand dried flower bookmark diy material package embossed plant specimen transparent sticker relieving stuffy handmade"
        },
        {
            "title": "Mohamm Paper Handaccount Cutter Cutting Tool Craft Tools Precision Art Sticker Washi Tape Cutter School Supplies",
            "path": "Mohamm-Paper-Handaccount-Cutter-Cutting-Tool-Craft-Tools-Precision-Art-Sticker-Washi-Tape-Cutter-School-Supplies-i.147398485.7691292730",
            "image": "https://down-sg.img.susercontent.com/file/fb19c0d42935d2096f659ce52db74f6c",
            "price": 90000,
            "location": "Mainland China",
            "rating": 4.894308943089431,
            "sold": 45,
            "description": "Material: PC\nLength: 15.8cm\nSKU: QT295\n\nNotes:\nDue to the light and screen setting difference, the item's color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\nPlease be assured of the quality of our products."
        }
    ]
}