{
    "query": "Electronics and Gadgets",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Double Layers Laptop Accessories Power Adaptor Case Travel Electronic Gadgets Bag",
            "path": "Double-Layers-Laptop-Accessories-Power-Adaptor-Case-Travel-Electronic-Gadgets-Bag-i.808870186.21419159931",
            "image": "https://down-sg.img.susercontent.com/file/82e04c02e2e30c2edecdb7fc8761622f",
            "price": 1122000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Welcome to yueranmaoyi online store.\n\n★ All of our products are free shipping (shipping time: 7-12 days), pls pls get the free shipping ticket before purchase though this link: https://sg.xiapibuy.com/m/free-shipping.\n★ Follow us, you will get a $1.00 voucher for each order.\n★ Any question, please feel free to contact us, we will reply you asap, thanks!\n\nSpecifications:\nMaterial: Oxford\nColor: Black/Grey    \nSize: 23 x 11 x 8.5 cm\nClosure: Zipper \nPackage contains: 1 x Electronics Accessories Travel Organizer\n\nFeatures:\n1. Made of durable, scratch-resistant and easy-to-clean waterproof nylon. \n2. It can hold laptop power supply lead, mouse, cables, chargers and etc. \n3. Keeps bags more organized and perfect fits into your luggage or backpack.\n4. Heavy duty nylon exterior and soft lining offer great protection against scraches, impacts, shocks and splashes. 2 zippers closure ensure all items secure.\n\n#CordTabletHandbagPouch #PortableCarryingPouch #WaterproofCableHandbag #PowerBankCase"
        },
        {
            "title": "Aluminum Alloy Mobile Phone Holder Storage Stand Universal Cellphone Electronic Bracket Support Mount Dorm Supplies",
            "path": "Aluminum-Alloy-Mobile-Phone-Holder-Storage-Stand-Universal-Cellphone-Electronic-Bracket-Support-Mount-Dorm-Supplies-i.284376789.18190959398",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfv-ljced3r4uk9918",
            "price": 423000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Description:\nSturdy material: The phone holder is made of quality aluminum alloy, which is wearable, lightweight, rustproof, ensuring a long service life.\nErgonomic: The cellphone support comes with a proper angle for users to watch movies and play games, making your life more convenient.\nNon-slip: The phone table mount is designed with non-slip surfaces, providing a firm grip with phones, not easy to fall off.\nFit various occasions: The smartphone stand is suitable for bedrooms, living rooms, kitchens, bathrooms, offices, dorms, cars, and more.\nSpecial gift: The phone holder is compatible with most mobile phones and you can send this to your family members and friends on birthdays, holiday events, etc.\nSpecification:\nMaterial: Aluminum Alloy, Silicone.\nSize: Approx. 75x63x75mm/2.95x2.95x2.95 inch.\nColor: Rose Gold, Gold, Silver, Black.\nNote:\nThere might be a few color distortions due to different computer resolutions.\nThere might be a slight error due to different hand measurements.\nPackage Includes:\n1 Piece Phone Holder."
        },
        {
            "title": "Cable Bag Organizer Wires Charger Digital Usb Gadget Portable Electronic Earphone Case Zipper Storage Pouch",
            "path": "Cable-Bag-Organizer-Wires-Charger-Digital-Usb-Gadget-Portable-Electronic-Earphone-Case-Zipper-Storage-Pouch-i.499540054.18888166490",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdn-lg1o837l06df9b",
            "price": 464000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "Hello!Welcome to our store!\nDescription:\nMaterial:Polyester\nColor: As picture\nPackage include: 1pcs\nSize:L*W*H: 20*8*12cm\n(1cm=0.39 inch,1 inch=2.54 cm)\n\nNote:\nThere are 2-3% difference according to manual measurement. please check the measurement chart carefully before you buy the item.\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color which is showed on the pictures. Thank you!"
        },
        {
            "title": "SMILE Storage Bag Travel Electronic Accessories Pouch Digital Gadget Case Power Bank USB Data Cable",
            "path": "SMILE-Storage-Bag-Travel-Electronic-Accessories-Pouch-Digital-Gadget-Case-Power-Bank-USB-Data-Cable-i.461021612.23348762762",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-ljjvh6c5df86bf",
            "price": 1193000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "----Welcome To Our Shop----\nHope to provide you with the best quality products and services.Happy shopping！\n \n100% brand  and high quality.\nMade of high quality polyester material with a soft touch.It's durable and anti-wrinkle.Its color fastness is high, and won't fade easily.\nThree layer design,sufficient capacity to hold stuffs.Has multiple types of inner pockets for electronics accessories and cables organization.\nInside the travel organiser there are removable belts for changing the layout of the cable organiser bag as your idea.\nWaterproof electronics accessories travel organiser can protect your stuffs well in humid conditions,and in the one of the three layers.\nIt can fit your tablet computer, power bank, mobile phone charger, data cable, laptop adapter, earphone, HDD and etc.\nSpecifications:\nMaterial: Polyester\nSize: 27*20*9cm / 10.63*7.87*3.54inch\nColor: Black, Grey, Purple, Navy Blue, Light Blue, Wine Red\n\nPackage included:\n1 * Storage Bag\nStorage Bag Organizer USB Data Cable Earphone Power Bank HDD Cover Electronic Accessories Pouch Digital Gadget  Travel Three-Layer Portable\n \nBetter life, you need high quality!\nWe do not sell low quality products, our purpose is helping you buying most affordable and high quality products!!!\n! ! ! Note: The gold, diamond, gemstone material products in our store are all electroplated/man-made"
        },
        {
            "title": "Three-layer Digital Bag Multifunctional Data Cable Mobile Power Headphone Storage Bag Travel Electronic Digital Gadget Bag Organizer USB Storage Bag Large Capacity Cable Organizer",
            "path": "Three-layer-Digital-Bag-Multifunctional-Data-Cable-Mobile-Power-Headphone-Storage-Bag-Travel-Electronic-Digital-Gadget-Bag-Organizer-USB-Storage-Bag-Large-Capacity-Cable-Organizer-i.736881392.14071295620",
            "image": "https://down-sg.img.susercontent.com/file/d94605a26673fe74952700a9d0a53a89",
            "price": 1431000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 1,
            "description": "This travel electronic pouch is made of heavy-duty, durable and water-resistant nylon fabric, easy to clean. Two-way zippe closure eure your item secure.\n\nReliability starting from fabric selection, offer excellent fibre strength, sustainability, water repellent performance, 30% better than nylon. You will be surprised about the texture when receiving our electronics organizer.\n\nWith therapiddevelopmentofelectronicsandmobile device, charger for iphone, cable, etc. are portable, if you miss any of them by accident, it will be trouble. Buy one electronics organizer bag and enjoy your life.\n\nUSB Flash Drives Data Earphone Cable Case Organizer Bag Digital Storage Pouch.For various cable, power bank, flash drive, memory card, SD cards.\n\nMaterial: made of waterproof cationic polyester.\n\nSize: 28cm x 21cm x 9cm"
        },
        {
            "title": "baona Chargers Wire Case Travel Electronic Accessories Organizer Pouch Gadget Bag Earphone Cable Power Bank Storage Bag",
            "path": "baona-Chargers-Wire-Case-Travel-Electronic-Accessories-Organizer-Pouch-Gadget-Bag-Earphone-Cable-Power-Bank-Storage-Bag-i.40170799.17166078723",
            "image": "https://down-sg.img.susercontent.com/file/06bf29d834a1bfe334f163874cc3a7c4",
            "price": 540000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 2,
            "description": "baona Laptop Chargers Case Travel Electronic Accessories Organizer Pouch Gadget Bag Earphone Power Bank Storage Bag\n\n【HIGN QUALITY MATERIAL】Made of durable and waterproof nylon - Scratch resistant and easy to clean.\n【GOOD PARTNER】It can hold laptop power supply lead, mouse, cables, chargers and etc. - perfect for travel and easily fits into your luggage, backpack.\n【MULTIPLE FUNCTIONS】Also can fill it basic first aid items, make up, toiletries when you travel.\n\nSpecification\nDimensions: 15.5*10.5*4.5 cm\nWeight: 0.1kg\nMaterial: Nylon / Oxford\n\nSet yourself free\nAre you troubled about jumbled cables? Do you root around(or often tip out all your items) in the search for the right cable?\n【baona】 bag are perfect to store your electronics accessories without searching all over the place.\n\nPackage contains\n1 x Electronics Accessories Travel Organizer Bag"
        },
        {
            "title": "Beg Alat Digital Elektronik Perjalanan Travel Electronic Digital Gadget Bag Multi-function Accessories Cable Organizer",
            "path": "Beg-Alat-Digital-Elektronik-Perjalanan-Travel-Electronic-Digital-Gadget-Bag-Multi-function-Accessories-Cable-Organizer-i.268032611.18289683732",
            "image": "https://down-sg.img.susercontent.com/file/my-11134207-7qula-lislhyp1s2g3da",
            "price": 918000,
            "location": "Malaysia",
            "rating": 0,
            "sold": 0,
            "description": "Cable Gadget Bag\n\nModel: Small\nDimension: 20 x 14 x 4cm\nShape: Handbag\nMaterial: Polyester\nFunction: storage, wear-resistant, burden reduction\nApplicable scene: business trip\nStorage scene: travel storage\nScope of application: data cable, mobile phone cable, power bank\nStyle: simple and modern\n\nFeature:\n-Drop Protection: Our Electronic Organizer Pouch Bag is equipped with a well-padded semi-flexible interior, which provides excellent protection for your gadgets from scratches, dust, bumps and accidental drops.\n-High-Quality Material: This Portable Cable Digital Storage Bags Organizer is made of high-quality material, which is waterproof, shockproof, and durable for your long-lasting use.\n-Dual Compartment Design: The Travel Electronics Organizer Bag comes with 2 compartments, which are perfect for power bank, drive, cable, earphone, and connector adapter, and it is also suitable for pens, pencils, highlighters, gel pens and erasers.\n-Easy to Carry: The Small Electronics Accessories Storage Pouch has a compact arrangement, which can maximize your storage space. You can easily slip it into a backpack or take it with you.\n-Large Capacity: The Multifunctional Travel Cable Bag Organizer has a built-in storage method including mesh, elastic band, zipper, etc., you can have more space to store your small items, and the types of small items are also more diversified."
        },
        {
            "title": "Travel Accessory Cable Bag Portable Digital USB Electronic Organizer Gadget Case Travel Cellphone Charge Mobile Charger Holder",
            "path": "Travel-Accessory-Cable-Bag-Portable-Digital-USB-Electronic-Organizer-Gadget-Case-Travel-Cellphone-Charge-Mobile-Charger-Holder-i.768906367.18574531366",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-mt3v2wtnd1nv4b",
            "price": 853000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Size:21 x 14cm(8.27 x 5.51inch) \nFeatures: \n-Small size, easy to carry \n-Suitable for the scene: home, travel, work \n-Suitable for storage: charger, headphone cable, mouse, USB, small cosmetics, mobile phone, etc. \n\n\n[NOTE]: \n\n-As a result of manual measurement, please allow 1-2cm error. \n\n-Due to the different lighting during the shooting, the picture color is slightly different from the actual product.\n\n\n\n\n\n☆☆☆Welcome to Our Store Toker New☆☆☆\n\n\n\n\n\n\n\n○ ALL STOCK IN OUR STORE ARE HIGH QUALITY PRODUCT \n○ Any question can inbox chat with US\n○ All parcels will ship in 48H after you order\n○ SELLER CAN'T CHANGE BUYER ADDRESS, IF YOU PLACE A WRONG ADDRESS , Please Re-order with New Address\n○ Apologise for any incovinese caused\n○ Service Hours: 9 a.m. - 9 p.m."
        },
        {
            "title": "CanvasArtisan Colorful Letter Art Digital Electronic Wire Gadget Organizer Pouch Case Travel Phone Power Bank Earphone Cable Storage Bag",
            "path": "CanvasArtisan-Colorful-Letter-Art-Digital-Electronic-Wire-Gadget-Organizer-Pouch-Case-Travel-Phone-Power-Bank-Earphone-Cable-Storage-Bag-i.40170799.20248790649",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22090-7uv01f97dthvc2",
            "price": 756000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "FEATURE:\nHigh quality material,soft and durable\nperfect to store your daily accessories\n\nSpecification\nMaterial:Polyester\nTotal Size:20*12*3 cm\n\nPackage contains\n1 x digital organizer pouch"
        },
        {
            "title": "DoomHot Travel Storage Bag Portable Double Sided Gadget Bag Electronic Digital Organizers Multi-function USB Storage Bag Large Capacity Cable Organizer Bag",
            "path": "DoomHot-Travel-Storage-Bag-Portable-Double-Sided-Gadget-Bag-Electronic-Digital-Organizers-Multi-function-USB-Storage-Bag-Large-Capacity-Cable-Organizer-Bag-i.340956198.5365305688",
            "image": "https://down-sg.img.susercontent.com/file/0cd08d69c3aea2a15421bbb9ea258045",
            "price": 658000,
            "location": "Mainland China",
            "rating": 4.9,
            "sold": 4,
            "description": "❤❤❤Welcome to DoomHot, I wish you have a happy shopping❤❤❤\n\nBrand：DoomHot            \nProduct Name：Travel Storage Bag\nMaterial：Polyester \nColor：Gray/Black/Blue\n\nPackage include：1 x Storage bag\n\n\nFeature:\n\n1.DOUBLE SIDED STORAGE- The electronic accessories organizer has large capacity to hold various items like cables, flash disk, USB drive, Power bank, Headphone, etc. Also it can be used as Travel Case, Cosmetic Bag, Baby Health Care or Grooming Kit.\n\n2.DURABLE MATERIAL- Well padded semi flexible covers offer excellent protection for your electronic accessories. Wear-resistant, easy to clean for long term usage.\n\n3.PORTABLE & EASY TO USE- Double zipper design, easy opening and immediate access. A hand strap for you to carry it anywhere with cables, charges in place to ensure you a tidy life. Perfect size easily fits into your briefcase, luggage, backpack.\n\n4.PROTECTION FUNCTION- Spacers, lats and meshes secure the electronics to prevent collisions and protect your belongings.\n\n\nFeedback:\n\n(1) If you are satisfied with our products, please give us a positive feedback (five stars).\n\n(2) If you're not satisfied,please contact us before leaving any negative feedback or causing controversy on Shopee.Please give us a chance to solve any problems.we will do our best to solve the problem."
        },
        {
            "title": "Electronic Drawing Board 16inch Slate Magic Blackboard Drawing Tablet Board Big Size LCD Writing Tablet Kids Toys for Children/Kids Drawing Board",
            "path": "Electronic-Drawing-Board-16inch-Slate-Magic-Blackboard-Drawing-Tablet-Board-Big-Size-LCD-Writing-Tablet-Kids-Toys-for-ChildrenKids-Drawing-Board-i.51134277.19675247703",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23030-2h0xeugzebov6c",
            "price": 2108000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Information:\nMaterial : Plastic\nRecommend Age : 25-36m\nRecommend Age : 4-6y\nRecommend Age : 7-12y\nRecommend Age : 12+y\nRecommend Age : Maternity\nModel Number : erase board\nWarning : Don't eat\nGender : Unisex\nType : Drawing Board\nClassification : Drawing Board\nSize : 16 inch\nType : colorful display and one color display\nFrame Color : green,red,white,black,pink,blue\nfor : Kids,student,Adults,Office\n89086Here are more styles of toys \nMaterial:LCD+ABSSize:36*23.2*1cm\nFeature : LCD drawing Tablet\nFeature 2 : Electronic Drawing Board\nFeature 3 : Digital Handwriting Pad\nFeature 4 : Graphic Tablet\nFeature 5 : Drawing pad\n\nStyle:\n16-inch monochrome handwriting pink,\n16-inch color handwriting black, \n16-inch monochrome handwriting black, \n16-inch color handwriting sky blue, \n16-inch monochrome handwriting sky blue；\n\nColor:pink frame,black frame,sky blue frame\nType:Color display and monochrome display.\n\nFeatures:\n1.LCD writing tablet is the best gift for kids' birthday, Thanksgiving, Christmas, and any occasion. \nEvery little doodler should have one! It can be used as a drawing board, notepad, memo board, office writing board, graphic aids, writing pad, and so on. \nIt's a suitable educational learning toy for toddlers.\n\n2.Derabika drawing board adopts the unique LCD pressure-sensitive technology, 50% brighter upgraded screen impresses colors. \nRainbow colors will be shown more obvious under strong light and provide better visibility for toddlers doodling.\n3.LCD drawing tablet is radiation-free and eye protected. NO BLUE LIGHT or glare harm kids' eyes. It's 100% safe and healthy for child long time use.\n4.One button lock function can protect your work from removing accidentally. Built-in battery for at least 12 months lifespan and extra one as a replacement.\n5.Writing tablet provides a preschool learning experience for kids. A great learning toy gift for kids to nurture their creativity by doodling. Parents can also use this doodle board to teach kids math, numbers to enjoy parent-child time.\n6.At the same time, the 16 inch super size is also very suitable for office use.\n\nProduct Details:\n(1)LCD flexible LCD screen\n(2)ABS reinforced frame\n(3)Smooth Writing\n(4)One key delete button\n(5)One-key lock screen switch\n(6)2pcs button battery included\n\nPackage Includes:\n1*16 Inch Drawing board\n1*pen(with box)"
        },
        {
            "title": "Electronics Accessories Bag Double Layer Gadget Organizer for Cables, Chargers, USB, SD Card, Power Bank, Phone, Mouse",
            "path": "Electronics-Accessories-Bag-Double-Layer-Gadget-Organizer-for-Cables-Chargers-USB-SD-Card-Power-Bank-Phone-Mouse-i.275574613.23737070955",
            "image": "https://down-sg.img.susercontent.com/file/dbbdf25ed61d7ab8148bac8bba894807",
            "price": 1059000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Welcome to Yimoying online store.\n\n💕 All of our products are free shipping (shipping time: 7-12 days), pls pls get the free shipping ticket before purchase though this link: https://sg.xiapibuy.com/m/free-shipping.\n💕 Follow us, you will get a $1.00 voucher for each order.\n💕 Any question, please feel free to contact us, we will reply you asap, thanks!\n\nSpecification:\n★Material: durable and waterproof nylon fabric\n★Size: 9.3 x 6.9 x 2.17 Inch (23.7 x 17 x 5.5 cm)\n★Weight: 175 g \n★Color: Grey, Pink, Black and Dark Blue\n\n-------------Our Electronics Organizer Features------------------------\n★Heavy duty nylon exterior and soft lining interior offer great protection against scratches, impacts, shocks and splashes.\n★The cord bag has enough roomy to hold various items like cables, flash disk, SSD, Cords, Memory Cards, USB drive, Power, Charger, passport, Adapters ,Pens, Headphone.\n★Electronic organizer for office use and traveling, and keep your important devices in reach. \n★High wears resistance, strong shrinkage, strong and durable,it does not deform its shape easily after stretching or applying it for a long time.\n\n#TravelCableCordBag #GadgetGearStorageCases #CableOrganizer #ElectronicOrganizer #ElectronicsAccessoriesCases #ElectronicsTravelOrganizer #CableStorageBag"
        },
        {
            "title": "Multi-function Digital Package Travel Storage Bag Kit Data Cable Electronic Digital Gadget Divider Organizer Containers",
            "path": "Multi-function-Digital-Package-Travel-Storage-Bag-Kit-Data-Cable-Electronic-Digital-Gadget-Divider-Organizer-Containers-i.74542442.2648963493",
            "image": "https://down-sg.img.susercontent.com/file/b1ab4f4fbfb04eb8a890a400c4bcbaf6",
            "price": 814000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "✅ Ready Stock & Ship within 1-3 Days!\n✅ Wholesale are welcome!  \n✅ Follow us for more happening deals!\n\n100% Brand new and high quality!\nSize 24.5*18*10cm"
        },
        {
            "title": "Travel Cable Organizer Electronic Accessories Digital USB Gadget Organizer Charge bag",
            "path": "Travel-Cable-Organizer-Electronic-Accessories-Digital-USB-Gadget-Organizer-Charge-bag-i.300523632.5353642835",
            "image": "https://down-sg.img.susercontent.com/file/8de676abb407601a6da4dba7c2e471a2",
            "price": 483000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 1,
            "description": "Specifications:\nElectronics Cable Organizer Bag for HDD / Hard Disk / MP5 / Electronics Cable Case \n-Color: Cartoon pattern\n-Material: PU + EVA\n-size: 13.5cm/5.31\" Width: 9.5cm/3.74\" Thickness: 3.5cm/1.38\"\nProvides protection to your Electronics against unwanted scratches and damages\nPoly, Shockproof, anti-scratch and abrasion resistant\nZipper closure design for easy opening and closing\n\n\nPackage Included:\n1 x Carrying Case\n\n#Crayon Shin chan case #StorageCase #EarphoneStorageBagBox #Cable #Headphones #Earphone #earphonecase #original #cablestorage #CasesCovers #EarphoneHolder #storageboxes #ministoragebag #MiniSquareCase #roundbox"
        },
        {
            "title": "Electronic Fart Prank Gadgets Wireless Farting Tricky Toys for Trick Spoof Gifts [CrazyMallueb.sg]",
            "path": "Electronic-Fart-Prank-Gadgets-Wireless-Farting-Tricky-Toys-for-Trick-Spoof-Gifts-CrazyMalluebsg-i.81107657.21989702601",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd6-lhwyv4nrlhg324",
            "price": 1243000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": " Electronic Fart Prank Gadgets Wireless Fart Sound Machine Novelty Sounds Simulated Device Remote Control for Trick Spoof Gifts \n Feature:\n1. Realistic Effect: This fun farting machine not only uses a hi-fi chip to simulate the exact sound of farting, but can also adjust the frequency, duration and size for the most realistic effect. It is the top choice for funny tricks and spoof gifts.\n2. Different Atmosphere and Different Sounds: The electronic fart prank gadget can imitate different types of farting sounds to create different atmospheres, such as making a hoarse sound to show fatigue, making a wide sound to show happiness, and even imitating real animal noises. It can also be adjusted for frequency, duration and size in order to get the most authentic feeling of farting. Bring you different happiness\n3. Easy to Use and Place: This mini farting sounds simulated device has a remote control button that is easy to use and easy to place. Not only is it compact and portable, but it is also easy to operate. Users can adjust the intensity, duration and sound at will, making the fart machine perfect for any environment. It can also be paired with different types of accessories for more functions, thus making farting more flexible.\n4. Creative April Fool's Day and Christmas Gifts: This wireless fart sound machine is a very creative gift to give on April Fool's Day or Christmas. It has a unique design, exquisite and special appearance, can surprise your recipients! Good for pranks and pranks.\n5. Remote Control: This fart sound simulator comes with a remote control. You can control it remotely. No one will find out. Bring you happiness.\n\n Specification:\nRecommend Age: 18+,7-12y,14+y,12+y\nCertification: NONE\nOrigin: Mainland China\nMaterial: Plastic\nBattery: AA * 4 (not included)\nDimensions: 11.6 x 9.3 x 3.8cm/4.6 x 3.7 x 1.5in\nMfg Series Number: TOY\nModel Number: Remote Control Fart Box\nGender: Unisex\nUse: Funny trick/Gag gift/Remote control farts/Christmas funny gift\n\nNote:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\n\n\n Included: \n\n1 x Farting Sound Machine\n1 x Remote Control"
        },
        {
            "title": "Electronic Fart Prank Gadgets Wireless Farting Tricky Toys for Trick Spoof Gifts",
            "path": "Electronic-Fart-Prank-Gadgets-Wireless-Farting-Tricky-Toys-for-Trick-Spoof-Gifts-i.206473597.16997684892",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf3-lhn1hwuec9ih80",
            "price": 1180000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": " Electronic Fart Prank Gadgets Wireless Fart Sound Machine Novelty Sounds Simulated Device Remote Control for Trick Spoof Gifts \n Feature:\n1. Realistic Effect: This fun farting machine not only uses a hi-fi chip to simulate the exact sound of farting, but can also adjust the frequency, duration and size for the most realistic effect. It is the top choice for funny tricks and spoof gifts.\n2. Different Atmosphere and Different Sounds: The electronic fart prank gadget can imitate different types of farting sounds to create different atmospheres, such as making a hoarse sound to show fatigue, making a wide sound to show happiness, and even imitating real animal noises. It can also be adjusted for frequency, duration and size in order to get the most authentic feeling of farting. Bring you different happiness\n3. Easy to Use and Place: This mini farting sounds simulated device has a remote control button that is easy to use and easy to place. Not only is it compact and portable, but it is also easy to operate. Users can adjust the intensity, duration and sound at will, making the fart machine perfect for any environment. It can also be paired with different types of accessories for more functions, thus making farting more flexible.\n4. Creative April Fool's Day and Christmas Gifts: This wireless fart sound machine is a very creative gift to give on April Fool's Day or Christmas. It has a unique design, exquisite and special appearance, can surprise your recipients! Good for pranks and pranks.\n5. Remote Control: This fart sound simulator comes with a remote control. You can control it remotely. No one will find out. Bring you happiness.\n\n Specification:\nRecommend Age: 18+,7-12y,14+y,12+y\nCertification: NONE\nOrigin: Mainland China\nMaterial: Plastic\nBattery: AA * 4 (not included)\nDimensions: 11.6 x 9.3 x 3.8cm/4.6 x 3.7 x 1.5in\nMfg Series Number: TOY\nModel Number: Remote Control Fart Box\nGender: Unisex\nUse: Funny trick/Gag gift/Remote control farts/Christmas funny gift\n\nNote:\nDue to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!\nPlease allow 1-2cm measuring deviation due to manual measurement.\n\n\n\n\n Included: \n\n1 x Farting Sound Machine\n1 x Remote Control"
        },
        {
            "title": "《Mega Deal》Travel Electronic Bags Gadget Organizer Bag USB Cable Storage Pouch Large Cable Organiser Bag Accessories",
            "path": "Mega-DealTravel-Electronic-Bags-Gadget-Organizer-Bag-USB-Cable-Storage-Pouch-Large-Cable-Organiser-Bag-Accessories-i.199250845.22518530777",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdl-lfnw8bd4g4ht5f",
            "price": 702000,
            "location": "Malaysia",
            "rating": 0,
            "sold": 0,
            "description": "Travel Electronic Digital Gadget Bag Organizer USB Storage Bag\n\n\n\nProduct Details:\n\nColours: Black / Navy Blue / Purple / Sky Blue / Red / Grey\n\nDimension: 24.5cm x 10cm x 18.5cm\n\nWeight: 0.2kg\n\nMaterial : Waterproof Cation 300D Fabric\n\n\n\nProduct Features:\n\n- This storage bag is made of high quality material, waterproof, dust-proof and durable Waterproof Cation 300D Fabric\n\n\n\n- Lightweight and easy to carry, perfect size to fits into your briefcase, luggage and backpack\n\n\n\n- Large capacity, enough space to store your daily electronic accessories like, chargers, cables, powerbank, headphones, electronic adapters, flash drive, memory card, SD cards & etc.\n\n\n\n- The gadget storage bag comes with adjustable padded divider\n\n\n\n- Keep your cables, charges and headphones separately in different slot, easy to access them\n\n\n\n- Ideal for travel, staycations, camping, hiking, home use, gym or other outdoor trips\n\n\n\nPackage include:\n\n1 x Travel USB Electronic Gadget Storage Bag"
        },
        {
            "title": "✨Travel Organizer Bag Storage Bag Portable Gadget Bag Electronic Digital Waterproof Storage Bag",
            "path": "Travel-Organizer-Bag-Storage-Bag-Portable-Gadget-Bag-Electronic-Digital-Waterproof-Storage-Bag-i.450343293.23269466022",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvea-lhen0ssanxcj38",
            "price": 531000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Product Name：Travel Organizer Bag \nMaterial：Polyester\nColor：Black/Dark Gray/Light Gray/Navy Blue/Pink\nSize： Medium：20cm * 5cm * 12cm\n             Large： 25cm * 6cm * 12cm\n           \n\nPackage include：1 x Storage bag"
        },
        {
            "title": "Organizer Bag Electronic Gadget Storage Bag",
            "path": "Organizer-Bag-Electronic-Gadget-Storage-Bag-i.319145802.19071634070",
            "image": "https://down-sg.img.susercontent.com/file/55a22c34c341ae33000fa4e64bfffa4e",
            "price": 421000,
            "location": "Indonesia",
            "rating": 0,
            "sold": 0,
            "description": "Universal Charger Cable Organizer Pouch Bag Anti Shock Case 19 x 10cm\n\n1x piece\nColor BLACK\nMeasurement: 19 x 10 x 4cm\n\nSpecifications:\nHigh-grade EVA + faux leather made, with great shockproof function.\nInner mesh pocket design enable you to best classify and fix.\nPortable storage bag to carry for travel or business.\nPerfect storage bag for cable, charger, cosmetic and other items.\n\nItemname: Storage Bag\nMaterial: EVA + Faux Leather\nFeatures: Portable, Lightweight, Anti-Scratch, Durable, Inner Mesh\nSize: 19cm x 10cm x 4cm/7.48\" x 3.94\" x 1.57\" (Approx.)\n\nNotes:\nDue to the light and screen setting difference, the items color may be slightly different from the pictures.\nPlease allow slight dimension difference due to different manual measurement.\n\nPackage Includes:\n1 x Storage Bag (Other Accessories Not Include)\n\nImported"
        },
        {
            "title": "Travel Electronic Cable Digital Storage Bag Portable Women‘s Men's Wires Charger USB Earphone Gadget Organizer Case",
            "path": "Travel-Electronic-Cable-Digital-Storage-Bag-Portable-Womens-Mens-Wires-Charger-USB-Earphone-Gadget-Organizer-Case-i.116342517.1915159103",
            "image": "https://down-sg.img.susercontent.com/file/6c17263d107b97c1060842022b2a170b",
            "price": 465000,
            "location": "Mainland China",
            "rating": 4.86697247706422,
            "sold": 2,
            "description": "[Specification]\n[Material]: Oxford  \n[Features]:\n-1. Layered storage, clear classification and not messy\n-2. Solid zipper, smooth and easy to pull\n-3. Can accommodate data cable headset U disk charging treasure, etc.\n-4. Is a good helper on your journey\n[Package Included]: 1Pcs x Organizer Bag \n[Note]:\n- Due to different producing batches, product details might be a little different. If you minding the difference, please buy it carefully.\n- Please allow 1-3CM differs due to manual measurement.\n- Due to the different display and different light, the picture may not reflect the actual color of the item. Thanks for your understanding.\n\n#handbags#storage bag#organizers#organizer bag#zippered bags#bag for wires#zip bag#bolsa almacenamiento#trolly bag for traveling#travel kit#traveling bag#travel#travel bag organizer#zip packs#ziplock bag#zip bags#zip package#zippered bags#cable organizer bag#"
        }
    ]
}