{
    "query": "Food and Gourmet Gifts",
    "region": "Singapore",
    "total": 91,
    "results": [
        {
            "title": "Crazy Ass 2 Hot Sauce Gift Set - Gourmet Challenge Dice Game - Prefect Premium Gourmet Gifts for Men - Try If You Dare!",
            "path": "Crazy-Ass-2-Hot-Sauce-Gift-Set-Gourmet-Challenge-Dice-Game-Prefect-Premium-Gourmet-Gifts-for-Men-Try-If-You-Dare-i.255746938.7968749036",
            "image": "https://down-sg.img.susercontent.com/file/5b0d7869770761fe40f267f78b000aa5",
            "price": 6999000,
            "location": "SG",
            "rating": 0,
            "sold": 1,
            "description": "THIS ULTIMATE HOT SAUCE GAME SET INCLUDES: 12 – .75oz - bottles of the hottest hot sauces, peppers and powders in the world. Each Crazy Ass hot sauce adds an additional ingredient to the recipe to increase the heat level for a total of 12 sauces. Try all 12 if you dare!\n\n\nHOW TO PLAY: This is pretty much a twisted version of the classic game of dice but with a set of the hottest hot sauces around. Just roll both dice and taste the hot sauce that number corresponds to. Challenge yourself to try all the sauces or play with others until there’s 1 crazy ass left standing!\n\n\nTOP-NOTCH QUALITY: These hot sauces are made using the hottest peppers in the world like habanero peppers, ghost peppers, scorpion peppers and Carolina reaper peppers. Made with premium quality ingredients, this is one of the best gourmet hot sauce kits on the market today. Don't believe it? Just check out the reviews!\n\n\nTHE GIFT SET FOR CRAZIES: Can't figure out what to get the daredevil in your family this holiday season? Well, we've got an idea. Get them this ultimate game set meant for crazies who love a good dare. With flavors that range from MILD to KICK YO' ASS HOT these hot sauces are not for the weak. Only play the game if you can handle the hellfire heat or if you're just plain stupid!\n\n\nGAME-NIGHT FAVORITE: With the hottest hot sauce kit around, this gift set was made to be played by friends! What better way to entertain guests at your next party than by challenging them to try all 12 flavors. Never again will your weekly family game-night be a borefest with this ultimate game of dice.\n\n\n\n\nCHALLANGE: yourself or a friend to make it through all 12 – 0.75-ounce hot sauce bottles from MILD to KICK YO' ASS HOT!\n\nHOT SAUCE DICE GIFT SET: Whether you’re looking for personalized hot sauce gifts for the Hot Sauce lovers in your life or you’re just looking for delicious sauces with heat, this will sure be a hit!\n\nQUALITY: This is one of the best superior quality gourmet hot sauce kits on the market today and probably the last hot sauce gift kit you will need to ever try! Just check our reviews.\n\nPERFECT: for the fans of spice and the heat experience with an unmatched flavor profile! Makes an excellent gifts for men.\n\nFLAVOR: These hot sauce's add an incredible layer of flavor to meat, chicken, seafood, eggs, gravy, and vegetable dishes.\n\nCrazy Ass 2! Play this Crazy Ass Challenge by yourself or your friends & family! Roll the 12 sided die and taste the hot sauce of that corresponding number. How Crazy are You? Each sauce adds an additional ingredient to the recipe to increase the heat level. (12 Sauces total!)\n\nHello! Welcome to Missy Mart, We bring in affordable, high quality goods that cater to your needs. All the products are IN-STOCK and will reach within 1-3 working days. Get your products fast and in of best quality! We appreciate your support and hope you are enjoying a good time shopping :)"
        },
        {
            "title": "⚡FLASH SALE⚡Mini Bowl Imitation Foods Keychain Pocket Festival Food Festival Gift Gourmet Accessories Pendant on Tongue ",
            "path": "FLASH-SALEMini-Bowl-Imitation-Foods-Keychain-Pocket-Festival-Food-Festival-Gift-Gourmet-Accessories-Pendant-on-Tongue-i.604798004.16588800061",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-pfm9mcaduajv71",
            "price": 783000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "🎁🎁Welcome to SugE and choose us！！！🎁🎁\n\n🌈READY STOCK! All items in shop are brand new and good quality！🎈🎈\n\n🌈→ 100% brand new\n🌈→ All products are in stock\n🌈→ We are overseas sellers and will send the package within 1-2 days after you place the order\n🌈→ If your phone address is wrong, please cancel the order and place the order again\n🌈→ If you have any questions, please chat and contact our customer service, we will give you the most satisfying answer and handling method\n Do not make bad reviews and refunds at will, peace buy and sell, profit from both parties❤\n❤Remember to leave a message about the style and size or screenshot of the order to us before it can be delivered to the warehouse on time for the baby\n❀More styles can be checked in the store to continue with new products.\nBrand：Bp\nMaterial：Resin\nProduct Type：Faux Food Series\n\n🙋‍♀️Reminder:\n\n🛩️ ship within 1-3 days of ordering, and you will receive the goods in about7-10 days\n☎️ please confirm your mobile phone number and address before placing an order\n\n\n🙅‍♀️if you receive any problems in your product, please don't give a star first or a bad opinion you can contact us customer service, we will be the first time for you to resolve.I hope that good service can let you continue to buy back. We are always waiting for my dear.\n🙆‍♀️If the product is normal and there is no problem, please leave a comment and give a 5-star rating. ⭐⭐⭐⭐⭐Thank you. Every comment is important to the store.\n\n😜Thank you for your support and understanding.\n\nIf you encounter any problems, please communicate with customer service in time。\n\nPay attention to the store and constantly update new products every day。"
        },
        {
            "title": "[FREE Gift] Fresh Fried Ants Grasient Instant Snacks Remove Wings Locusts Spicy Pepper Salt Snacks Insect Gourmet Fresh Spicy Little Crab Ready to Eat",
            "path": "FREE-Gift-Fresh-Fried-Ants-Grasient-Instant-Snacks-Remove-Wings-Locusts-Spicy-Pepper-Salt-Snacks-Insect-Gourmet-Fresh-Spicy-Little-Crab-Ready-to-Eat-i.991621090.22071772490",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdc-lid37qgiuzjg71",
            "price": 2111000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Place Of Origin: Mainland China/Henan Province/Shangqiu City\nPlace Of Origin: Henan Province\nNet Content: 30g\nPacking Method: Bag\nProduction Date: 2023-05-29\nShelf Life: 18 Days\n💋Welcome To My Shop💐\n🌹Our Products Are Shipped From China\n🌸The Products In This Store Are All In Stock\n🌸Please Pay Attention To The Small Hands Who Make A Fortune In Person, Pay Attention To The Store, Pay Attention To Polite\n🌸If There Is Any Good Product, I Will Push It To You As Soon As Possible ^.^\n🌸It Will Be Sent Out Within 1-2 Days After The Order Is Placed, And It Can Be Delivered Within 7-15 Days After The Normal Logistics And Transportation ^.^\n🌸If You Have Any Questions, You Can Contact Customer Service, We Will Give You The Best Shopping Experience ^.^"
        },
        {
            "title": "Natures Gift Gourmet - Chicken and Duck Loaf Style 100g",
            "path": "Natures-Gift-Gourmet-Chicken-and-Duck-Loaf-Style-100g-i.264125905.3361772867",
            "image": "https://down-sg.img.susercontent.com/file/9b1703b53a8171f66cf10dbd1dd023e5",
            "price": 165000,
            "location": "SG",
            "rating": 5,
            "sold": 8,
            "description": "Features:\nReal food, made from delicious natural ingredients with vitamins & minerals to keep your dog healthy & happy, with a delicious taste they will love. - 100% Australian Meat- Essential Nutrients for everyday health- 100% Complete & Balanced- No artificial preservatives, colours or flavours\n\nIngredients:\nMeats (chicken, lamb, duck, and/or beef and or pork and/or turkey), Gelling agents, Flavours, Starch, Vitamins & Minerals, Inulin, Oil\n\nAnalysis: \nCrude protein 8% \nCrude fat 4%\nMetabolisable Energy 75kCal/100g\n\nSize:\n100 grams\n\n*Product image and information are correct at the time of publishing on this website. For the most accurate information and image, please refer to the actual product."
        },
        {
            "title": "[Easy side dish assorted with Hokkaido Retort Food Range Hot Side Side Fish Fish Side Best Fish Side dish Debus Gourmet Gourmet Gourmet Gourmet Assorted Disaster Emergency Emergency Food Presentation Food Gift Present Simple side dish countermeasures (ⓐ 1",
            "path": "Easy-side-dish-assorted-with-Hokkaido-Retort-Food-Range-Hot-Side-Side-Fish-Fish-Side-Best-Fish-Side-dish-Debus-Gourmet-Gourmet-Gourmet-Gourmet-Assorted-Disaster-Emergency-Emergency-Food-Presentation-Food-Gift-Present-Simple-side-dish-countermeasures-1-i.981990758.15198827492",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lh2r9jj0snc365",
            "price": 7074000,
            "location": "Japan",
            "rating": 0,
            "sold": 0,
            "description": "[Easy side dish assorted with Hokkaido Retort Food Range Hot Side Side Fish Fish Side Best Fish Side dish Debus Gourmet Gourmet Gourmet Gourmet Assorted Disaster Emergency Emergency Food Presentation Food Gift Present Simple side dish countermeasures (ⓐ 1 set / 12 pieces + 1 canned)\n\nName of product type: Hokkaido specialty - 12 retort pcs. stewed vegetables, 1 can set\nSeafood used in the product: Sanma, Iwashi, Hokke, Saba, Scallops, Komai, simmered with miso, simmered with black vinegar, simmered with ginger, simmered with water, basil, butter, soy sauce, red snow crab flakes.\nProduct Production/Processing Area: Nemuro City, Hokkaido\nVolume: 40-90g (Varies depending on the product. See separate product content)\nShelf life: 180 days from manufacture *Please store away from high temperatures and direct sunlight.\nThoroughly selected authentic ingredients vacuum-packed in a retort for long-term preservation.\nProduced and manufactured in Hokkaido. All fish are from Hokkaido. Fresh fish landed in Hokkaido is purchased directly at the market, manufactured and retorted at a factory in Hokkaido. This ensures that the original flavor and nutrients of the fish are preserved."
        },
        {
            "title": "Nature's Gift Gourmet Real Chicken Wet Dog Food/Nature's Gift Gourmet Succulent Lamb (Loaf Style) 100G",
            "path": "Natures-Gift-Gourmet-Real-Chicken-Wet-Dog-FoodNatures-Gift-Gourmet-Succulent-Lamb-Loaf-Style-100G-i.955359148.22473238934",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvew-lj27ynai1w8jc9",
            "price": 649000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Real Food, made from delicious Natural Ingredients. Made for your dog. We always start with 100-Percent fresh Australian Meat."
        },
        {
            "title": "Simply Hamper Food Hamper Gift Set - Decadent Chocolates, Crispy Treats, Gourmet Snacks, and More! Perfect for gifts",
            "path": "Simply-Hamper-Food-Hamper-Gift-Set-Decadent-Chocolates-Crispy-Treats-Gourmet-Snacks-and-More-Perfect-for-gifts-i.1006175206.22245573652",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve7-li19i1y36p6o2c",
            "price": 11328000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Order the most luxurious chocolate hamper to delight serious chocoholics. Our Chocolicious hamper will indulge them with the wide selection of chocolate treats, designed to impress with its curated assortment of mouth-watering and gorgeous delicacies.\n\nWhat’s in this hamper:\n\n– Excelcium – Pralines BonBons De Chocolat 200g\n– Cupido Hazelnut Chocolate Seashells 250g\n– Forum Hamlet Finest Waffle Crisp 100g\n– Swiss Miss Dark Chocolate Sensation Hot Cocoa 283g\n– K.Harrodson Blueberry Butter Cookies 180g\n– Bickfords Premium Soft Drink Australia – Lemon Lime 275ml\n– Bickfords Premium Soft Drink Australia – Sarsaparilla 275ml\n– Kettle Honey Dijion Potato Chips 56g\n– Vochelle Hazelnuts Doypack 100g\n– Exquisite Tray Basket\n\n*Delivery in Singapore Only\n**Simply Hamper reserves the right to replace any item with another of equivalent value depending on availability."
        },
        {
            "title": "Premium Hand Made Gourmet Chocolate for Valentine's Day gift",
            "path": "Premium-Hand-Made-Gourmet-Chocolate-for-Valentines-Day-gift-i.945554869.22721935736",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-5ztpr81175mv9a",
            "price": 5290000,
            "location": "Korea",
            "rating": 0,
            "sold": 0,
            "description": "🌟Premium Hand Made Gourmet Chocolate for Valentine's Day gift🌟\n\n❣️Introducing premium gourmet couverture chocolate with four delicious flavors: Pistachio Pecan, Sugar-free Whole Hazelnut, Korean Strawberry Milk, and Sugar-free Rice Crunch.\n❣️Crafted with the finest ingredients, each bite is an indulgent experience that satisfies your sweet cravings without the added guilt.\n❣️ With its sugar-free options, our couverture chocolate is perfect for those following a low-carb diet, allowing you to enjoy rich, velvety texture and intense flavor without sacrificing your health goals.\n❣️ Whether you prefer the nutty crunch of pistachio pecan, the sweetness of Korean strawberry milk, or the crunchy delight of sugar-free rice, this premium couverture chocolate is the perfect treat for any occasion.\n\n✔️Product Include\nPistachio Pecan Bark (60g)\nSugar Free Whole Hazelnut Bark (60g)\nStrawberry Milk Bark (60g)\nSugar Free Brown Rice Crunch Bark (60g)\n\n⚠️Product Handling Info\nWhen handling our premium gourmet couverture chocolate, please note that it has a low melting point and must be stored in a refrigerated environment. To ensure the quality and texture of the chocolate, please follow the below guidelines:\n\n✅Store in a cool, dry place below 68°F (20°C).\n✅Avoid exposing the chocolate to direct sunlight, heat sources, or humid environments.\n✅Keep the chocolate in an airtight container to prevent moisture and odors from affecting the flavor.\n✅Avoid stacking or placing heavy objects on top of the chocolate to prevent damage.\n\n💕By following these simple guidelines, you can ensure that our premium gourmet couverture chocolate stays fresh and delicious, ready to be enjoyed whenever you're ready for a sweet treat.\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n😊Thank you for visiting ENTIP MALL.\n\n💕Here, you can find art products containing Korean culture and sensibility, such as many traditional Korean handicraft products and food, as well as small items that can be used in everyday life that reflect various Korean trends, at reasonable prices.\n\n💕Take a look at our wide range of items, and if you have any questions or other products you are looking for, please leave a message. We will try to respond as quickly as possible. Please feel free to contact us.\n\n💕All products are manufactured and shipped in Korea, so it takes 5 to 12 days for delivery.\n\n💕We would appreciate it if you could leave a  rating and review after purchasing the product.\n\n💕Please don't forget to Set your favorites so you can check out our new products right away."
        },
        {
            "title": "Simply Hamper Food Hamper Gift Sets - Gourmet Treats & Delightful Goodies in Exquisite Tray Box Lavish Treats",
            "path": "Simply-Hamper-Food-Hamper-Gift-Sets-Gourmet-Treats-Delightful-Goodies-in-Exquisite-Tray-Box-Lavish-Treats-i.1006175206.23471074612",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvcv-li1f7v0yp7c50b",
            "price": 7296000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Put a smile on your recipient with the Lavish Treats hamper basket! Our carefully curated assortment of sweet and savoury bite-sized treats will keep them munching away happily! Get ready for a picnic-perfect or snackin’ good time with one of the best gourmet food delivery in Singapore!\n\n\nWhat’s in the box:\n\n– Beryl’s Original Butter Cookies 70g\n– Vochelle Hazelnuts Doypack 100g\n– Gretel Sprouted Sprouted Mixd Nuts 56g\n– K.Harrodson Blueberry Butter Cookies 70g\n– Golden Bon Bon Almond Crunchy Maple Nougat 70g\n– Mission Tortilla Chips 65g\n– Bickfords Premium Soft Drink Australia – Lemon Lime 275ml\n– Movietimes Original Popcorn 20g\n– Exquisite Tray Box\n\n*Delivery in Singapore Only\n**Simply Hamper reserves the right to replace any item with another of equivalent value depending on availability."
        },
        {
            "title": "Yuanshen Hand-Made Paimon Is Not Emergency Food Gourmet Theme Mystery Box Car Desktop Decoration Peripheral Gift",
            "path": "Yuanshen-Hand-Made-Paimon-Is-Not-Emergency-Food-Gourmet-Theme-Mystery-Box-Car-Desktop-Decoration-Peripheral-Gift-i.960225353.20282490457",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvel-lj29sapb7ngv29",
            "price": 349000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Place Of Origin: Zhejiang Province\nProduct Type: Static\nMain Material: Resin\nWork Area: Mainland China\nWelcome To This Mall, New Store Opening, A Lot Of Discounts, Pay Attention To The Store, You Can Receive Low-Threshold Coupons, Enter The Store To Get Coupons First, And Consult Customer Service Before Purchasing\nOur Store Operates With Integrity, Only Earns Reputation And Profits To Give Back To All Customers.\nThe Goods In This Store Are All Genuine, Fake One Penalty Ten Reputation Guarantee.Welcome Customers To Come And Buy With Confidence, We Will Serve You Wholeheartedly!\nOur Shop Specializes In Marketing All Kinds Of Life Women's Must-Haves, Fake One Penalty Ten Reputation Guarantee.\nThe Service Tenet Of Our Store Is To Serve With Heart And Treat People With Sincerity!\nIf You Have Any Questions When Purchasing, Please Contact Us, Our Working Hours Are: 7: 30-23: 30, Welcome To Consult.If You Can't Reply In Time, Please Understand, The Customer Service Will Answer You As Soon As Possible After You Arrive At Your Job.\nPlease Shop Rationally, Don't Maliciously Reject Or Not Pick Up The Goods, Thank You!When You Receive The Goods, Please Check The Good Condition Of The Goods As Soon As Possible, If You Have Any Questions, Please Contact Us As Soon As Possible, We Will Give You A Satisfactory Answer, Thank You For Your Understanding And Support To Us, Thank You!\nModel Toy#益智玩具#数学益智玩具#玩具绘本#等精品上线！"
        },
        {
            "title": "[FREE GIFT]黑金酥蛋黄酥(22 PCs/1 box) black gold crispy egg yolk crispy snow Mei Niang salted egg yolk bread gourmet snacks",
            "path": "FREE-GIFT22-PCs1-box-black-gold-crispy-egg-yolk-crispy-snow-Mei-Niang-salted-egg-yolk-bread-gourmet-snacks-i.813663925.23671806103",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg9-lie6kcod57jj03",
            "price": 1393000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Brand: Yiduojia\nNet content: 40g\nDoes it contain sugar? It contains sugar\nOrigin: Chinese Mainland\nProduction date: June 22, 2023\nShelf life: 120 days\n\n About the products and logistics of the store: \n◆ 100% new products in our store \n◆ in rare cases, it is normal for products to have small creases, slight scratches, small spots and thread ends, perfectionists please place orders with caution. \n◆ all products are taken in kind/measured manually. Due to different monitors, there will be slight color difference and measurement discrepancy. Order again if you can accept it! \n◆ products cannot be returned or exchanged after being unpacked. \n\n✅Notice to buyers:\n1. About delivery: All goods are shipped in mainland China, the delivery time is 1-3 days, and the arrival time is 15-22 days \n \n2. Pre-sales questions: you can talk about online customer service if you don't know anything about the product. Pay special attention to the color, size and specification before subbidding, if the volume is large and the quantity is large, it is recommended to go home. \n\n3. After-sales problems: if all goods in this store are defective or damaged due to logistics and other problems before delivery, our store will After-sales (therefore, in order to improve the transaction efficiency and interest of both buyers and sellers, the seller hereby asks the buyer to check the color, size and function of the product immediately after receiving the product. If there is any problem, the seller will respond to it immediately and solve the problem for you, thank you)"
        },
        {
            "title": "Gift Order Gourmet Popular [Ramen Dashi Noodles Excellent Seafood Dashi Meat Dashi Set of 10] Comparing Eating Nationwide【Direct From Japan】",
            "path": "Gift-Order-Gourmet-Popular-Ramen-Dashi-Noodles-Excellent-Seafood-Dashi-Meat-Dashi-Set-of-10-Comparing-Eating-NationwideDirect-From-Japan-i.950540424.19074641966",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-x55od3wb12nv3c",
            "price": 5840000,
            "location": "Japan",
            "rating": 0,
            "sold": 0,
            "description": "Brand Ginza Gofanya\nType Ramen\nProduct weight 1.4 kg\nnumber of products 10\n\nAbout this product\n[Boiling time: 4 and a half minutes] Ramen \"Dashimen\" that tastes of domestic ingredients \"Dashi\". The design has been renewed while maintaining the deliciousness. Please fully enjoy the refined taste.\n[Commitment to noodles] Using flour from Hokkaido, raw noodles are slowly aged and dried for about 2 days, giving them a chewy texture that is not oily.\n[Commitment to soup] A liquid soup that uses \"plenty\" of \"dashi\" made by boiling domestic ingredients. Because it is not processed at high temperature, the flavor of the ingredients spreads in your mouth.\n[Preservation method] Avoid direct sunlight, high temperature and humidity, and store at room temperature.\n\n\n【Shipping】\nItems will be shipped by SLS (Shopee Logistic Service).\nAfter the product is shipped, it will be delivered to the Shopee warehouse in Japan.\nSLS will then deliver to your address.\nIt takes about 7 to 20 days for the product to arrive.\nItems are usually shipped within 72 business hours.\nShipping is normally Monday through Friday.\n\nAny customs duty incurred will be borne by the buyer.\nWe are not responsible for any taxes incurred.\nCurrently, international mail is expected to be delayed due to the effects of new infectious diseases and increasing.\nThank you kindly look forward for your understanding."
        },
        {
            "title": "Simply Hamper Halal Food Gift Set - Gourmet Treats & Delightful Surprises in Exquisite Tray Box Blissful Greetings",
            "path": "Simply-Hamper-Halal-Food-Gift-Set-Gourmet-Treats-Delightful-Surprises-in-Exquisite-Tray-Box-Blissful-Greetings-i.1006175206.21389876495",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve3-li19i1y3axk55d",
            "price": 6336000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "This Hari Raya Hamper features a variety of nutritious and delicious treats! Beautifully presented in an exquisite tray box, the Blissful Greetings halal gourmet hamper is the perfect gift for your loved ones this festive season. Get ready to indulge!\n\n\n\nWhat’s in this hamper:\n\n-Bonz Cookie Crunchy Oat & Sesame 100g\n-Julie’s Butter Waffles 100g\n-Beryl’s Almond milk Chocolate 70g\n-Cowhead Cappuccino Butter Cookies150g\n-Hausboom Sparkling Real Juice 275ml\n-Amazin’ Graze Chocolate Hazelnut 40g\n-Amazin Graze Mini Pandan Coconut Mixed Nuts 30g\n-Exquisite Tray Box\n\n*Delivery in Singapore Only\n**Simply Hamper reserves the right to replace any item with another of equivalent value depending on availability."
        },
        {
            "title": "Bibizan Baked Gluten Spicy Strips Bulk Snacks Satisfy the Appetite for Foodie Gourmet Gift Bag Recommended Leisure Food【",
            "path": "Bibizan-Baked-Gluten-Spicy-Strips-Bulk-Snacks-Satisfy-the-Appetite-for-Foodie-Gourmet-Gift-Bag-Recommended-Leisure-Food-i.990710345.22466344739",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcu-lg3mfhnvcl5ab1",
            "price": 2328000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Brand：Bibizan（BIBIZAN）\nProduct Name：Bibizan Baked Gluten Spicy Strips Bulk Snacks Satisfy the Appetite for Foodie Gourmet Gift Bag Recommended Leisure Food【Select】 Spicy Flavor 280g/Bag\nProduct Number：10054691564854\nShop：Bibizan Flagship Store\nGross Weight of Goods：200.00g\nPackaging Form：Bags\nNet Content：201-500g\nShelf Life：270Days\nProduction License Number：SC12443062606462\nProduct Standard Number：GB 2711"
        },
        {
            "title": "Luxury Ochazuke Set Gift Gift Seafood Gourmet Aya (Irodori) 4 meals (Shizuoka Prefecture Shimoda Golden Sin Silver Silver Silver Crab Scallop) Expo Chaya PREMIUM GIFT【JAPAN MADE】",
            "path": "Luxury-Ochazuke-Set-Gift-Gift-Seafood-Gourmet-Aya-Irodori-4-meals-Shizuoka-Prefecture-Shimoda-Golden-Sin-Silver-Silver-Silver-Crab-Scallop-Expo-Chaya-PREMIUM-GIFTJAPAN-MADE-i.238337977.21871847648",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfn-lgivdowscuae6c",
            "price": 6728000,
            "location": "Japan",
            "rating": 0,
            "sold": 0,
            "description": "🌸 Description 🌸\n\nLuxury Ochazuke Set Gift Gift Seafood Gourmet Aya (Irodori) 4 meals (Shizuoka Prefecture Shimoda Golden Sin Silver Silver Silver Crab Scallop) Expo Chaya PREMIUM GIFT\n\nBrand: Blessing Chaya\nFlavour Chazuke, crab, bonito, sea bream, salmon, scallop\nPackage weight 0.27 kg\nRegion Koshinetsu region\nNumber of units 4.00 servings\nAbout this product\nThe Irodori Ochazuke set is a long-selling classic gift with a total of 250,000 servings. This is a gift set of authentic ochazuke with carefully selected ingredients including sea bream from Izu-Shimoda, served in authentic bonito-scented dashi broth. (Set of 4 servings each of sea bream, silver salmon, snow crab and scallop).\nA small but heartfelt thank-you gift... delivered in a simple presentation box.\nA delicious multiplication of four carefully selected Japanese dashi ingredients. The combination of carefully selected seaweed and mitsuba (mitsuba) enhances the taste of the ingredients.\nNot just delicious. We want to offer you a genuine gift that is both visually appealing and healthy... No chemical seasonings, colourings or preservatives are used.\nHow to serve: place a light cup (100 g) of rice on top of the ingredients and chazuke ingredients and pour in 150 cc of hot water. (Adjust the amount of rice and hot water according to your taste.)\n\n🌸Warranty for genuine products🌸\nOur Store is a Japanese company. All of our products are 100% authentic.\nWe do not deal with any counterfeit products.\nPlease feel free to purchase our products.\n\n🌟You are welcome to contact us via chat.🌟\nDiscounts are often available when purchased in bulk with other products.\nIf you are interested in purchasing a product that is not listed, please feel free to contact us via chat.\nAlso, please feel free to ask us about wholesale.\n\n🛫About Shipping🛫 \nAll items will be carefully packed and a tracking number will be issued within 2 business days. \n\n⚠️Precautions⚠️\nIf the total value of your items exceeds SG$400, you may be charged customs duty.\nWe recommend that you separate your orders.\nPlease note that you will be responsible for any customs duties incurred.\n\nReturn of Merchandise\nIn the unlikely event that an item does not arrive, we will either send you a replacement item or issue a full refund.\nPlease note that we do not accept returns for the convenience of the customer."
        },
        {
            "title": "[BAYEAH GOURMET] 500g Signature Chargrilled Bak Kwa 招牌炭烤蜜汁肉乾礼盒 (CNY Gift Set)",
            "path": "BAYEAH-GOURMET-500g-Signature-Chargrilled-Bak-Kwa-CNY-Gift-Set-i.368417096.5373474810",
            "image": "https://down-sg.img.susercontent.com/file/898f17be15d9c323092b283f72b59960",
            "price": 5980000,
            "location": "SG",
            "rating": 4.633333333333334,
            "sold": 0,
            "description": "Ba Yeah! Gourmet, branching out from a renowned legacy brand with inherited family recipes that has been well received by locals for over 40 years. Ba Yeah uses only fresh and the finest meat imported from Brazil. Adopting the traditional way of grilling over charcoal, our Bak Kwa tastes extra tender and aromatic while retaining the juicy texture. Each piece is carefully grilled to the perfect golden ratio of Char and chewiness.\n\nSignature Chargrilled Honey Glazed Pork Bak Kwa Gift Set 招牌炭烤蜜汁肉乾礼盒\n:: Soft and tender ::\nMarinated with our secret recipe, with over 15 types of spices and seasoning. Each piece of Bak Kwa is grilled over charcoal on slow fire for the subtle smoky aroma and juicy texture, with hints of caramel sweetness from the sugarcane glazing.\n\nThis set consists of \n1. 500g/1kg Signature Chargrilled Honey Glazed Pork Bak Kwa\n2. Chinese New Year Premium Gift Box\n\n- 100% fresh ingredients Brazil imported meat\n- Wrapped in vacuum pack to ensure high quality during shipping\n- Preserve better for longer period in vacuum pack\n\nShipping Information\n- Shipping will be completed with Shopee integrated partner on the selected date\n- Please choose your preferred delivery date during checkout\n\nBulk/Corporate \n- Available for 20 units & above, please chat with us through chat box for more details"
        },
        {
            "title": "[FREE Gift] Spicy Crispy Guizhou Specialty Dry Fried Sesame Chili Shredded Crispy Chili Fried Snacks Crispy Spicy Gourmet Bottled Chili Crisp Spicy Little Crab Ready to Eat",
            "path": "FREE-Gift-Spicy-Crispy-Guizhou-Specialty-Dry-Fried-Sesame-Chili-Shredded-Crispy-Chili-Fried-Snacks-Crispy-Spicy-Gourmet-Bottled-Chili-Crisp-Spicy-Little-Crab-Ready-to-Eat-i.991621090.20190113668",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve1-lid506qnerkd1f",
            "price": 1787000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Place Of Origin: Mainland China/Zhejiang Province/Hangzhou City\nPlace Of Origin: Zhejiang Province\nNet Content: 250g\nPacking Method: Bag\nProduction Date: 2023-02-01\nShelf Life: 240 Days\n💋Welcome To My Shop💐\n🌹Our Products Are Shipped From China\n🌸The Products In This Store Are All In Stock\n🌸Please Pay Attention To The Small Hands Who Make A Fortune In Person, Pay Attention To The Store, Pay Attention To Polite\n🌸If There Is Any Good Product, I Will Push It To You As Soon As Possible ^.^\n🌸It Will Be Sent Out Within 1-2 Days After The Order Is Placed, And It Can Be Delivered Within 7-15 Days After The Normal Logistics And Transportation ^.^\n🌸If You Have Any Questions, You Can Contact Customer Service, We Will Give You The Best Shopping Experience ^.^"
        },
        {
            "title": "Gourmet Food Hampers - Sweet Tooth (AGH10) [starflorist.com.sg]",
            "path": "Gourmet-Food-Hampers-Sweet-Tooth-AGH10-starfloristcomsg-i.269874280.16647482621",
            "image": "https://down-sg.img.susercontent.com/file/d57617ccfce8ea977f5db01f066feb60",
            "price": 10914000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "From satisfying crisps to a savoury crunch, impress your recipients with this tasty gourmet gift!\n\nGift Basket Includes:\n- Lindt: Excellence Dark Chocolate, 100g\n- Toblerone: Swiss Milk Chocolate with Honey Almond, 100g\n- The Belgian: Coffee Truffines, 65g\n- SUISS: Premium Swiss Cereal Snack, Chocolate Fantasy, 168g\n- Ferrero Rocher Chocolate 1 Box(24ps), 300g\n- Flower and Packaging \n\n\n***[Please Read] Terms & Conditions:\n- Upon placing your order, please indicate the below template under comments to seller upon checkout. \n- Open on Monday - Saturday (9am to 6pm) , Close on Sundays & Public Holidays.\n- Self-Collection at 11 Woodlands Cl, #07-30, Singapore 737853.\n- For Self-Collection, kindly let us know your estimated time of arrival so we can prepare your arrangement.  \n- Same day delivery available.\n- Do note that final creation may differ slightly from image shown due to artistic nature and flower/foliages in season.\n- Star Florist Pte Ltd reservers the right to replace any items with another of equivalent or higher value depending on availability.\n\n\n1. Delivery date: \n\n2. Delivery address:\n\n3. Recipient name:\n\n4. Recipient Contact number:\n\n5. Safe place to leave flowers if recipient not available:\n\n6. Message on our complimentary message card:\n\nThank you!"
        },
        {
            "title": "Gourmet Food Hampers - Party [starflorist.com.sg]",
            "path": "Gourmet-Food-Hampers-Party-starfloristcomsg-i.269874280.16147470817",
            "image": "https://down-sg.img.susercontent.com/file/30e6b7123ffff36a0b878dce97d77ebc",
            "price": 12005000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "From satisfying crisps to a savoury crunch, impress your recipients with this tasty gourmet gift!\n\nGift Basket Includes:\n- Belgian Caffe Latte 200g \n- Diana Premium Almond Milk Chocolate 180g \n- Toblerone 200g\n- Ferrero Rocher 300g (T24)  \n- Swiss Delice Chocolate 100g\n- With Bear Packaging \n\n\n***[Please Read] Terms & Conditions:\n- Upon placing your order, please indicate the below template under comments to seller upon checkout. \n- Open on Monday - Saturday (9am to 6pm) , Close on Sundays & Public Holidays.\n- Self-Collection at 11 Woodlands Cl, #07-30, Singapore 737853.\n- For Self-Collection, kindly let us know your estimated time of arrival so we can prepare your arrangement.  \n- Same day delivery available.\n- Do note that final creation may differ slightly from image shown due to artistic nature and flower/foliages in season.\n- Star Florist Pte Ltd reservers the right to replace any items with another of equivalent or higher value depending on availability.\n\n\n1. Delivery date: \n\n2. Delivery address:\n\n3. Recipient name:\n\n4. Recipient Contact number:\n\n5. Safe place to leave flowers if recipient not available:\n\n6. Message on our complimentary message card:\n\nThank you!"
        },
        {
            "title": "Simply Hamper Food Hamper Gift Sets: Gourmet Treats & Delights for Your Little One! - Golden Bon Bon, Amazin'Grace, Roya",
            "path": "Simply-Hamper-Food-Hamper-Gift-Sets-Gourmet-Treats-Delights-for-Your-Little-One-Golden-Bon-Bon-AmazinGrace-Roya-i.1006175206.22971071962",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfi-li1gr1d3uvrm21",
            "price": 15168000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Be the reason for your loved ones to sparkle with the Sparkling Surprise Hari Raya Hamper! Surprise them with this gourmet halal gift that features sweet and savoury snacks that will keep the party going! Presented in an exquisite gift basket, it will surely be a showstopper for this festive celebration.\n\nDiscover the best halal hampers in Singapore with us, and enjoy our complimentary hamper delivery.\n\nWhat’s in this hamper:\n\n-Golden Bon Bon- Crunchy Almond Nougats Gift Box 130g\n-Amazin’Grace Pandan Coconut Nuts Mix 100g\n-Royal Select Sparkling Grape Juice 750ml\n-Bonz Chocolate Hazelnut Cookie Snack 100g\n-Cavendish & Harvey- Tropical Candies Jar 300g\n-Gardenia Snack’Em Lentil Chips 50g\n-Elit Bohem Assorted Chocolate Selection 200g\n-Swiss Miss Dark Chocolate Sensation Hot Cocoa 283g\n-K.Harrodson Raspberry Butter Cookies 180g\n-Delfi Almond Milk Chocolate Red Box 180g\n-Exquisite Gift Basket\n\n*Delivery in Singapore Only\n**Simply Hamper reserves the right to replace any item with another of equivalent value depending on availability."
        }
    ]
}