{
    "query": "Toys and Games",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Uglydoll Card Game - Race to Grab the Match!",
            "path": "https://shopee.sg/Uglydoll-Card-Game-Puzzle-game-i.173728060.5044389609",
            "image": "https://down-sg.img.susercontent.com/file/9abef72af39f4940c8afc6b849982263",
            "price": 556000,
            "location": "Mainland China",
            "rating": 4.798245614035087,
            "sold": 26,
            "description": "Get ready for a wild race with the Uglydolls! Join OX, Wedgehead and the rest of the gang in this fast-paced card game for 2-6 players. Match three Uglys before the others do and you win the game! It's easy to learn and even easier to have fun. Perfect for ages 6 and up, this game promises a good time for everyone. Play Uglydoll Card Game and get ready for the race of your life!"
        },
        {
            "title": "Celebrate Singapore's MRT System with this 1,000pc Puzzle",
            "path": "https://shopee.sg/SG-MRT-Map-Jigsaw-Puzzle-1000pcs-i.345223036.11370424614",
            "image": "https://down-sg.img.susercontent.com/file/f61c485870b502cecd2db73dfd7375d0",
            "price": 2500000,
            "location": "SG",
            "rating": 4.887700534759358,
            "sold": 48,
            "description": "Celebrate Singapore's MRT system with this 1,000pc jigsaw puzzle! Featuring the six MRT and three Light Rapid Transit lines, this puzzle is the perfect way to show your love for Singapore. This SG MRT Map Jigsaw Puzzle is the missing piece to your Singapore-inspired collection! Comes in 1,000 pieces and measures approximately 71cmW x 51cmH when complete."
        },
        {
            "title": "Huggy Wuggy Plush Toy Cactus - Dance, Talk, and Record 120 Songs - Fun Poppy Playtime Game ",
            "path": "https://shopee.sg/Huggy-Wuggy-Plush-Toy-Cactus-Dance-and-Talking-Recording-Toy-120-Songs-Poppy-Playtime-Game-Original-Dancing-Speak-Song-Tik-Tok-Fun-Toys-i.119046960.14581272811",
            "image": "https://down-sg.img.susercontent.com/file/659e753d426ced4adff17305b996e7ea",
            "price": 289000,
            "location": "Mainland China",
            "rating": 4.808,
            "sold": 7,
            "description": "Get ready for some fun with Huggy Wuggy Plush Toy Cactus! This cuddly cactus is the perfect companion for your little one, with 3 song variations to choose from: 3 songs no record, 120 songs with record and lighting, and 168 songs with record but no lighting. It can also record and speak after you, so you can make sure your little one is having a great time. Soft and cuddly, this Huggy Wuggy Plush Toy Cactus is made with PP cotton for strong resilience and a soft touch. Plus, its hat and scarf make it even more fun! Get your Huggy Wuggy Plush Toy Cactus today for hours of dancing, singing, and talking fun!"
        },
        {
            "title": "Remote Control Whale Shark Toy Robot - Electric Fish for Kids Boys Bath Toys Pool Submarine",
            "path": "https://shopee.sg/Rc-Whale-Shark-Toy-Robots-Remote-Control-Animals-Marine-Life-Tub-Pool-Electric-Fish-Children-Bath-Toys-for-Kids-Boys-Submarine-i.471724532.12339328237",
            "image": "https://down-sg.img.susercontent.com/file/ef8e2b0f3494eaf3f7fc076a2c195430",
            "price": 2004000,
            "location": "Mainland China",
            "rating": 4.8936170212765955,
            "sold": 8,
            "description": "Get your kids ready for fun with this Remote Control Whale Shark Toy Robot! This electric fish is designed with a 2.4G remote control that can be used by multiple people at the same time without interference. It imitates the swimming action of a real fish and can be used in tubs, pools, and even the sea (although it's not recommended). The shark must be placed in the water for the engine to run normally. This product is made with durable materials and is available in three different colors. Please note that only the SquirtWater Shark A/B/C model can spray water. The size of the toy is manually measured and may have a 1-3 cm error. Please supervise your children while playing with this toy and make sure they don't fall into the water."
        },
        {
            "title": "Remote Control Car Super Run - 4WD Toy with Wireless Remote Control for Boys & Girls",
            "path": "https://shopee.sg/Remote-Control-Car-Super-Run-Luxury-Car-Super-Racing-Car-Super-Sports-Car-4WD-Toy-i.426329846.17765451225",
            "image": "https://down-sg.img.susercontent.com/file/92bf58a391c4806c4980500b87a07918",
            "price": 903000,
            "location": "Mainland China",
            "rating": 4.6,
            "sold": 98,
            "description": "Get ready for the ultimate racing experience with this Remote Control Car Super Run! It features a 4-way remote control mode, imported domestic plastic material, and is suitable for all ages. This battery version does not include batteries and needs to be purchased separately. Enjoy hours of fun with this remote control car and let the races begin!"
        },
        {
            "title": "New Antistress Pop It Rainbow Ball - Squeeze Fidget Toy for Stress Relief & Fun",
            "path": "https://shopee.sg/New-Antistress-Pop-It-Rainbow-Ball-Push-Bubble-Pokeball-Fidget-Toys-Decompression-Squeeze-3d-Elastic-Kid-Pokmon-Game-i.51960315.15512120876",
            "image": "https://down-sg.img.susercontent.com/file/c8cb3a5f4c890ea9de59049dfd31188d",
            "price": 291000,
            "location": "Mainland China",
            "rating": 4.894736842105263,
            "sold": 5,
            "description": "Reduce stress and have fun with this Antistress Pop It Rainbow Ball! Made of food-grade silicone, this decompression ball fidget toy is perfect for kids, the elderly, and anyone else who needs to relieve tension and anxiety. With its 5 Colors design, this sensory 3D Stress Ball helps with recognition and distraction. It's also washable and great for playing games with the whole family. Dimensions: 7×7×7CM. Suitable age: over 3 years old. Get yours today and start relieving stress!"
        },
        {
            "title": "Jumping Pirate Game - Family Friends Bonding Party Toy with Balance Ice Cubes, Vent Battle & Crocodile Dentist",
            "path": "https://shopee.sg/Crocodile-Dentist-Vent-Battle-Penguin-Balance-Ice-Cubes-Jumping-Pirate-Game-Family-Friends-Bonding-Party-Toy-i.469049961.5092109754",
            "image": "https://down-sg.img.susercontent.com/file/dbedc2ba27250ab6b5f53757b0aaac1a",
            "price": 458000,
            "location": "SG",
            "rating": 4.772058823529412,
            "sold": 64,
            "description": "Enjoy hours of fun with this family friends bonding party toy set! This set includes a Jumping Pirate Game, Balance Ice Cubes, Vent Battle and Crocodile Dentist. The Pirate Game comes with 12 swords (Small), 16 swords (Medium) and 16 swords (Large) with a Wheel of Dares. The Crocodile is 8.5cm x 15.4cm x 16.2cm, Vent Battle is 17cm x 23cm x 7cm, Penguin is 25.5cm x 25.5cm x 6cm and the Pirate (Small) is 11.1cm x 7.7cm x 7.6cm, (Medium) is 12cm x 9cm x 8.8cm and (Large) is 15cm x 10.7cm x 10.6cm. Parcels"
        },
        {
            "title": "Rummikub Rummy Digital Board Game - Fun Family Party Puzzle for All Ages!",
            "path": "https://shopee.sg/Rummikub-Rummy-Digital-Card-Board-Game-Puzzle-Family-Party-Parent-child-Education-Boy-Girl-Toy-GiftDigital-i.173728060.5102666895",
            "image": "https://down-sg.img.susercontent.com/file/ca5e6feeef3e23621b1b7145a3ad0562",
            "price": 1673000,
            "location": "Mainland China",
            "rating": 4.845474613686534,
            "sold": 8,
            "description": "Play the classic game of Rummikub with this digital version! Perfect for family game nights, the game is easy to learn and fast-paced, combining luck and strategy. With a variety of ways to manipulate the board, the game is different every time it's played. Be the first player to play all your tiles to win! With more than 55 million units sold, Rummikub is one of the world's best-selling and most-played games. Ideal for people of different ages to play together, making it a great family game. Reinforces STEM skills like sequencing and pattern recognition. Includes jokers to add excitement to the game, and the first player to clear their rack of all tiles wins! Get your family together for a fun game night with Rummikub!"
        },
        {
            "title": "106 Tiles Family Traveling Portable Rummikub Israel Mahjong Board Game",
            "path": "https://shopee.sg/106-Tiles-Family-Traveling-Portable-Rummikub-Israel-Mahjong-Digital-Board-Game-i.173728060.6000217981",
            "image": "https://down-sg.img.susercontent.com/file/8bc33554c460df3c342d6193bca20635",
            "price": 1244000,
            "location": "Mainland China",
            "rating": 4.903370786516854,
            "sold": 20,
            "description": "Perfect for family and friends, this 106 Tiles Family Traveling Portable Rummikub Israel Mahjong Board Game is sure to provide hours of fun. Based on the traditional middle-eastern game of Okey, this game is similar to the Rummy that you play with cards - you try to get rid of all your tiles by forming numbers into runs of 3 tiles or more, or 3 to 4 of a kind. This game includes 106 Digital Cards (104 Colorful Cards + 2 Jokers), 4 Black Plastic Cards Holders for Players, 8 Supports for the Cards Holders, and a Zipper Bag. Suitable for ages 12 and up, this game is a great way to bring people together."
        },
        {
            "title": "5 in 1 Kids Music Bus Toys - Multifunctional Early Educational Car Toy with Xylophone, Beads, Blocks, Sorting & Montessori Games",
            "path": "https://shopee.sg/5-in-1-Kids-Music-Bus-Toys-Multifunctional-Early-Educational-Car-Toy-Xylophone-Beads-Blocks-Sorting-Montessori-Game-Toys-GiftEarly-Learning-ToyXylophoneShape-SorterPull-to-walk-knocking-toy-Kid-ToyMusic-i.384594475.8349317940",
            "image": "https://down-sg.img.susercontent.com/file/a93b218caf7ec1bdb5ee95b3feb46222",
            "price": 1396000,
            "location": "Mainland China",
            "rating": 4.764444444444444,
            "sold": 7,
            "description": "Keep your little one entertained with this 5 in 1 Kids Music Bus Toys set! This multifunctional early educational car toy includes a xylophone, beads, blocks, sorting and Montessori games to help your child develop their hand-eye coordination, manual brain, grasping, intellectual development, crawling, vision, interest cultivation, senses, emotions, hearing and other abilities. This toy car measures 30 cm x 16 cm x 11 cm and comes in an exquisite gift box measuring 31.5 cm x 16.5 cm x 12.5 cm. Made from plastic, it weighs 700 grams and is packed in an OPP bag. Note: Allow 1-2 cm error due to manual measurement and slight color variations may occur due to different display settings."
        },
        {
            "title": "Here to Slay Base Game & Warriors & Druids Expansion Bundle ",
            "path": "https://shopee.sg/Here-to-Slay-Base-Game-and-Expansion-Bundle-i.173728060.13442364521",
            "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-ljcw4h4lpj0620",
            "price": 616000,
            "location": "Mainland China",
            "rating": 4.775510204081633,
            "sold": 38,
            "description": "Fight your way through the world of Here to Slay with this bundle that includes the Base Game and Warriors & Druids Expansion Pack! The Base Game includes 1 standard deck of 115 cards, 6 oversized Party Leader cards, 15 oversized Monster cards, 2 six-sided dice, and 6 rules reference cards. The Warriors & Druids Expansion Pack introduces new party leaders, heroes, and dangerous monsters with 31 standard-sized cards, 2 oversized Party Leader cards, and 2 oversized Monster cards. Perfect for players of all skill levels, this strategic card game is sure to provide hours of adventure and excitement!"
        },
        {
            "title": "25.4/30mm Pipe Diameter Spirit Level Pipe Clamp Balance Bracket with 20mm Card Slot",
            "path": "https://shopee.sg/Spirit-Level-Pipe-Clamp-Balance-Bracket-25430mm-Pipe-Diameter-20mm-Card-Slot-Spirit-Level-i.1005572129.16897843486",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdp-li2txa4oixd8df",
            "price": 1488000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get the perfect balance with this Spirit Level Pipe Clamp Balance Bracket. It features a 25.4mm or 30mm pipe diameter and a 20mm card slot for easy installation. This bracket is suitable for people over 14 years old and comes in a standard configuration. Get it now and achieve the perfect balance for your project!"
        },
        {
            "title": "Get the Magical Claw Machine - Mini Arcade UFO Claw Catcher Game!",
            "path": "https://shopee.sg/Easyhomesg-Magical-Claw-Machine-Mini-Arcade-UFO-Claw-Catcher-Game-i.7595687.1580642528",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdz-lftdvnkmpirn81",
            "price": 662000,
            "location": "SG",
            "rating": 4.9185185185185185,
            "sold": 11,
            "description": "Get the brand new Magical Claw Machine, perfect for kids and adults alike! Comes with tokens and 6 plush toys, with an additional 10 plush toys option available. Powered by both USB and battery (battery not included). Please note that the playset comes with packaging box and may be damaged or dented during delivery, so an add-on carton box is provided for extra protection. Get the perfect gift for your friends and family, and have fun playing with the Magical Claw Machine! #Magical #Claw #Machine #Mini #Arcade #UFO #Claw #Catcher #Game #toy #kids #children #gift #present #christmas #play #adult #plush #token"
        },
        {
            "title": "Kids Birthday Party Decoration Theme - 3D Llama Unicorn Dinosaur Shark Pinata",
            "path": "https://shopee.sg/3D-Llama-Unicorn-Dinosaur-Shark-Pinata-Kids-Birthday-Party-Decoration-Theme-Party-Fun-Game-Halloween-Party-Candy-Hit-i.509469209.17475691636",
            "image": "https://down-sg.img.susercontent.com/file/c32a4fa75e3c8c375ae8e222ad95ff05",
            "price": 2915000,
            "location": "Malaysia",
            "rating": 4.807017543859649,
            "sold": 12,
            "description": "Get the most out of your kids birthday party with this fun and festive 3D Llama Unicorn Dinosaur Shark Pinata! Fill it up with your favorite candies, mini toys, and treats for a fun party game that all the kids will love. This piñata comes with a built-in hang hoop and handle for easy hanging, and can hold up to 1.5 to 2kg of treats (not included). Choose from a variety of colors and designs - Dinosaur piñata Light Green or Dark Green color will be sent out randomly based on availability. Add a touch of excitement to your kids birthday party with this fun and exciting piñata!"
        },
        {
            "title": "🔥Local Ready Stock⚡Star Wars 2 Pcs LightSaber Combined Extendable Laser LED Sword Set with 7 Colored Lights & Motion Sensitive FX Sound Effects ",
            "path": "https://shopee.sg/Local-ShipStar-Wars-2-Pcs-LightSaber-Combined-Extendable-Laser-LED-Sword-Set-Motion-Sensitive-FX-Sound-Sword-for-Kids-i.444092281.17282296577",
            "image": "https://down-sg.img.susercontent.com/file/8e5253065c605cce1907ec9fdb708546",
            "price": 350000,
            "location": "SG",
            "rating": 4.694117647058824,
            "sold": 70,
            "description": "Welcome to Global Reality! 🎁Follow our shop to get FREE VOUCHER 🎁 "
        },
        {
            "title": "Fun Hand-Eye Coordination Game with Mini Claw Machine and Micro Dinosaur Figure Egg",
            "path": "https://shopee.sg/Mini-Claw-Machine-Capsule-Catcher-Toy-with-Micro-Dinosaur-Figure-Egg-Hand-eye-Coordination-Game-Activity-for-Children-Toddler-i.187350317.18811070291",
            "image": "https://down-sg.img.susercontent.com/file/94f4a72ecfe1214700f32ef95735d265",
            "price": 292000,
            "location": "Mainland China",
            "rating": 4.685314685314685,
            "sold": 36,
            "description": "Get your kids excited about this fun and challenging hand-eye coordination game! Our Mini Claw Machine Capsule Catcher Toy comes with 8 micro dinosaur figures and a paper manual. It's made of high-quality and safe ABS material, perfect for children and toddlers. It's easy to operate with just 3 steps: move the middle gear left and right to control the gripper arm, make the gripper down and up, and grab the mini dinosaur figurine. The compact size (6.5x6.5x6cm) won't take up too much space and the built-in storage drawer can contain your micro dinosaur babies. Get this game today and watch your kids have hours of fun!"
        },
        {
            "title": "[READY STOCK] Cute Car Interior Decorations - Car Center Console Display Screen Car Ornaments & Supplies",
            "path": "https://shopee.sg/READY-STOCK-Car-ornaments-car-center-console-display-screen-car-decorations-small-turtle-cute-car-interior-supplies-or-i.867945903.19980987808",
            "image": "https://down-sg.img.susercontent.com/file/ph-11134201-23030-fqpx79xyz9nv2a",
            "price": 1017000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "💕Welcome to our store! All products are ready to go and available for self-service. Follow us to get special coupons and offers. After placing an order, we will ship from China within 2-7 days and 8-15 days after arrival. Get your order within 7-15 days. If you have any questions, please don't hesitate to contact us. We're here to help you! "
        },
        {
            "title": "【SG】1:18 2.4G RC Car Wireless Remote Control Climbing Car Toys for Boys & Adults - Day Gift",
            "path": "https://shopee.sg/SG24G-RC-Car-Wireless-Remote-Control-Climbing-Car-118-Toys-for-Boys-Adult-Children-Day-Gifts-i.339701161.15322225386",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134211-7qvdn-lfavh2eiy6oy84",
            "price": 2190000,
            "location": "SG",
            "rating": 4.808219178082192,
            "sold": 25,
            "description": "Get ready to conquer a variety of complex and rugged roads with this 1:18 scale 2.4GHz RC car! It has forward, backward, left, right, shock absorber, and thick tires, making it perfect for kids and adults alike. It also features a durable construction, good workmanship, and an attractive design that will make your kids smile. The car comes with a 4.8v700ma battery pack, remote control, charging cable, and has a charging time of 2-2.5h. Don't forget to use cheap carbon batteries for a stable performance! Get this amazing RC car now and make your kids' day!"
        },
        {
            "title": "Sushi Go Board Game - Pick & Pass Cards for Family Parties",
            "path": "https://shopee.sg/Fancycube-Sushi-Go-Board-Pick-Pass-Cards-Family-Party-Game-i.7548342.1031814597",
            "image": "https://down-sg.img.susercontent.com/file/245de180d48668b4dfe089055140a954",
            "price": 725000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 6,
            "description": "Enjoy hours of fun with this Sushi Go Board Game! Perfect for family parties, this game includes 1pc of paper material measuring 1.5x4.3x5.8 inches. With easy-to-follow instructions, you and your family can enjoy a night of fun and laughter. Get your game today and join the fun! #SushiGo #BoardGame #PickAndPass #Cards #FamilyParties #GameNight"
        },
        {
            "title": "Professional YoYo Ball with Light Up Feature - Perfect Gift for Kids!",
            "path": "https://shopee.sg/Magic-Light-up-Professional-YoYo-Ball-Bearing-String-Trick-Kids-Playing-Toys-i.84711731.1584181510",
            "image": "https://down-sg.img.susercontent.com/file/353dc72b7e9489a2b4ca5742137075a3",
            "price": 200000,
            "location": "Mainland China",
            "rating": 4.58252427184466,
            "sold": 20,
            "description": "Get your kids this amazing Light Up YoYo Ball and let them have hours of fun! This professional yo-yo ball is made from durable plastic and is available in 6 different colors. It is portable and easy to carry, and will light up when spun at high speed. Get this great gift for your kids and let them enjoy hours of fun! Includes 1 pc Light Up YoYo Ball. Size: Approx.2.2\"*1.3\"/5.7*3.5cm. Note: Color may be sent at random."
        }
    ]
}