{
    "query": "Fashion and Accessories",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Women's Summer 2022 Fashionable Wide-Leg Two-Piece Suit",
            "path": "https://shopee.sg/Wide-Leg-Pants-Women-Suit-2022-Summer-New-Temperament-Foreign-Fashion-Two-piece-Set-Women-i.95570154.18720223474",
            "image": "https://down-sg.img.susercontent.com/file/8cc71bb8db803ae72569e80417d65f94",
            "price": 1717000,
            "location": "Mainland China",
            "rating": 4.384615384615385,
            "sold": 6,
            "description": "Update your wardrobe with this fashionable two-piece suit for women. Crafted from polyester, this suit features a wide-leg design and is available in blue and yellow. Choose from sizes M, L, XL, XXL, and XXXL for the perfect fit. Make a statement with this stylish two-piece suit this summer."
        },
        {
            "title": "Pokémon Star Kirby Kawaii Cartoon T-shirt for Men & Women ",
            "path": "https://shopee.sg/Pokmon-Star-Kirby-Kawaii-Cartoon-T-shirt-men-and-women-summer-American-ins-tide-brand-style-loose-fashion-short-sleeved-couple-tops-i.397333065.20904398522",
            "image": "https://down-sg.img.susercontent.com/file/685cd4a67f6bfb2786dfe8ed3cafcae8",
            "price": 937000,
            "location": "Mainland China",
            "rating": 4.916666666666667,
            "sold": 10,
            "description": "Get ready for summer with this stylish Pokémon Star Kirby Kawaii Cartoon T-shirt! Made of 100% cotton, this loose-fitting and fashionably short-sleeved couple tops is perfect for the American ins tide look. Please note that due to manual measurement, there may be some errors in the size. Also, due to different monitors, there may be slight color deviation, please refer to the actual product."
        },
        {
            "title": "Women's Korean Fashion Loose Two Piece Casual Pants and T Shirt Leggings Suit",
            "path": "https://shopee.sg/2021-New-Korean-Fashion-Loose-Large-Two-Piece-Casual-Pants-and-T-Shirt-Leggings-Suit-for-Women-i.95570154.7041519835",
            "image": "https://down-sg.img.susercontent.com/file/61a55032995553e71a4fb4e5178f046b",
            "price": 1285000,
            "location": "Mainland China",
            "rating": 4.183673469387755,
            "sold": 5,
            "description": "Look stylish and stay comfortable in this Korean Fashion Loose Two Piece Casual Pants and T Shirt Leggings Suit. Available in grey and white, this suit comes in sizes M to 4XL. Perfect for the warm summer days, this outfit is sure to make you stand out."
        },
        {
            "title": "Retro Coat American Street Style Windbreaker Hip Hop Sports Loose Jacket",
            "path": "https://shopee.sg/Pphome-New-Fashion-Retro-Coat-American-Street-Style-Windbreaker-Hip-Hop-Sports-Loose-Jacket-i.80186194.3448318558",
            "image": "https://down-sg.img.susercontent.com/file/d861ea9be00371f4ec65af921eafe77e",
            "price": 1943000,
            "location": "Mainland China",
            "rating": 4.87719298245614,
            "sold": 6,
            "description": "Collar type: lapel, Placket: zipper, Hooded: no, Main fabric composition: polyester fiber (polyester), Sleeve length: long sleeve. This stylish coat is perfect for adding a touch of retro style to any look. Featuring a lapel collar, zipper placket, and long sleeves, this jacket is sure to keep you warm and comfortable in any weather. Crafted from a polyester fabric, it is lightweight and breathable, making it ideal for layering."
        },
        {
            "title": "Women's Loose Summer Tee - Ice Silk T-Shirt ",
            "path": "https://shopee.sg/Ice-Silk-T-shirt-Womens-New-Loose-Fashion-Short-Sleeve-Top-Korean-Style-Summer-Tee-i.422516015.9442580984",
            "image": "https://down-sg.img.susercontent.com/file/940df82d793890cb2fef6864d330af63",
            "price": 883000,
            "location": "Mainland China",
            "rating": 4.2592592592592595,
            "sold": 23,
            "description": "Refresh your wardrobe with this stylish and comfortable Ice Silk T-Shirt. Crafted from a viscose fiber blend, this loose-fitting top features a V-neckline, short sleeves, and a solid color design. Perfect for the summer season, pair this top with your favorite jeans or shorts for a stylish look. "
        },
        {
            "title": "Taylor Swift The Eras Tour Concert T-Shirt - Men's & Women's Plus Size",
            "path": "https://shopee.sg/Taylor-Swift-The-Eras-Tour-Concert-Cotton-T-shirt-Mens-and-Womens-Plus-Size-Loose-Couple-Round-Neck-Short-Sleeve-Top-Korean-Harajuku-Fashion-Casual-Shirt-Tee-i.596020459.22767163531",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcy-lggpyb8pw9s12a",
            "price": 1307000,
            "location": "Mainland China",
            "rating": 4.95,
            "sold": 107,
            "description": "Welcome to TREND Clothing! This Taylor Swift The Eras Tour Concert T-Shirt is perfect for both men's and women's plus sizes. It features a loose fit, round neck, short sleeves, and a Korean Harajuku fashion look. Washing Instructions: Please turn all your items inside out before washing. Warm machine wash in gentle cycle. Do not bleach, dry clean, or iron directly on letters. Package includes 1x T-Shirt. Please refer to the measurement chart provided and select the most suitable size for you. Photos are for reference only, please prevail in kind. Enjoy your shopping experience with us!"
        },
        {
            "title": "Women's Fashion Loose Large Size Bottoming Shirt with Lace Collar",
            "path": "https://shopee.sg/Lace-Collar-Fashion-Loose-Large-Size-Bottoming-Shirt-Long-Sleeve-t-Shirt-Women-i.240981362.18149513640",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22090-7qwj7pdnfxhvfa",
            "price": 1361000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Add a stylish touch to your wardrobe with this Women's Fashion Loose Large Size Bottoming Shirt with Lace Collar! This shirt is crafted from polyester fiber and features popular elements like ruffles, buttons, and solid colors. It has a regular fit with a lotus leaf collar and long sleeves. Shop with confidence with our quality assurance and satisfaction guarantee! Shop now and get priority delivery!"
        },
        {
            "title": "Women's 2022 Spring/Autumn JK Uniform Full Set - Shirt, Coat, Skirt",
            "path": "https://shopee.sg/2022-New-Spring-And-Autumn-JK-Uniform-Full-Set-Small-Hong-Kong-Style-Suit-Womens-Retro-Shirt-Coat-Skirt-Three-Piece-Set-One-Piece-Fashion-i.284383236.14671442885",
            "image": "https://down-sg.img.susercontent.com/file/ceb462e9d643767c6bdbe8b1f7742f4b",
            "price": 1362000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Look stylish and chic this season with this JK Uniform full set! This set features a shirt, coat, and skirt in a variety of colors. The shirt features a single breasted placket and long sleeves, while the coat and skirt are made with a polyester blend fabric. Perfect for any occasion, this set is sure to make a statement! Available in sizes S, M, L, and XL."
        },
        {
            "title": "ZANZEA Women Muslim Fashion Casual Balloon Sleeve Top & Elastic Waist Wide Leg Pants Set",
            "path": "https://shopee.sg/ZANZEA-Women-Muslim-Fashion-Casual-Balloon-Sleeve-Top-Elastic-Waist-Wide-Leg-Pants-Set-i.26974701.20040243142",
            "image": "https://down-sg.img.susercontent.com/file/9ce6a1b1e13182ca0d011ac7a0205dd5",
            "price": 1948000,
            "location": "Mainland China",
            "rating": 4.858823529411764,
            "sold": 18,
            "description": "Look stylish and feel comfortable in this ZANZEA Women Muslim Fashion Casual Balloon Sleeve Top & Elastic Waist Wide Leg Pants Set. It features a solid color design with side pockets, full sleeve length, an O-neck, and an elastic waist. Available in Green, Grey, Navy, and Khaki, this leisure, bohemian, retro, and Europe style set is perfect for family, party, beach, wedding, and holiday occasions."
        },
        {
            "title": "ZANZEA Muslim Sets Women's Casual O-Neck Blouse and Pants Suits",
            "path": "https://shopee.sg/ZANZEA-Fashion-Muslim-Sets-Women-Casual-Long-Sleeve-Blouse-Pants-Suits-Two-Piece-Sets-i.209371558.20149225529",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22090-aaqqvx5cvuhvc0",
            "price": 1915000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "Look stylish and fashionable in this ZANZEA Muslim Sets Women's Casual O-Neck Blouse and Pants Suits. It is made of 95% Polyester and 5% Spandex and comes in four colors: Beige, Coffee, Dark Green and Grey. The full sleeve blouse features an elastic waist, side pockets, and a stripe print. The ankle length pants has buttons on the back and slits on both sides of the hem. Perfect for family gatherings, parties, beach days, weddings, holidays and more. Please refer to the size chart before ordering."
        },
        {
            "title": "Women's Korean Fashion Graphic Knitted Sweater",
            "path": "https://shopee.sg/Korean-Fashion-Graphic-Knitted-Sweater-Woman-Harajuku-Sweet-Oversized-Cropped-Tops-Off-Shoulder-Casual-Loose-Jumper-Y2K-i.73654094.21732943802",
            "image": "https://down-sg.img.susercontent.com/file/e5643cfedbc77eb4db6232247b340d9d",
            "price": 1458000,
            "location": "Mainland China",
            "rating": 4.761904761904762,
            "sold": 6,
            "description": "Look stylish and on-trend with this Korean fashion graphic knitted sweater. This oversized cropped top features an off-shoulder design with a casual loose fit. Made from acrylic material, it has a hollow out detail and a butterfly pattern. The perfect piece for street style, it's perfect for the spring and autumn seasons. Available in multiple sizes, this sweater is sure to become your favorite go-to."
        },
        {
            "title": "Women's Korean Oversized Loose T-Shirt - Hiphop BF Fashion",
            "path": "https://shopee.sg/cbooky-Korean-Women-Oversized-Loose-T-shirt-Hiphop-Ins-BF-Fashion-Short-Sleeve-Tee-i.58390723.2512718466",
            "image": "https://down-sg.img.susercontent.com/file/9b5e2e39e2ae00139fdfc0e8c6236b11",
            "price": 756000,
            "location": "Mainland China",
            "rating": 4.616822429906542,
            "sold": 7,
            "description": "Get ready to turn heads in this stylish Korean Oversized Loose T-Shirt. This short sleeve tee features a classic round neckline, letter prints, and is made from a lightweight and comfortable polyester fabric. Available in sizes M, L, XL, and 2XL in a variety of colors. Perfect for casual and fashionable looks. Please refer to the size chart below before ordering."
        },
        {
            "title": "【Your～百魅fashion】❀Two-piece Skirt 2021 Spring & Summer Sling Fairy Long Skirt Hollow Thin Knit Sweater Plus Size Women's Clothing",
            "path": "https://shopee.sg/YourfashionReady-StockTwo-piece-skirt-2021-spring-and-summer-new-sling-fairy-long-skirt-hollow-thin-knit-sweater-fashion-plus-size-womens-clothing-Fashion-women-i.447467381.11909638188",
            "image": "https://down-sg.img.susercontent.com/file/021050aa34006411d84533917301275f",
            "price": 421000,
            "location": "Mainland China",
            "rating": 4.490196078431373,
            "sold": 27,
            "description": "Welcome to our store! Quality is our top priority and all customers are our friends. This two-piece skirt set for women is perfect for the spring and summer season. It features buttons, hollow, and lace detailing for a stylish look. The fabric is made of polyester fibre and contains 100% of the ingredient. This fashionable piece is suitable for young and middle-aged women (26-40 years old). No velvet is added. Get this fashionable two-piece skirt set today!"
        },
        {
            "title": "Xiaozhainv Women's 3 Color Turtleneck Sweater Vest T-shirt",
            "path": "https://shopee.sg/Xiaozhainv-3-Color-women-clothes-Fashion-All-Match-turtleneck-sweater-Sleeveless-tops-Knitted-top-Vest-T-shirt-i.25924280.11247629702",
            "image": "https://down-sg.img.susercontent.com/file/a5433fd6659f4518c2f5418bb129249a",
            "price": 896000,
            "location": "Mainland China",
            "rating": 4.6187214611872145,
            "sold": 37,
            "description": "Add a stylish touch to your wardrobe with this 3-color turtleneck sweater vest T-shirt from Xiaozhainv. Crafted from a soft and breathable fabric, this sleeveless top is designed with a knitted pattern for a modern look. It features a comfortable fit with a round neckline and a curved hemline. The perfect all-match piece for any occasion, pair it with jeans or shorts for a casual look. Please consult the customer service staff before purchase, and we will recommend you the right size. Real color of the item may be slightly different from the pictures shown on website, caused by many factors such as brightness of your monitor and light brightness."
        },
        {
            "title": "BOMBER HODIE Women's Jacket - KING FASHION",
            "path": "https://shopee.sg/Newsfashion-BOMBER-HODIE-Jacket-For-Women-KING-FASHION-i.264912490.4635747098",
            "image": "https://down-sg.img.susercontent.com/file/0eee369312e23c13f9420b782e7b74fe",
            "price": 702000,
            "location": "Indonesia",
            "rating": 4.5,
            "sold": 0,
            "description": "Make a statement with the BOMBER HODIE Jacket from KING FASHION. Crafted from Babyterry material, this jacket is sure to keep you warm and stylish all season. Available in two sizes (L & XL): "
        },
        {
            "title": "Women's YDM Retro T-shirt Chain Short-sleeved Tee",
            "path": "https://shopee.sg/YDM-Chic-Retro-T-shirt-Chain-Short-sleeved-Tee-For-Women-Summer-Ins-Fashion-Loose-Deep-V-Back-Solid-Color-T-shirts-i.218181785.12310029153",
            "image": "https://down-sg.img.susercontent.com/file/9da731700c4714fca4d398c8365bf859",
            "price": 568000,
            "location": "Mainland China",
            "rating": 4.9411764705882355,
            "sold": 3,
            "description": "Add a touch of retro chic to your wardrobe with this YDM T-shirt Chain Short-sleeved Tee! Crafted from milk protein fiber and cotton, this loose-fitting tee features a deep V-back and solid color design. Available in sizes M-XL, this stylish top is perfect for a casual summer look. Please check the size chart before ordering and note that manual measurement may have an error of 1-3 cm. Shop this T-shirt Chain Short-sleeved Tee now and enjoy a stylish summer look!"
        },
        {
            "title": "Korean Solid Sleeveless Loose T-Shirt Top - 6 Colors",
            "path": "https://shopee.sg/X-style6-colourKorean-solid-sleeveless-loose-fashion-T-shirt-top-i.273592794.21326754057",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22100-tus3n274caiv28",
            "price": 498000,
            "location": "Mainland China",
            "rating": 4.6855123674911665,
            "sold": 551,
            "description": "Stand out in style with this Korean Solid Sleeveless Loose T-Shirt Top. Available in 6 colors – black, yellow, white, light khaki, dark coffee, and dark blue – this top is perfect for any occasion. Crafted with a blend of cotton and polyester, this top is comfortable and breathable. Choose from sizes M, L, XL, and 2XL."
        },
        {
            "title": "Korean T-Shirt - Summer Short Sleeve Top for Women",
            "path": "https://shopee.sg/100-Cotton-New-Korean-T-Shirt-Fashion-Spot-Ladies-Summer-Short-Sleeve-T-Shirt-Clothes-Crew-Neck-Top-i.255115705.21905090280",
            "image": "https://down-sg.img.susercontent.com/file/4c323f249eb676396003ca8f88cd7d6f",
            "price": 1134000,
            "location": "Mainland China",
            "rating": 4.6875,
            "sold": 19,
            "description": "Stay stylish and comfortable with this Korean T-Shirt featuring a crew neckline and short sleeves. Made with 100% cotton, this top is perfect for the summer season. Available in sizes M to 5XL. Please refer to the size chart for measurements. Package includes one T-Shirt. Suitable for casual or daily wear."
        },
        {
            "title": "Women's Stylish Round Neck Strapless Short T-shirt",
            "path": "https://shopee.sg/New-Fashion-Labeling-Slim-Round-Neck-Strapless-Short-T-shirt-Women-Black-i.65885656.9622922783",
            "image": "https://down-sg.img.susercontent.com/file/e2c2928a8227fcb324611e58432a6734",
            "price": 955000,
            "location": "Mainland China",
            "rating": 4.782608695652174,
            "sold": 13,
            "description": "Look stylish and comfortable in this Women's Stylish Round Neck Strapless Short T-shirt. It is made of high quality cotton fabric, with a round neck design that fits the neck curve and stretches the neck line for a comfortable wearing experience. It features a fine plain cloth, long sleeve, no decoration, letters pattern, cut off sleeve and a casual style. Available in sizes S to L, this T-shirt is perfect for work, date, school, party, travel and shopping. Machine washable."
        },
        {
            "title": "Korean Loose Fashion Sweater Coat 2022 Academic Style Casual Two-Piece Set Women's Suit ",
            "path": "https://shopee.sg/Sports-Women-Suit-2022-Academic-Style-Korean-Loose-Fashion-Sweater-Coat-Casual-Two-piece-Set-Woman-i.95570154.21439756434",
            "image": "https://down-sg.img.susercontent.com/file/9ded3fa6b3dbe2dbd0bc66cc10ef5adf",
            "price": 1933000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 1,
            "description": "Look effortlessly stylish in this Korean Loose Fashion Sweater Coat 2022 Academic Style Casual Two-Piece Set Women's Suit! It features a classic two-piece set design with a longline sweater coat and a matching skirt. Available in a variety of colors, including white, black, blue, orange, and pink. Choose from sizes S, M, L, XL, and 2XL for a perfect fit."
        }
    ]
}