{
    "query": "Art and Craft Supplies",
    "region": "Singapore",
    "total": 6983,
    "results": [
        {
            "title": "Create Beautiful Undersea Aquarium Art with Kids' Handmade Clay DIY Kit",
            "path": "https://shopee.sg/Children-Handmade-Creative-Art-Painting-Toys-Undersea-Aquarium-Clay-diy-Kindergarten-Work-Material-Package-i.419217874.22727080136",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-sw3qk9aiaknvb0",
            "price": 551000,
            "location": "Mainland China",
            "rating": 3,
            "sold": 2,
            "description": "Give your kids an incredible creative experience with this Handmade Clay DIY Kit! This set includes all the materials they need to create a stunning Undersea Aquarium artwork. With step-by-step instructions, your children will learn art knowledge and gain a sense of accomplishment. Plus, it helps to exercise their hand-eye coordination and develop creative thinking. Buy your own coloring tools and let the creative journey begin!"
        },
        {
            "title": "Upgrade Your Kids' Creativity with HDY 3D Printing Pen!",
            "path": "https://shopee.sg/HDY-3D-Pen-Toys-Kids-Digital-Intelligent-3D-Printing-Pen-High-Temperature-DIY-Print-Drawing-Pens-Graffiti-with-Printing-Supplies-PLA-Filament-Painting-Doodle-Arts-Crafts-3D-Children-USB-Cable-Draw-Tool-Birthday-Gift-for-Boys-Girls-i.101833097.3154085499",
            "image": "https://down-sg.img.susercontent.com/file/37595321bcc5f87a93718ca60595b57e",
            "price": 399000,
            "location": "Mainland China",
            "rating": 4.602150537634409,
            "sold": 7,
            "description": "Unleash your kids' creativity with HDY 3D Printing Pen! This intelligent 3D printing pen is perfect for kids to create toys by themselves, which is very beneficial to develop their hands-on skills and mental development ability. It is made of high quality materials and with multiple colors, kids can draw whatever they image. It also features friendly filament to touch and speed control temperature adjustment. Buy now and get 3m filament (random color) and USB cable for free! Shop worry-free with us and get 100% authenticity guaranteed."
        },
        {
            "title": "50ml Simulation Cream Glue - Creative Material for DIY Phone Cases, Hairpins & More!",
            "path": "https://shopee.sg/50ml-Simulation-Cream-Glue-Childrens-Toys-Handmade-diy-Design-Material-Phone-Case-Hairpin-Frame-Surrounding-Beauty-Creative-Material-Childrens-Gift-i.915290312.22736439579",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-lf41kyz15dm72d",
            "price": 178000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 35,
            "description": "Our 50ml Simulation Cream Glue is perfect for making creative projects such as phone cases, hairpins, frames, and more! This material is made from resin and comes with a flower mouth. To use, simply squeeze the cream glue onto your project and let it dry naturally in a cool and ventilated place. After 24 hours, the coloring layer will be dry and the coloring thickness will take about 72 hours. Please note that this product is not edible and should be kept away from direct sunlight. All orders will be shipped within 1-2 days. If there is any damage to the goods received, please contact us immediately and we will arrange for re-sending or refund processing. Follow us to get exclusive coupons and discounts!"
        },
        {
            "title": "DIY Toy Book - Creative Quiet Book Decompression Toy Book with Cartoon Kuromi Melody for Kids",
            "path": "https://shopee.sg/DIY-Toy-Book-Childrens-Cartoon-kuromi-Melody-Creative-Quiet-Book-Decompression-Toy-Book-Semi-Finished-Product-Changing-Material-Package-i.477440506.23568018505",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lguig96r9ahwf3",
            "price": 245000,
            "location": "Mainland China",
            "rating": 4.565217391304348,
            "sold": 77,
            "description": "Get creative with this DIY Toy Book! This kit includes drawings, cotton, double-sided tape, and transparent tape (scissors not included). With this kit, you can make your own unique Toy Book featuring the beloved cartoon character Kuromi Melody. Choose from mini size (6*7CM) or normal size (9*12CM). Get your creative juices flowing and make something special with this DIY Toy Book!"
        },
        {
            "title": "50 Sheets Shrink Film Kit - DIY Craft Ornaments Pendants Earrings Keychains Accessories",
            "path": "https://shopee.sg/Office50-Sheets-Shrink-Films-Kit-Shrinky-Art-Film-Paper-Heat-Shrink-Sheets-for-DIY-Craft-Ornaments-Pendants-Earrings-Keychains-Accessories-79-57-Inches-i.277026990.14225132535",
            "image": "https://down-sg.img.susercontent.com/file/4a279ff239c93018824a569f3f4aadb9",
            "price": 1589000,
            "location": "Mainland China",
            "rating": 4.7555555555555555,
            "sold": 43,
            "description": "Create beautiful DIY craft ornaments with this 50 sheet shrink film kit! Featuring 0.2mm thick heat-shrink sheets in a transparent or translucent color, these sheets measure 7.9 * 5.7 inches and are perfect for making pendants, keychains, earrings, necklaces, bookmarks and other accessories. Draw your favorite patterns on the sheet, cut it out with scissors and watch it shrink after heating. Unleash your imagination and have fun crafting your own unique pieces!"
        },
        {
            "title": "2000+ Piece DIY Arts and Crafts Supplies Kit - Educational Gift for School and Home Crafting Projects",
            "path": "https://shopee.sg/DIY-Arts-and-Crafts-Supplies-Kit-Set-Activity-Craft-Materials-with-Carrying-Box-Handmade-Educational-Gift-for-School-Kindergarten-Home-Craft-Art-Supplies-i.277026990.12506585451",
            "image": "https://down-sg.img.susercontent.com/file/e400ac8ca5f6aa8de3ec684069f7f5e5",
            "price": 1592000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 15,
            "description": "Unleash your creativity with this 2000+ piece DIY Arts and Crafts Supplies Kit! Perfect for classrooms or home projects, this kit includes wood sticks, cute eyes, pompoms, beads, paper, safety scissors, pipe cleaners, sequins, buttons, and a plastic carrying box. With this set, students can use their imagination to create unique artworks and express their creativity. Get yours today and start creating!"
        },
        {
            "title": "🇸🇬[SG Stock] Complete DIY Art Supplies for Kids - Folding Box Crafts Set for Home, Kindergarten and School Arts & Crafts ",
            "path": "https://shopee.sg/SG-Stock-Complete-DIY-Art-Supplies-for-Kids-All-in-One-Crafting-School-Kindergarten-Home-Arts-Set-Crafts-Folding-Box-i.650404568.16920786142",
            "image": "https://down-sg.img.susercontent.com/file/fb151ae7f8c4860c86e8ae04fce32341",
            "price": 1331000,
            "location": "SG",
            "rating": 4.833333333333333,
            "sold": 16,
            "description": "Unleash your creativity with this all-in-one DIY craft set! Perfect for kids to explore their imagination and develop innovative skills. With a range of materials such as clips, toy eyes, scissors, wooden sticks, feathers, and colored paper, this set is great for indoor activities and family time. No fixed template, let your imagination run wild and decorate as you like. Great for Christmas, birthday, and holiday gifts!"
        },
        {
            "title": "🔥High-Quality Mica Pigment Powder for Epoxy Resin DIY Art & Crafts Jewelry Nails Slime Dye",
            "path": "https://shopee.sg/SG-Mica-Pigment-Powder-High-Quality-Mica-Pigments-for-Epoxy-Resin-DIY-Art-Craft-Jewelry-Nails-Slime-Epoxy-Resin-Dye-i.267712007.19623311039",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134202-7qvex-lgm16g66chdxed",
            "price": 128000,
            "location": "SG",
            "rating": 4.951219512195122,
            "sold": 197,
            "description": ""
        },
        {
            "title": "Wooden Sensory Toys - Montessori Busy Board for Toddlers - Fine Motor Skills Travel Toy",
            "path": "https://shopee.sg/Montessori-Busy-Board-for-Toddlers-Wooden-Sensory-Toys-Toddler-Learning-Activities-for-Fine-Motor-Skills-Travel-Toy-Educational-Toys-for-Kids-i.410931893.11036111235",
            "image": "https://down-sg.img.susercontent.com/file/1b93805392baa87898fd79d2093ffdf3",
            "price": 519000,
            "location": "Mainland China",
            "rating": 4.894736842105263,
            "sold": 4,
            "description": "Help your little one learn essential dressing life skills with this Montessori Busy Board! Made of natural wood, this busy board is perfect for 1-2 year olds, encouraging precise movements and sensory exploration. It's also great for traveling, with no hard corners for added safety. Get your toddler their own educational toy today! Includes 1 Piece Busy Board (39x29.5x1.5cm/15.35x11.61x0.59inch)."
        },
        {
            "title": "DIY Handmade 3D Painting Decorative Mosaic Creative Ornaments Home Decorations Kids' Educational Art & Handicrafts Set",
            "path": "https://shopee.sg/diy-Handmade-Three-Dimensional-Painting-Decorative-Mosaic-Creative-Ornaments-Home-Decorations-Childrens-Educational-Material-Package-Art-And-Handicraft-Set-Work-Materials-i.419217874.13293083193",
            "image": "https://down-sg.img.susercontent.com/file/c02ff26c186a0ba3b9e1844b269c74b2",
            "price": 1620000,
            "location": "Mainland China",
            "rating": 4.3,
            "sold": 6,
            "description": "Create beautiful art and craft projects with this DIY Handmade 3D Painting Decorative Mosaic Creative Ornaments Home Decorations Kids' Educational Art & Handicraft Set! This set includes solid wood and glass materials, a 20x20cm white frame, and a special glue for patching and caulking. Get creative and start making unique decorations for your home!"
        },
        {
            "title": "DIY Handmade Material Bag Goo Bag Set - Perfect Children's Day Gift!",
            "path": "https://shopee.sg/Cheap-cream-glue-goo-card-big-set-hand-account-sticker-diy-handmade-material-bag-goo-bag-cheap-set-childrens-and-girls-toy-reward-gift-Childrens-Day-gift-i.915290312.22066341833",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfk-lg3k0it2z6rqa0",
            "price": 1158000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 9,
            "description": "Get this amazing DIY Handmade Material Bag Goo Bag Set, perfect for Children's Day gift! Comes with cream glue, goo card, big set, hand account sticker, and more. Available in pink and purple - default color is pink. All orders will be shipped within 1-2 days. If there is any damage to the goods received, please contact the store Xiaoer immediately for re-sending or refund processing. Follow this store to get coupons and more full discount coupons! Write a good review when you receive the goods and get a store coupon. Shop now!"
        },
        {
            "title": "26 Colors Epoxy Resin Pigment - Highly Concentrated Colorant for Resin Art, DIY Jewelry Making & Paint Crafts",
            "path": "https://shopee.sg/Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
            "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
            "price": 2148000,
            "location": "Mainland China",
            "rating": 4.851063829787234,
            "sold": 0,
            "description": "Get creative with our 26 Colors Epoxy Resin Pigment! Highly concentrated and easy to use, these epoxy resin colorants are perfect for resin art, DIY jewelry making, painting, and other crafts. Each bottle contains 10ml of non-toxic, cruelty-free pigment, for a total of 260ml of colorant. Mix the pigment with epoxy resin for the best color effect and no catalyst needed. Get started on your next project today!"
        },
        {
            "title": "Gupan Sticker Set Girl Children Stationery | 427-832 Pieces of Luxury Cards & Storage Box | DIY Gift Pack",
            "path": "https://shopee.sg/Guka-Sticker-Set-Girl-Children-Stationery-Gupan-Handbook-Material-Full-Handmade-diy-Gift-Pack-i.891301032.18668008086",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-zxl37tzqjskv60",
            "price": 4860000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 0,
            "description": "Welcome to our store! We offer a variety of exquisite handmade stationery sets for children, including the Guka Sticker Set. With 427-832 pieces of luxury cards and a three-layer storage box, this set is perfect for personal gifts or special occasions. Crafted with PPC material, this set is sure to bring a smile to your little one's face. Enjoy free shipping when you reach the marked free shipping threshold. Plus, if you have any after-sales questions, you can contact us at any time. Please note that due to the resolution of the computer screen, brightness, contrast, etc., the real color may be slightly different from the picture. Also, the product dimensions are all measured by hand, please allow 1-2CM difference. Buy yours today!"
        },
        {
            "title": "American Black Walnut Wood Square Plate DIY Material for Sculpting, Customization, and Crafts",
            "path": "https://shopee.sg/American-Black-Walnut-Wood-Raw-Wood-Square-Premium-DIY-Plate-Material-Handmade-Material-Sculpting-Materials-CustomizationWood-Block-wood-material-Carving-Wooden-DIY-craft-i.469283559.20447361480",
            "image": "https://down-sg.img.susercontent.com/file/e62accf73e521a793e75e58366369913",
            "price": 972000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Create unique sculptures, decorations, and crafts with this premium American Black Walnut Wood Square Plate DIY Material! This raw wood plate is perfect for customizing and sculpting, giving you the perfect material for your creative projects. With its durable and long-lasting quality, this wood plate is sure to be an essential addition to your crafting supplies."
        },
        {
            "title": "30pcs Retro Letter Sheet Material Paper for DIY Crafts, Junk Journal, Planner, Scrapbooking & More!",
            "path": "https://shopee.sg/30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
            "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
            "price": 210000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 4,
            "description": "Add a touch of vintage charm to your DIY projects with these 30 pieces of letter sheet material paper! Perfect for decorating diaries, notebooks, planners, albums, letters, gift boxes, bottles, cups, scrapbooks, cellphones and more. Each sheet measures approximately 110 x 150mm. Get creative and start crafting today!"
        },
        {
            "title": "20 Pcsbox DIY Real Dried Flowers for Nail Art, Craft Making, and Jewellery Decoration",
            "path": "https://shopee.sg/20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
            "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
            "price": 350000,
            "location": "Mainland China",
            "rating": 4,
            "sold": 0,
            "description": "Create beautiful crafts with these 20 Pcsbox DIY Real Dried Flowers! Perfect for nail art, jewellery making, aromatherapy, epoxy handmade accessories, and more. Each flower is unique in size, shape, and color. Noted: Dried flowers can be put in glued, but not soaked in water. Add a natural touch to your crafts and decorations with these beautiful dried flowers!"
        },
        {
            "title": "2mm Thin Unfinished Basswood Sheet for Crafts, Model Building, Sand Table, and Decor",
            "path": "https://shopee.sg/2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
            "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
            "price": 658000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 3,
            "description": "Create beautiful models and decorations with this 2mm thin unfinished basswood sheet! Perfect for model making, sand table scenery, diorama wargame scenes, and other painted model architecture scenery. Lightweight and durable, this basswood sheet is available in various sizes to suit your needs. Includes 5/10 pieces of basswood sheets. Colors may vary slightly due to individual monitor calibration. Please allow for slight measurement deviations due to manual measurements."
        },
        {
            "title": "30/60 Colors Dual Head Marker Pen Set | Kids Drawing & Art Supplies | Non-Toxic & Safe | Ideal for Coloring Pages, Sketching & Blending | Best Gift for Kids!",
            "path": "https://shopee.sg/2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
            "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
            "price": 910000,
            "location": "SG",
            "rating": 4.78125,
            "sold": 10,
            "description": "Get creative with this amazing 2-in-1 Dual Head Marker Pen Set! This 30/60 colors set is made of environmentally friendly and healthy raw materials, non-toxic and tasteless, and can be used with confidence. Suitable for primary school students and even college students who like to draw, this set provides a stylish and natural wood look for your toddler or older kids, making the color more interesting. Fast creativity and a great complement to the teen art and craft collection. Comes in a gift box to organize your coloring pencil series - the best gift for kids on birthdays and Christmas!"
        },
        {
            "title": "Resin Mixer - Handheld Electric Epoxy Stirrer for DIY Epoxy Resin Crafts Making",
            "path": "https://shopee.sg/Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
            "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
            "price": 521000,
            "location": "Mainland China",
            "rating": 4.833333333333333,
            "sold": 3,
            "description": "Create beautiful epoxy resin crafts with ease using this powerful handheld electric epoxy stirrer! With its 14,000 rpm motor, it quickly mixes epoxy resin for glitter tumblers with just the press of a button. The stainless steel shaft and spiral head are easy to clean and the ergonomic handle is comfortable to grip. Battery operated (batteries not included), this cordless mixer is stylishly designed in matte black with a shiny black stripe. Get your epoxy resin projects done quickly and easily with this handheld epoxy stirrer! Package includes 1 tool (batteries not included)."
        },
        {
            "title": "10g Mixed Color Soft Pottery Candy Pellets - DIY Resin Jewelry Crafts for Decoration, Accessories & Toys",
            "path": "https://shopee.sg/MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
            "price": 90000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 4,
            "description": "🎁 Create beautiful DIY jewelry, phone cases, and hair accessories with these 10g Mixed Color Soft Pottery Candy Pellets! Made with environmentally friendly resin, these pellets are perfect for crafting and making unique decorations. Please note that this product is not edible. We have all items in stock and will ship them out as soon as possible. If you have any questions, don't hesitate to reach out to us! We're here to help with any issues you may have. So go ahead and give these pellets a try - you won't be disappointed!"
        }
    ]
}