{
    "query": "Travel and Adventure",
    "region": "Singapore",
    "total": 931,
    "results": [
        {
            "title": "Front Runner Easy-Out Awning 2 Metre for Vehicle Expedition and Camping",
            "path": "https://shopee.sg/Front-Runner-Easy-Out-Awning-2-Metre-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.23869468504",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfo-lheke3j7ujb348",
            "price": 79900000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Get instant shelter from the sun or rain with this Easy-Out Awning 2 Metre. Quick and easy two-person set up in under 60 seconds. Mounts to the side of your Front Runner Roof Rack for convenient use. Water-repellent, UV-resistant awning measures 2m wide and extends 2.1m from mounting extrusion. Lightweight, yet durable, vertical support poles have spikes on the end for secure ground placement and extend to 2.4m maximum height. Includes reflective gut ropes with tent stakes for stability in windy conditions. Durable, heavy-duty PVC coated 650g nylon cover protects your awning while stowed and in transit. Universal mounting hardware included. Add additional sun/rain protection with the Wind/Sun Break for 2M Awning / Front or Wind/Sun Break for 1.4M/"
        },
        {
            "title": "Nike2729(37L) - The Ultimate Travel Bag for Adventure Seekers - Waterproof, Tear-Resistant, Wet/Dry Separation, Shoe Pocket",
            "path": "https://shopee.sg/Nike272937L-The-Ultimate-Travel-Bag-for-Adventure-Seekers-Water-Resistant-Tear-Resistant-WetDry-Separation-Shoe-Pocket-Large-Capacity-QEWJ-i.1013192516.22170269662",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdn-leyp6gih7fcj88",
            "price": 3834000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Ready to explore the world? Get the perfect companion for your travels with the Nike2729(37L) Travel Bag. Made of high quality ripstop fabric, this bag is waterproof and rainproof, with separate shoe pockets and wet and dry separation pockets for easy storage and keeping your items clean and dry. Handheld or crossbody design, lightweight and convenient, with a large capacity to store all your essentials. Buy it and enjoy the high quality and many practical features. Make your next adventure even more enjoyable with the Nike2729(37L) Travel Bag!"
        },
        {
            "title": "LED Flashlight 350LM COB Long Range Lantern 4 Modes USB Rechargeable",
            "path": "https://shopee.sg/LED-Flashlight-350LM-COB-Long-Range-Lantern-4-Modes-for-Outdoor-Travel-Adventure-i.163968906.23070939554",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdf-lhzvf8g2ft5xbe",
            "price": 617000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Brighten up your outdoor adventures with this powerful LED Flashlight! It features 4 lighting modes (strong light, weak light, flashing and COB side lamp), long range lantern, rechargeable 800mAh 18650 lithium-ion battery, Type-C USB charging, power display and IPX4 waterproof grade. Perfect for camping, hiking, driving at night, emergencies and more."
        },
        {
            "title": "🎀For BMW R1200GS LC Adventure Luggage Bag🎀",
            "path": "https://shopee.sg/NEWFor-BMW-R1200GS-LC-Adventure-Luggage-Bag-for-Vario-Case-Inner-bag-for-BMW-GS-R1200-1250-LC-Adventure-Side-Case-Inne-i.1003457135.22343794545",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvek-lhaex45uohsc25",
            "price": 2650000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "High quality 810D PVC-coated polyester fabric luggage bag for BMW R1200GS LC Adventure Vario Side Cases. Water resistant and extensible, this bag is perfect for storing and protecting your items. Features a 20cm diameter, 14cm height, 30cm width and 36cm length. 100% brand new and comes with a 1 Bag package. Compatible with BMW R1200GS/ADV, R1250GS/ADV, F750GS/ADV and F850GS/ADV. Buy with confidence and enjoy our after sale services."
        },
        {
            "title": "45mm Precision Compass for Camping, Hiking, Climbing & Travel",
            "path": "https://shopee.sg/Wholesale45mm-Precision-Compass-For-Camping-Travel-Mountain-Climbing-Outdoor-Adventure-Survival-Pointing-Tool-Portable-Mini-Compass-Hiking-Practical-Guide-i.290987482.21890341080",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-29gpz0f0pzkv9c",
            "price": 63000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next outdoor adventure with this 45mm Precision Compass! With a compact design, it is the perfect tool to help you stay on track during your travels. Made from ABS and Acrylic, this mini compass is perfect for camping, hiking, climbing and traveling. Package includes 1* Compass. Buy now to get your hands on this essential tool for your next outdoor adventure!"
        },
        {
            "title": "Motorcycle Tail Bag 22L - Rear Seat Bag for R1200GS R1250GS F800GS Z750 Z800 G310R LC Adventure",
            "path": "https://shopee.sg/NEWMotorcycle-Tail-Bag-22L-Rear-Seat-Bag-For-R1200GS-R1250GS-F800GS-Z750-Z800-G310R-LC-Adventure-Expandable-Back-Seat-i.1003462474.23469273888",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdr-lhajwb54gah304",
            "price": 6137000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Keep your belongings safe and secure with this Motorcycle Tail Bag! This 22L bag is made from waterproof 600D Oxfords cloth and is designed to fit most motorcycles, including BMW R1200GS R1250GS Adventure, F850GS F800GS F650GS K1200S, SUZUKI GSX-R 1000 1300 600 750, Honda CB600RR CBR1000RR NC750, YAMAHA TRACER 900 MT09 MT10 FZ07 09, Road Glide Road King, Street Glide, and Electra Glide. It is expandable and perfect for tourist, riding, hiking, camping, and climbing. Shop now and enjoy our after sale services!"
        },
        {
            "title": "M-Power T-Shirt - Maglietta Camiseta M3 M5 M8 X5 X7 IX E30 530 Personalised Christmas Gifts",
            "path": "https://shopee.sg/M-Power-T-shirt-Maglietta-Camiseta-M3-M5-M8-X5-X7-IX-E30-530-Personalised-Christmas-Gifts-Travel-Adventure-Sport-i.1035931097.19082178482",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-qwst8yutx4jva6",
            "price": 1755000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get your unique M-Power T-shirt and show your style! Our store specializes in selling all kinds of fashionable men's clothing with excellent quality. Available in sizes XXS to 5XL, this breathable and hygroscopic t-shirt is perfect for personal customizations, company uniforms, marathon sportswear, travel group uniforms, sportswear customizations, school uniforms, optional clothing customizations, gift customizations, running clothing customizations, and team clothing customizations. For the best fit, please refer to the size chart and the example of actual customers. Buy now and get an additional discount coupon!"
        },
        {
            "title": "Lightweight and Durable Travel Backpack for Outdoor Adventures",
            "path": "https://shopee.sg/Spacious-and-Lightweight-Travel-Backpack-for-Outdoor-Adventures-i.1016645076.21082721173",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvea-lk7nutiv6kbv49",
            "price": 3343000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next outdoor adventure with this lightweight and durable travel backpack! Crafted from waterproof and wear-resistant nylon, it offers ample storage space for all your essentials. The foldable design and adjustable shoulder straps make it easy to store and comfortable to carry. Perfect for hiking, trekking, and exploring new places, this reliable and functional backpack is a must-have for any traveler!"
        },
        {
            "title": "LED Camping Flashlight Portable COB Torch Lamp with Type-C USB Rechargeable",
            "path": "https://shopee.sg/LED-Camping-Flashlight-Portable-COB-Outdoor-Lighting-for-Travel-Hiking-Adventure-i.217565522.22850744630",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvg0-lk7kh9vcccrb87",
            "price": 2501000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "LED Camping Flashlight Portable COB Torch Lamp with Type-C USB Rechargeable is designed for outdoor use and is perfect for camping, hiking, and fishing trips. It features dual light sources, anti-slip texture, emergency power supply, low battery reminder, and satisfaction guarantee. The XHP70 LED+COB (white light+red light) can produce up to 1200-1500 lumens and a range of up to 200-300 meters. It is IPX4 waterproof and comes with a telescoping zoom. It runs on 1*18650/1*26650/3*AAA batteries (not included). Get ready for your next adventure with this powerful LED flashlight!"
        },
        {
            "title": "350LM COB LED Flashlight - 4 Modes, Long Range Lantern, USB Rechargeable",
            "path": "https://shopee.sg/LED-Flashlight-350LM-COB-Long-Range-Lantern-4-Modes-for-Outdoor-Travel-Adventure-i.217565522.18391687805",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdd-lk7ki6osh2mv58",
            "price": 1098000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next outdoor adventure with this 350LM COB LED Flashlight! Featuring 4 lighting modes, a long range lantern, and USB rechargeable, this flashlight is perfect for camping, hiking, and exploring. With an IPX4 waterproof rating, you can use it in all weather conditions. Built-in 800mAh 18650 lithium-ion battery and power display keep you aware of battery usage. Get yours today!"
        },
        {
            "title": "Kate Spade New York Insulated Tumbler with Reusable Straw and Lid - Adventure Stripe",
            "path": "https://shopee.sg/Kate-Spade-Stationery-Insulated-Tumbler-with-Reusable-Straw-Acrylic-Travel-Cup-with-Lid-Adventure-Stripe-i.352772283.15199228860",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qve7-lk0pjg7ywufe94",
            "price": 3695000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Enjoy your favorite drinks on-the-go with this stylish insulated tumbler from Kate Spade New York. The 24 oz tumbler features a double wall design that keeps drinks cool and the cup free of condensation, and the lock-tight lid includes a reusable straw that won't break. The slim design fits easily into most standard cupholders and the 3-inch (7.62 cm) opening allows for hassle-free cleaning. The cup is made of BPA-, lead-, and phthalate-free acrylic so your drink is rid of any harsh chemicals, and can be refilled and reused endlessly to help reduce plastic waste. The tumbler is featured in a fun striped design with a solid pink lid and straw, and the Kate Spade New York logo is printed in shiny gold lettering near the base."
        },
        {
            "title": "700ml Collapsible Water Bottles - Reusable, Portable & Durable",
            "path": "https://shopee.sg/GDT-700ml-Set-of-Collapsible-Water-Bottles-Reusable-Festival-Collapsible-Bottle-for-Hiking-Adventure-Travel-i.183462393.14597936172",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvf3-lk7t1jz9lriv4a",
            "price": 869000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Keep yourself hydrated with this set of 700ml collapsible water bottles. Crafted from durable PE material, these bottles are perfect for camping, hiking, festivals and other outdoor activities. They are lightweight, portable and easy to store. Each bottle measures 22.6cm x 12.8cm when tiled and 12.8cm x 7.6cm when rolled up. Package includes 1 piece."
        },
        {
            "title": "Quack Travel Club - All 4 Volumes Picture Book by Tatsue Matsuoka",
            "path": "https://shopee.sg/Qiuxiang-Bookstore-Quack-Travel-Club-All-4-Volumes-Master-Picture-Book-Tatsue-Matsuoka-Natural-Popular-Science-3-6-Years-Old-Adventure-Story-i.902608561.14699242120",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdg-lk44ph6t2976a9",
            "price": 4482000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Explore the world of science and adventure with Quack Travel Club! This 4-volume picture book series by Tatsue Matsuoka is perfect for children aged 3-6 years old. Follow the fun and educational journeys of Quack as he discovers the wonders of the world. Published by Dolphin Publishing House and translated by Tian Xiujuan."
        },
        {
            "title": "LED Flashlight 3 Modes USB Rechargeable Camping Torch Lamp",
            "path": "https://shopee.sg/LED-Flash-Light-3-Modes-Camping-Flashlight-for-Travel-Hiking-Adventure-Emergency-i.217581377.18190272821",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvex-lik8of7f785p14",
            "price": 408000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "LED Camping Flashlight Torch Lamp with 3 Modes of Brightness, Waterproof and Anti Slip Design for Outdoor Activities like Hiking, Camping, Caving and Fishing. Built-in 500mAh 14500 Lithium-ion Battery for USB Rechargeable, Emergency Charging and Long Irradiation Distance. Perfect for Travel, Hiking, Emergencies."
        },
        {
            "title": "Quick Pitch Roof Top Tent - Perfect for Vehicle Expedition, Camping & Overland Use",
            "path": "https://shopee.sg/Quick-Pitch-Roof-Top-Tent-Quickpitch-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.18890253246",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvf8-lijmcl3z12o135",
            "price": 619900000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Our Quick Pitch Roof Top Tent is the perfect choice for vehicle expedition, camping and overland use. It features an easy self-opening tent working on gas assisted springs, three doors/openings on the ripstop canvas with built-in mosquito nets, double skinned ripstop canvas roof, upholstered 75mm high density foam mattress, aluminium ladder, shade/weather awning complete with spring rods and two telescopic aluminium tensioning poles. Enjoy your next adventure with this lightweight and easy to use tent!"
        },
        {
            "title": "Caterpillar City Adventure Backpack Trolley - Black",
            "path": "https://shopee.sg/Trips2travel-Caterpillar-City-Adventure-Backpack-Trolley-Black-i.602156973.14897651667",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvff-lhznjk415cqi43",
            "price": 14710000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "The Caterpillar City Adventure Backpack Trolley is a great choice for your next adventure. It features a large main compartment with a padded laptop compartment, adjustable shoulder straps, wheel cover, and a pull-out trolley handle. Carry it with ease using the top carry handle. Dimensions: 49.5 x 37 x 30 cm (H x W x D). Weight: 1.85kg. Volume: 32L. Material: 600D RPET."
        },
        {
            "title": "Leo's Play Cool Holiday Series Surprise Toys - Boys Travel Adventure Doll Figures",
            "path": "https://shopee.sg/Leos-Play-Cool-Holiday-Series-Surprise-Toys-Boys-Travel-Adventure-Trendy-Doll-Figure-i.1037706726.17795405427",
            "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lji6mhvk8fzo47",
            "price": 921000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for a fun-filled holiday adventure with Leo's Play Cool Holiday Series Surprise Toys! These trendy doll figures come in a variety of colors and sizes, and each one is uniquely designed to fit the holiday scene. Packaged in a carton box, these blind box toys are sure to bring a smile to your little ones' faces! Perfect for boys and girls of all ages, these surprise toys will keep your kids entertained for hours. Shop now and start the holiday fun!"
        },
        {
            "title": "Ridwana.id - 3in1 Waterproof Adventure Backpack Duffle Travel Bag",
            "path": "https://shopee.sg/Ridwanaid-Tas-Ransel-Duffle-3in1-Waterproof-For-Adventure-Backpack-Travel-Latest-Casual-Style-i.358942541.22975230280",
            "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul5-ljrxy267juoy54",
            "price": 1674000,
            "location": "Indonesia",
            "rating": 0,
            "sold": 0,
            "description": "Bring style and convenience to your travels with the Ridwana.id 3in1 Waterproof Adventure Backpack Duffle Travel Bag. Crafted from durable Bimo fabric, this bag features a sleek and modern design with a spacious main compartment, a front pocket for quick access to your items, and two side pockets for extra storage. The adjustable shoulder straps and top handle offer comfortable carrying options, while the waterproof construction ensures your belongings stay dry. Perfect for everyday use and weekend getaways."
        },
        {
            "title": "Kids Visor Hat with Fan - Sun Protection Wide Brim for Outdoor Adventures",
            "path": "https://shopee.sg/SL-Kids-Visor-Hat-with-Fan-Protection-Wide-Brim-for-Outdoor-Adventures-Summer-Hiking-Travel-and-Screen-Accessories-i.134972426.16897916621",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lie58o1t7wq7a5",
            "price": 1151000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Keep your child cool and protected with our Kids Visor Hat with Fan. Featuring a fan design, this hat provides a refreshing breeze while the wide brim offers excellent UV protection. Lightweight and adjustable, this hat is perfect for any outdoor activity. With a USB charging function, this hat can be easily charged anytime, anywhere. Adjustable head circumference of 46-52cm makes it suitable for both children and adults. Upgrade your child's outdoor experience with our Kids Visor Hat."
        },
        {
            "title": "Nike4574 - Waterproof Travel Bag with Comfortable Carrying and High Capacity",
            "path": "https://shopee.sg/Nike4574-44-L-Gear-Up-for-Your-Next-Adventure-Waterproof-Tear-Resistant-Travel-Bag-with-Comfortable-Carrying-and-High-Capacity-i.1013192516.19780612964",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdj-lg566d0g53id88",
            "price": 3877000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next adventure with the Nike4574 Travel Bag. This stylish and functional bag is made with tear-resistant fabric and waterproof material to keep your belongings safe and secure. It features a large capacity and multiple pocket design, plus padded straps and handles for comfortable carrying. Perfect for the discerning traveler, this bag is a must-have for your next journey."
        }
    ]
}