[
    {
        "title": "Portable Facial Micro-current Beauty Instrument with Double Roller Massager",
        "description": "This portable facial micro-current beauty instrument is designed to help you massage your face or body to achieve the effect of firming and lifting. It features a multi-acupoint stimulation to stimulate facial reflex points, as well as a scraper micro-chain that fits the skin well for a more effective massage. It also helps reduce swelling around the eyes and improve the microcirculation of the facial blood vessels. USB charging makes it lightweight and portable, so it can be used anytime, anywhere.",
        "source": "https://down-sg.img.susercontent.com/file/72c422786fd1dddd0e1586b489857821",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 8.86,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Portable-Facial-Micro-current-Beauty-Instrument-For-Lifting-Thinning-And-Reducing-Edema-With-Double-Roller-Massager-i.397126328.16280264757"
    },
    {
        "title": "Upgrade 2.0 Macaron Color Continuous Mist Sprayer",
        "description": "Upgrade your spraying experience with this 2.0 Macaron Color Continuous Mist Sprayer. This high-pressure spray bottle comes in a capacity of 300ml/200ml, perfect for use with alcohol, personal care and gardening. It features a leak-proof and heat-proof design, with a screw-neck bottle design for convenience. The ultra-fine mist spray pattern distributes water evenly, and the continuous spray time is up to 5s. Enjoy a 360-degree spraying option and 99% bottle evacuation with this sprayer.",
        "source": "https://down-sg.img.susercontent.com/file/9bf4f91de1ae47c2be69e1bf884c3547",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 0.85,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Upgrade-20-Macaron-Color-Continuous-Mist-Sprayer-300ml200ml-High-Pressure-Spray-Bottle-for-Alcohol-Personal-Care-Gardenin-i.368789487.11494680720"
    },
    {
        "title": "Kids Posture Corrector - Back Support Shoulder Belt for Pain Relief",
        "description": "Keep your kids' posture correct with this Kids Posture Corrector! This adjustable shoulder belt provides back support and helps rectify and straighten posture, providing relief from muscle pain. It is easy to adjust and wear, with a universal size fit for kids weighing 20-80kg. Get this Kids Posture Corrector today for improved posture and pain relief!",
        "source": "https://down-sg.img.susercontent.com/file/2719cf5ebd82b23117114fe803f8010f",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 7.28,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Boys-Girls-Adjustable-Posture-Corrector-Back-Support-Children-Shoulder-Belt-Rectify-Straighten-Correction-Pain-Relief-Beauty-Kid-i.314275897.6194955132"
    },
    {
        "title": "Home Facial Massager for Neck Firming and Wrinkle Reduction",
        "description": "This facial massager is designed to help reduce wrinkles and firm the neck area. It comes with warm vibration massage for a more relaxing experience. It is easy to use and perfect for home use.",
        "source": "https://down-sg.img.susercontent.com/file/81158ae04a9c8a0dfb644d45db59335e",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 14.45,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Neck-beauty-equipment-home-lift-firming-facial-mas95-i.594907807.21542400472"
    },
    {
        "title": "Magnetic Therapy Meridian Brush Body Massager",
        "description": "Get the perfect massage experience with this Magnetic Therapy Meridian Brush Body Massager. This massager is designed to provide relief to the shoulder, neck, back, legs and other areas, and features a five-element triangle brush and magic scorpion brush for live tendon. Enjoy a spa-like experience in the comfort of your own home!",
        "source": "https://down-sg.img.susercontent.com/file/4cdd4c1fb537395c8bf153515aacdfc8",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 10.26,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Magnetic-Therapy-Meridian-Brush-Body-Brush-Beauty-Salon-Massager-Shoulder-Neck-Open-Back-Scraping-Legs-Five-Elements-Triangle-Brush-Magic-Scor-i.858014453.21845162678"
    },
    {
        "title": "28pcs Beauty Teeth Veneers Set - Synthetic Resin Oral Care Temporary Crowns",
        "description": "Enhance your smile with this 28pcs Beauty Teeth Veneers Set! Made of synthetic resin, these temporary crowns are perfect for tooth loss and oral use. Get your set now and bring back your confidence with a beautiful smile!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcw-ljjohbtd4nyubb",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 2.25,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/AMBER-28pcsset-Beauty-Teeth-Veneers-Lower-Anterior-Tooth-Tool-Simulation-Teeth-Synthetic-Resin-New-Health-Oral-Care-Temporary-Crown-Resin-Acrylic-i.460946790.14425811471"
    },
    {
        "title": "Folding Massage Bed - Home Chinese Medicine Physiotherapy Bed",
        "description": "Stabilizer/metal lock non-slip footpad for easy storage and fast folding in 30 seconds. Lightweight and high strength aluminum alloy skeleton. Back function for more comfort. High-end quality with exquisite taste of life. Fashionable and comfortable with bright details. 500 kg bearing capacity and adjustable height. Good quality rubber floor MATS. Buy to get a free nylon backpack. Same day delivery before 4PM.",
        "source": "https://down-sg.img.susercontent.com/file/30c47053885f865231c5097d9677e8ac",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 35.99,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/ready-stockFolding-Massage-Bed-Home-Chinese-Medicine-Physiotherapy-Bed-Fire-Therapy-Moxibustion-Beauty-Bed-i.297817635.7363165365"
    },
    {
        "title": "TONYMOLY Personal Hair Cure Argan Lotion",
        "description": "Get salon-grade hair care with TONYMOLY Personal Hair Cure Argan Lotion. This no-wash type treatment lotion infuses moisture and provides a fresh finish with quick absorption to make your hair moist. Formulated with nourishing ingredients like argan kernel oil, Spanish licorice root extract, hydrolyzed collagen extract, and hydride rolled keratin, this lotion is perfect for damaged or loose hair.",
        "source": "https://down-sg.img.susercontent.com/file/fa996275f8a5ce3096d4c1bf43324242",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 24.52,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/TONYMOLY-Personal-Hair-Cure-Argan-Lotion-300ml-i.237625616.10396522942"
    },
    {
        "title": "Hair Volume Powder - Portable Mini Hair Volume Shaping Powder",
        "description": "Get a fashion and charming hair style with this hair volume powder! This powder is designed with mini size and portable shape, making it perfect for taking to any occasions or using anytime. It can remove the oil of head and dispel head flavor to shape a fashion charming hair. Plus, it comes with a clean head flavor and removes the oil for styling a fashion hair. Get it now and enjoy a beautiful hair style!",
        "source": "https://down-sg.img.susercontent.com/file/478458ddbaa56d0b79f76692b9c099e5",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 3.11,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/spemall-Beauty-Personal-Care-Mini-Hair-Volume-Powder-Hair-Volume-Shaping-Powder-Portable-for-Men-i.129725227.3287444120"
    },
    {
        "title": "Rechargeable Electric Breast Massager - 3D Stereo Shaping, Magnetotherapy, Washable & Removable",
        "description": "Get the perfect curves for your breast with this Electric Breast Massager! It features 3D Stereo Shaping, High Frequency Bionic Pulse, Magnetotherapy, Washable & Removable massage tablets, and a Shutdown Timer Function for easy use. Made of durable ABS and environmental friendly rubber paint, it is powered by a DC3V/200mA and has a rated voltage of 220V/50HZ and a rated power of 32W (suitable for chest). Get your own Electric Breast Massager today and enjoy beautiful curves!",
        "source": "https://down-sg.img.susercontent.com/file/97106aa6f4906048e53d83d565f8e3ba",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 14.3,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/HOT-Electric-Breast-Massager-Simulation-Human-Massage-Adjustable-Rechargeable-Shutdown-Timer-Beauty-Massager-Booster-Vibration-for-Women-Health-i.405874092.10486972179"
    },
    {
        "title": "Sandal Massage Comb - Head Meridian Scalp Shoulder Neck Anti-static",
        "description": "Get a relaxing massage with this sandal massage comb! Made of precious materials and polished by hand, it is suitable for head massage, breast massage, and relieving stress and increasing blood circulation. This massage comb is great for long hair, thick hair, curly hair, natural hair, fragile hair, and even beards. It has a wide tooth design and is anti-static. Get yours now!",
        "source": "https://down-sg.img.susercontent.com/file/08e68973e89eedb13450562a74a1d094",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 2.42,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Beauty-accessories-Sandal-Massage-Comb-Head-Meridian-Scalp-Shoulder-Neck-Anti-static-Wide-Tooth-i.169900643.19848279899"
    },
    {
        "title": "Microcurrent Lonic Electric Gua Sha Scraping Massager",
        "description": "Get a lift and a glow with this electric scraping massager! This device is designed with a special scraping board that fits your skin perfectly to massage the face or body. With its micro current technology, it helps to promote collagen regeneration and lymph node drainage for a more refreshed look. Made with metal and plastic, it comes in white, pink, and champagne colors. USB rechargeable and easy to use, it's a must-have for your beauty routine. Package includes 1 electric scraping massager and 1 cable.",
        "source": "https://down-sg.img.susercontent.com/file/baf44184326d5dcb003e05d8a91e13c2",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 13.63,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Microcurrent-Lonic-Electric-Gua-Sha-Scraping-Massager-Facial-Face-Lift-Beauty-instrument-Iontophoresis-i.243246242.4349354775"
    },
    {
        "title": "Medical Neurological Percussion Knee Reflex Hammer Tool",
        "description": "The reflex hammer is a medical instrument used by practitioners to test deep tendon reflexes. This Queen Square hammer is made with plastic molds handle, and has a sharp tapered end to allow for testing of plantar reflexes. Soft handle material gives good force experience and the silicone material ring cover provides a good touching experience. It is approximately 20cm long and comes with a removable head and handle.",
        "source": "https://down-sg.img.susercontent.com/file/e1eeb5e3443326745a2910d61eaf430c",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 5.51,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/nis-beauty-Medical-Neurological-Percussion-Knee-Percussor-Reflex-Massage-Tendon-Hammer-Tool-i.289926682.3245293879"
    },
    {
        "title": "Hair Straightening Comb - Negative Ion Ceramic Heating - Professional Personal Care",
        "description": "Get salon-style results at home with this professional Hair Straightening Comb. Featuring negative ion ceramic heating technology and 10 temperature control adjustment settings, this comb is perfect for straightening wet or dry hair. It has a PTC heater and a 2m power cord with 360 degree rotation, and the oil injection shell process ensures a sleek and stylish finish. Get your hair looking perfect in just 1-2 minutes!",
        "source": "https://down-sg.img.susercontent.com/file/d376b2604a142670ccfef228c5e18e59",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 17.37,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Hair-Straightening-Comb-Negative-Ion-Ceramic-Heating-Hair-Straightener-Personal-Care-Mens-Beard-Touf-Styling-Comb-22MF28-i.778589216.19506568455"
    },
    {
        "title": "Natural Rose Quartz Jade Roller & Gua Sha Set",
        "description": "Enjoy a natural and healthy massage with this set of rose quartz jade roller and gua sha! The roller is double-sided, with a larger side for the neck, chin, cheeks and forehead and a smaller side for around the eyes, nose and lips. It helps reduce puffiness, wrinkles, dark circles around the eyes and promotes blood circulation for a natural healthy glow. The gua sha stone is great for using on your body, and very useful for relieving pressure. Use the roller and gua sha three times a week for best results.",
        "source": "https://down-sg.img.susercontent.com/file/242245147bd54288169eb4bc340d075e",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 6.85,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-LOCAL-STOCK-Natural-Rose-Quartz-JadeRoller-Facial-Body-MassagerGua-shaFace-Lifting-Beauty-Massage-i.434162407.13812524494"
    },
    {
        "title": "Efficient Scar Removal Silicone Gel Tape Patch",
        "description": "Get rid of scars with this self-adhesive silicone gel tape patch! Made from the finest safe silicone, this patch is reusable, washable, comfortable, and can be cut to fit any scar. It helps reduce the appearance of existing scars and helps prevent the formation of new ones. Suitable for all kinds of scars, it effectively covers and reduces scars. Clean your skin and dry it before each application for maximum adhesion. Replace every 14 days or when its stickiness is lost.",
        "source": "https://down-sg.img.susercontent.com/file/097494b885ea36c7d0a0525c93cf81da",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 3.24,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/GOGO-Efficient-Beauty-Scar-Removal-Silicone-Gel-Self-Adhesive-Silicone-Gel-Tape-Patch-i.84683145.17728717807"
    },
    {
        "title": "Reusable Menstrual Cup - Multicolor Soft Silicone Feminine Hygiene Period Cup",
        "description": "Get ready for your period with this reusable menstrual cup! Made of medical grade silicone, this cup is available in two sizes and multiple colors, making it suitable for all women. With up to 12 hours of wear time, this cup creates a vacuum seal inside you to prevent leaks. Easy to insert and remove, this cup is a great and hygienic alternative to tampons and pads.",
        "source": "https://down-sg.img.susercontent.com/file/1c9130e3c76d3e71cc550304d438577c",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 2.02,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/nis-beauty-Multicolor-Soft-Menstrual-Cup-Silicone-Feminine-Hygiene-Period-Cup-Reusable-Cup-i.289926682.3552570086"
    },
    {
        "title": "Premium Velvet Detachable Chest Pillow for Breast Support",
        "description": "Enjoy a comfortable night's sleep with this premium velvet detachable chest pillow. This pillow provides breast support and reduces discomfort caused by tender breasts. It also encourages better posture during breastfeeding, alleviating strain in your back, neck, and arms. Perfect for beauty salon, home and travel use. Made of crystal velvet pearl cotton, this pillow measures approx. 43x28cm/ 16.9x11 inch and weighs 220g.",
        "source": "https://down-sg.img.susercontent.com/file/391cc8ddd0140a842cd05a49c8cf3408",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 10.67,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/KLOWARE-Detachable-Chest-Pillow-Breast-Pillow-for-SPA-Beauty-Salon-Home-i.140625136.10547244546"
    },
    {
        "title": "LED Magnifying Floor Stand Lamp with Adjustable 8X Lens",
        "description": "Get perfect magnification with this LED Magnifying Floor Stand Lamp! Featuring an 8X clear and illuminating magnifying lens with adjustable height and arm, this lamp is perfect for crafts, salons, hobbyists, jewelers, electricians, and beauticians. It has three colour lights that can be switched at will with adjustable brightness. Made with ABS and hardware, this lamp is sure to last. Get yours today!",
        "source": "https://down-sg.img.susercontent.com/file/735f94fd9fc6a41f50eb8b21ca882bdd",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 75.49,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/3-Color-Light-8X-Adjustable-LED-Magnifying-Floor-Stand-Lamp-Magnifier-Glass-Rotated-Len-Facial-Beauty-Salon-Nail-Tattoo-i.325403225.13637508527"
    },
    {
        "title": "Natural Rose Quartz Jade Roller Facial Body Massager Gua Sha Face Lifting Beauty Massage",
        "description": "Enjoy a natural and healthy massage with this 100% natural jade stone roller! This double-sided Rose Quartz Roller is perfect for the neck, chin, cheeks, and forehead while the smaller one is ideal for around the eyes, nose, and lips. It helps reduce puffiness, eye bags, and dark circles around the eyes. The included Rose Quartz Stone Gua Sha is a great scraping tool for relieving pressure. Use the roller on your face and neck for 5-10 minutes, 3 times a week, to reduce fine lines and wrinkles.",
        "source": "https://down-sg.img.susercontent.com/file/242245147bd54288169eb4bc340d075e",
        "categories": [
            "Beauty and Personal Care"
        ],
        "price": 6.85,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-LOCAL-STOCK-Natural-Rose-Quartz-JadeRoller-Facial-Body-MassagerGua-shaFace-Lifting-Beauty-Massage-i.434162407.13812524494"
    }
]