[
    {
        "title": "Russell Taylors Belgian Waffle Maker with Temperature Control ",
        "description": "Enjoy freshly made waffles with the Russell Taylors Belgian Waffle Maker! This waffle maker is made with stainless steel and black trimmings, and features a nonstick pan with four easy to cut sections. With temperature control and a cool touch handle, you can easily adjust the heat to your desired level. The anti-slip rubber base ensures stability while in use. The waffle size is 1cm x 18cm (diameter) and the product measures 10cm (height) x 20cm (width) x 25cm (length). This waffle maker has a power of 1200W and requires a 3-pin plug (BS standard). Preheat the device for 4 minutes before adding batter to reduce sticking. Do not use metal utensils when cooking or cleaning.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-ofemk0d9ofjvdc",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 25.99,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Russell-Taylors-Belgian-Waffle-Maker-with-Temperature-Control-Stainless-Steel-WM-25-i.234952174.3646834671"
    },
    {
        "title": "PurSoft Food-Safe Kitchen Towel, Pack of 6",
        "description": "Keep your kitchen clean and tidy with PurSoft Food-Safe Kitchen Towel! Made with 100% food-grade paper, this ultra oil- and water-absorbent towel is designed with an advanced technology emboss pattern to quickly soak up oil and water. Get your kitchen helper today! Product size: 21.5 x 22.8 cm. Listing price is inclusive of GST. Invoice available upon request.",
        "source": "https://down-sg.img.susercontent.com/file/7e74e420cda6d88ab28f30744a839371",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 4.95,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/PurSoft-Food-Safe-Kitchen-Towel-60-Sheets-Pack-of-6-i.91799978.2276059196"
    },
    {
        "title": "Aerogaz 2.7L Instant Boiling Water Dispenser",
        "description": "Enjoy hot water instantly with this Aerogaz 2.7L Instant Boiling Water Dispenser. It features a stainless steel housing, digital control, sensor touch panel, 7 temperature selection and 5 different volume selection. This dispenser is equipped with a transparent removable water tank and LED white power indicator. It also has cleaning and self-cleaning functions. Power Supply: 220-240V~, 50Hz, 2200-2600W.",
        "source": "https://down-sg.img.susercontent.com/file/eaff9cff2b78fd5942406cb0205e665c",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 95.98,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Aerogaz-27L-Instant-Boiling-Water-Dispenser-AZ-288IB-i.264056937.8155024859"
    },
    {
        "title": "Stainless Steel Anti-Clogging Sink Drain Strainer",
        "description": "Keep your kitchen and bathroom sinks free of clogs with this stainless steel anti-clogging sink drain strainer. It features a rubber stopper at the bottom that plugs the sewer to store water, and its corrosion and rust-resistant material ensures a long service life. Perfect for any kitchen or bathroom, this sink strainer will help prevent clogs and keep your sink clean.",
        "source": "https://down-sg.img.susercontent.com/file/75df820121d171850ba3a5fa5dc35591",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 2.02,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Kitchen-Sink-Filter-with-Water-Plug-Stainless-Steel-Anti-clogging-Sink-Drain-Strainer-Bathroom-Basin-Hair-Catcher-Stopper-Household-Bathroom-Kitchen-Accessories-i.127249066.11894164776"
    },
    {
        "title": "NETEL Stainless Steel Kitchen Sink Shelf Cutlery Drainer",
        "description": "Keep your kitchen organized with this NETEL stainless steel kitchen sink shelf cutlery drainer. Made of stainless steel, this sink shelf is suitable for headspace and is available in 65cm/75cm (for 1 sink) and 85cm/95cm (for 2 sinks). It features a removable design for easy cleaning and is a great space-saving solution. The one-sided rack is perfect for plates and the other side is great for cups. Add a stylish look to your kitchen with this kitchen storage rack.",
        "source": "https://down-sg.img.susercontent.com/file/c26a743af4f1fd08ad584ea8e6ce99f3",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 45.19,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/NETEL-Kitchen-Sink-Shelf-Stainless-Steel-Kitchen-Cutlery-Drainer-Kitchen-Storage-Rack-Sink-Dish-Rack-i.279109910.20603506949"
    },
    {
        "title": "Philips ProBlend System Blender with Mill and Additional Jar",
        "description": "Create smooth blends with no lumps in 45 seconds with the Philips ProBlend System Blender with Mill and Additional Jar. This blender has a 1.9L maximum capacity and a 1L effective capacity. It features Problend technology with a 4 star stainless steel blade, motor thermo protection sensor, rotary knob speed UI, suction feet, and integrated power and cord storage. The jar and body are made of plastic, and the knives are made of stainless steel. It is also dishwasher safe and comes with a 2 year warranty.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvep-lk0y2ep5sriu79",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 56.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/PHILIPS-3000-Series-ProBlend-System-Blender-with-Mill-Additional-Jar-HR204150-Kitchen-Appliances-i.269639798.17442343477"
    },
    {
        "title": "Cornell 20L Digital Microwave Oven CMWE2700DS",
        "description": "Prepare snacks and heat up leftovers quickly with this Cornell 20L Digital Microwave Oven CMWE2700DS. It features 6 auto menus in 1 touch start, 6 touch quick cook menu buttons, 20L capacity, 25.5cm turntable, weight/time defrost and a push handle door. With its sturdy construction and black front display and black cabinet finish, this microwave oven is compact and durable. Powered by 230V/50Hz/700W and with a 1 Year Local Warranty, this microwave oven is the perfect addition to your kitchen.",
        "source": "https://down-sg.img.susercontent.com/file/5ab623275900b99649481343dba436aa",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 99.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Cornell-20L-Digital-Microwave-Oven-CMWE2700DS-i.115150728.17641373140"
    },
    {
        "title": "2 in 1 Dish Soap Dispenser - Press Type Manual Soap Box",
        "description": "Get ready for a more convenient and efficient way of washing dishes with this 2 in 1 Dish Soap Dispenser! This press type soap box is made of high-quality ABS material and comes in white and black. It is suitable for all kinds of liquid soap and dispenses the perfect amount of dish soap onto the sponge. The compact design takes up minimal countertop space and is ideal for home, school, office, hospital, hotel, restaurant and more. Get yours today!",
        "source": "https://down-sg.img.susercontent.com/file/efd2c42b15e38607ceeb2c95a546f7f5",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 2.16,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Ready-Stock-Upgrade-2-IN-1-Dish-Soap-Dispenser-Press-Type-Manual-Soap-Box-Detergent-Dispenser-Storage-Box-Sponge-Storage-Holder-for-Kitchen-i.374981156.21935196628"
    },
    {
        "title": "300ml Portable USB Rechargeable Juicer Blender",
        "description": "Enjoy freshly squeezed juice anytime, anywhere with this portable juicer blender! This juicer cup is made with food grade material, same material as the baby bottle for more peace of mind. It has a capacity of 300ml and a battery capacity of 12000mAh, allowing you to make up to 20 cups of juice on one charge. It also features 6 blades for easy blending of fruits and vegetables. Cleaning is also easy, just blend with some clean water after use. Get this convenient and powerful juicer blender now!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-qbnyk83kpujv7f",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 11.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/300ml-Juicer-Blender-Portable-USB-Rechargeable-Mini-Home-Wireless-fruit-juicer-machine-i.13486527.15350787547"
    },
    {
        "title": "Stackable Pantry Storage Racks for Kitchen Cabinet",
        "description": "Keep your kitchen neat and tidy with these stackable pantry storage racks. Perfect for organizing plates, dishes, and other kitchen items, these racks are designed to fit in your kitchen cabinet and are stackable for added storage space. Made of durable materials, these racks are built to last and will make a great addition to any kitchen.",
        "source": "https://down-sg.img.susercontent.com/file/3bd3c4df93b5c30712b2c91af853e927",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 6.96,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Kitchen-Cabinet-Shelf-Organizers-Stackable-Pantry-Storage-Racks-Plates-Storage-Home-Racks-i.231308268.6978662668"
    },
    {
        "title": "Kitchen Trash Bin with Cover - Waste Rubbish Dust Bin",
        "description": "Keep your kitchen clean and tidy with this stylish and functional Kitchen Trash Bin with Cover! It features a double-opening design, a fully enclosed trash can, and a 20cm narrow design that fits into various corners and corners. It is made of high quality environmental protection material, thick and durable, and is suitable for living room, bedroom, bathroom, kitchen, office, etc. It is available in blue and gray colors with 10L and 15L capacity. The trash bin also comes with a waterproof inner bucket and a thickened liner for more convenience and ease of use.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdo-ley0mf2g0bcvf6",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 5.21,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-STOCKTrash-Bin-Kitchen-Trash-Can-Trash-Bin-With-Cover-Kitchen-Waste-Trash-Rubbish-Dust-Bin-Dustbin-i.189531438.10918541934"
    },
    {
        "title": "Transparent Wall Stickers Kitchen Cabinet Stove Self-adhesive Wallpaper",
        "description": "Keep your kitchen cabinets, stove and other surfaces clean and protected with this self-adhesive transparent wall sticker! Made of PET material, it is water and oil proof, and comes in three sizes (0.6x3m, 0.6x5m, 0.6x10m). Due to the light and screen setting difference, the item's color may be slightly different from the pictures. Please allow slight dimension difference due to different manual measurement.",
        "source": "https://down-sg.img.susercontent.com/file/4171e4d3a3e0cce9ab7002e75d3e7952",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 9.58,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-Ready-StockTransparent-Wall-Stickers-Kitchen-Cabinet-Stove-Self-adhesive-Wallpaper-Water-Oil-Proof-i.306869927.16320185354"
    },
    {
        "title": "Kitchen Rack Organizer for Spices and Seasoning Bottles",
        "description": "Keep your spices and seasoning bottles organized with this Kitchen Rack Organizer! This foldable and rotating multi-layer shelf is made of strong and durable PP material, perfect for storing your favorite spices and seasonings. With its slim design and two-tiered shelves, you can maximize the available storage space and create quick access to what you need. Product comes in a unit of 2 storage shelves.",
        "source": "https://down-sg.img.susercontent.com/file/9fce78b2a5308d378c82534e63f5d053",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 9.5,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Kitchen-Rack-Organizer-for-Spices-and-Seasoning-Bottle-i.1022508.10466913191"
    },
    {
        "title": "Premier 2ply Kitchen Towel - 8 Rolls",
        "description": "Get the job done with Premier Kitchen Towel! This 2ply kitchen towel is equipped with air pockets inside and all over the surface, resulting in a stronger and faster absorbency. It is a great helpmate in the kitchen, ensuring a hygienic and ideal environment for every home chef. GST included. Invoice available upon request.",
        "source": "https://down-sg.img.susercontent.com/file/7d9336bccbd258f8f15aeb00daddc951",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 9.45,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Bundle-of-2-Premier-2ply-Kitchen-Towel-8-Rolls-i.91799978.6253624846"
    },
    {
        "title": "Smart Sensor Dust Bin - 16L Capacity",
        "description": "Get your hands on the latest model of Smart Sensor Dust Bin with a capacity of 16L! This dust bin is water proof and comes with a deodorizing compartment and a trash bag compartment. It can be powered up using either 4 x AA batteries or USB rechargeable. With a charging time of 5 hours, it's the perfect solution for your home or office. Get it now and enjoy a hassle-free life with this amazing dust bin!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-23030-jb0e3yakvlovd2",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 22.96,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-Seller-Smart-Sensor-Dust-Bin-Intelligent-Trash-Bin-Office-Home-Kitchen-Waste-Bin-Dustbin-Infrared-Motion-i.52652942.3178002669"
    },
    {
        "title": "Ultra-Absorbent Food Safe Kitchen Towel",
        "description": "Make cooking and cleaning up a breeze with our ultra absorbent and food safe kitchen towel! This kitchen towel is made with 100% food-grade paper that is highly absorbent for oil and water, making it an ideal helper for all your cooking needs. Comes in an easy pull format for convenience and hygiene. Product dimensions: 200 sheets.",
        "source": "https://down-sg.img.susercontent.com/file/6af13457b10f4803d63ce75084e783df",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 1.85,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Pursoft-Kitchen-Towel-Softpack-200-sheets-i.91799978.3775201191"
    },
    {
        "title": "Nespresso® Essenza Mini Coffee Machine - Intense Grey",
        "description": "Enjoy the perfect cup of coffee every time with the Nespresso Essenza Mini Coffee Machine. This compact machine is designed for ease-of-use and minimalist beauty, while delivering unrivalled quality. With a removable water tank, used capsule container capacity, automatic power off after 9 mins, option to program cup sizes, pressure of 19 bars and a removable drip tray for Latte Macchiato glass, you can enjoy your favourite coffee in no time. Plus, with free delivery and after sales support, you can make sure you're always well-stocked for your coffee fix.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdx-lhx4plgtz1mocd",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 199.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Nespresso-Essenza-Mini-Coffee-Machine-Intense-Grey-i.252623822.7535427034"
    },
    {
        "title": "Multifunctional Kitchen Tool - Can & Bottle Opener",
        "description": "This multifunctional kitchen tool is perfect for opening cans and bottles of all sizes! Its adjustable design is suitable for bottles with diameters ranging from 2.4 cm to 10.2 cm, and its stainless steel blade is strong and sharp for easy cutting. Its flexible spiral gear design makes it easy to open bottles with minimal effort. This can and bottle opener is a must-have tool for any kitchen!",
        "source": "https://down-sg.img.susercontent.com/file/fb975f284ad613083cd8696479ee78e8",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 4.76,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/1PC-Household-Labor-saving-Can-Opener-Bottle-Opener-Hand-Injury-Resistant-Durable-Jar-Beverage-Opener-Multifunctional-Kitchen-Useful-Tools-i.127249066.8274985622"
    },
    {
        "title": "Digital Multi Function Rice Cooker 2.0L/3.0L",
        "description": "Microcomputer control with eight menus. Stone thick container design, curve design and thermal circulation heat for direct rice core. NTC temperature sensing, detachable bubble breaker and no-stick pot. 24 time preset and intelligent cook for convenience. Safety Mark 190461-24.",
        "source": "https://down-sg.img.susercontent.com/file/a2e56e41f15390cc7bf6f4dd111f10d6",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 54.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/BEAR-Rice-Cooker-Digital-Multi-Function-20L30L-DFB-B20A1-i.239175186.5522519208"
    },
    {
        "title": "Rechargeable Electronic Arc Lighter with LED Indicator",
        "description": "This flameless lighter is perfect for indoor and outdoor use, especially for travel, camping, hiking, BBQs, candles, cooking, fireplaces, fireworks and more. It is wind and moisture proof, plus it uses plasma tech so you don’t have to worry about harmful chemicals. It is USB rechargeable with a safety lock after 9 seconds of inactivity and a visual electricity storage design to indicate charging capacity. Made of zinc alloy with a long flexible neck, this lighter is perfect for those hard to reach spots. Item size: 18.2cm (Length) x 1.6cm (Width) x 1.0cm (Height). Item weight: 28.5g.",
        "source": "https://down-sg.img.susercontent.com/file/e8813a3b08d291eb0a3d64e71d9cc5a6",
        "categories": [
            "Home and Kitchen"
        ],
        "price": 6.5,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/255-Sale-Electronic-Arc-Lighter-USB-Rechargeable-or-360-Arc-Lighter-with-LED-indicator-Candle-Stove-Kitchen-Electric-i.659420500.15141029320"
    }
]