[
    {
        "title": "Kids Skateboard Protective Gear Accessories",
        "description": "Keep your kids safe while they enjoy outdoor sports with this protective gear set. Made with high-density foam padding for comfort and cooling, this set includes 6 pieces of PVC protectors to provide maximum shockproof protection. Suitable for roller skating, riding scooter, skateboarding, cycling and other outdoor sports. Get your kids the ultimate protection they need for their outdoor adventures!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvco-lj5g7wywy7ls17",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 6.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Protective-Gear-for-Kids-Sport-Skateboard-Accessories-i.460953914.15259118552"
    },
    {
        "title": "Mileseey PF230 600M Range Finder Telescope for Golf, Hunting and Outdoor Activities",
        "description": "Mileseey PF230 Range Finder Telescope is a perfect tool for golf, hunting and outdoor activities. It features point-to-point measurement, distance measurement, angle measurement, height measurement, and speed measurement. It is easy to operate, power saving and durable. It is water-proof and drop-resistant. It has 6X magnification and a 7° field of view. The eyepiece can be adjusted with up to ±5D diopter. It has a Transflective LCD display and measures up to 600m with an accuracy of 0.5m. It comes with a Mileseey protective pouch.",
        "source": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lfte6acdcoe6a9",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 57.78,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Mileseey-PF230-600M-Range-finder-Outdoor-Laser-Rangefinder-Telescope-Laser-Speed-Meter-For-Golf-Telescope-use-in-Golf-hunting-and-outdoor-activities-i.774209572.16068183895"
    },
    {
        "title": "70cm Ankle Bandage Wrap Foot Brace Guard Protector",
        "description": "Protect your ankles with this 70cm ankle bandage wrap foot brace guard protector. Made of high quality nylon and latex yarn, it is comfortable and durable. It provides a snug fit to ensure maximum comfort and protection for your ankles. Available in multiple colors to choose from.",
        "source": "https://down-sg.img.susercontent.com/file/c5df671c480caa300e6329d4dbb41f03",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 1.93,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/70cm-Sport-Fitness-Protective-Ankle-Bandage-Wrap-Foot-Brace-Guard-Protector-i.68618670.2117554170"
    },
    {
        "title": "Weightlifting Gloves for Gym Workouts, Non-Slip Grip with Padded Protection for Cross Training, Pull-Ups and More.",
        "description": "Get the most out of your workout with these weightlifting gloves. Crafted from microfiber, they feature a unique four-finger loop design that maximizes airflow and reduces sweat. The cushioned palms provide protection and comfort while the grip enhancement ensures your hands won’t easily slide off the iron bar. Perfect for heavy-duty weight training, pull-ups, rowing, WOD, chin-ups, deadlift and cross fit. Double and triple stitching technology is used to reinforce key pressure points for long-lasting durability. One size fits all.",
        "source": "https://down-sg.img.susercontent.com/file/789dbde3ef7d0bd6ab5f108c86cba4c8",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 6.54,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/1Pair-Workout-Weight-Lifting-Fitness-Gym-Barehand-Gloves-Rowing-Non-Slip-Callus-Guard-Padded-Grip-for-Cross-Training-Pull-Up-Hand-Palm-Protection-i.130088698.17541478363"
    },
    {
        "title": "IDOGEAR Nylon Tactical Belt - 1.7\" Width, Adjustable Sizes",
        "description": "This IDOGEAR tactical belt is made from high quality nylon material, making it a reliable and durable choice for your outdoor activities. It features a hook and loop closure for fastening and adjustable sizes for a perfect fit. Perfect for wargames, hunting, camping, and more. Available in black color.",
        "source": "https://down-sg.img.susercontent.com/file/14dd72ab82413b2696ca7f16d695442b",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 7.02,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/IDOGEAR-17Tactical-Belt-Mens-Inner-Waist-Belt-Nylon-Black-Outdoor-Camping-3418-Military-Tactical-Gear-i.375407779.7877627611"
    },
    {
        "title": "PGM Golf Swing Trainer for Men, Women, and Kids",
        "description": "Improve your golf swing with the PGM Golf Swing Trainer! This golf swing trainer is suitable for all ages and is designed to help you practice standard golf moves and make your swing smoother. It features adjustable length and position of the wristband to fit different arm sizes, a thickened sponge to reduce friction between the body and the contactor, and a triangle grip for power transfer and multi-angle training. This golf training aid is perfect for warming up before the competition and formal training, helping you awaken your muscles and make a steady swing. With its anti-skid grip, it is user-friendly and suitable for beginners and kids. Get into the game and the training in a short time with the help of this golf swing trainer. Lightweight and portable, you can practice anywhere you like with this perfect golf swing trainer!",
        "source": "https://down-sg.img.susercontent.com/file/c547b351bcb2e7926a916da29896230e",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 28.6,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/PGM-Golf-Power-transmission-chain-spinner-swing-trainer-suitable-for-men-women-kid-all-age-left-right-handed-golfer-training-aid-i.314982917.3686596718"
    },
    {
        "title": "MSA SNI Certified Safety Helmet with FASTRACK Suspension - White",
        "description": "Ensure your safety at work with this MSA SNI Certified Safety Helmet with FASTRACK Suspension. Made from high quality and thick material with glossy finish, this helmet is strong and resistant to impacts. Perfect for protecting your head while working in the field, projects, and factories. Get yours today and stay safe!",
        "source": "https://down-sg.img.susercontent.com/file/01cbea42de70832fe9581d71b619a585",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 11.34,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/LOKAL-PUTIH-Safety-Project-Helmet-V-GUARD-Brand-MSA-SNI-Local-Suspension-FASTRACK-FASTRAK-White-i.348809659.17106119198"
    },
    {
        "title": "Sports Weight Lifting Gloves | Gymnastics Grips & Wrist Band for Crossfit",
        "description": "Get superior wrist support for your workouts with these weightlifting gloves. Built-in wrist wraps provide extra tight grip with the Silicon Printed Neoprene design for barbells, pull up bars, muscle up rings, kettle bells, and more. Comfortably adjust the Velcro straps to your own personal fit, and enjoy less sweat and more ventilation with the open hand design. Get the perfect combination of comfort and grip with these weightlifting gloves.",
        "source": "https://down-sg.img.susercontent.com/file/9e685ad751d7eb96745d2e11af4ca393",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 6.8,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Sports-Weight-Lifting-Gloves-Fitness-Training-Workout-Gymnastics-Grips-Gym-Wrist-Band-Crossfit-Hand-Palm-Protector-i.322052223.7458383910"
    },
    {
        "title": "700C 21 Speed City Bicycle with Shimano Gears",
        "description": "Get ready to hit the roads with this 700C 21 Speed City Bicycle with Shimano Gears. This bike is made of aluminium alloy and features front and rear mechanical disc brakes for maximum safety. It has a maximum weight capacity of 150kg and weighs 11KG-13KG. Enjoy a smooth ride with its 21 speed transmission and 27.5 inch wheels. Get yours today and start exploring!",
        "source": "https://down-sg.img.susercontent.com/file/ccf6d3491def314f4a5d427791029067",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 220.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/BirdFish-700C-21-gear-transmission-inch-city-road-21-Speed-City-bicycle-275-inch-i.407635483.10713704305"
    },
    {
        "title": "Professional Compression Ankle Brace for Sports Activities",
        "description": "Get the best protection for your ankles with this Professional Compression Ankle Brace. Made of high-quality spandex and nylon, this ankle brace is lightweight and comfortable to wear. It features a non-slip top cuff, non-slip bottom cuff and open toe design for improved mobility and stability. Perfect for sports activities such as golf, baseball, football, tennis, running, and cycling. Get the best protection for your ankles with this Compression Ankle Brace!",
        "source": "https://down-sg.img.susercontent.com/file/37f0fab26f10f081e0413149c205d360",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 2.81,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/New-1-Piece-Equipment-Ankle-Support-Sports-Compression-Protector-Comfortable-Anti-Sprain-Basketball-Football-Foo-i.322052223.16883377626"
    },
    {
        "title": "Rechargeable LED Flashlight Waterproof Torch",
        "description": "Illuminate your outdoor activities with this rechargeable LED flashlight! Featuring an ultra-high lamp bead with an irradiation distance of up to 500m, 3 lighting modes (High / Low / Strobe) and IPX4 waterproof design, this torch is perfect for camping, hiking, cycling and more. Built-in rechargeable 18650 battery ensures up to 3-6 hours of use after a full charge. Made of ABS material for a durable and long-lasting product.",
        "source": "https://down-sg.img.susercontent.com/file/af151cbbb625b2104d2875c5711a86e4",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 7.43,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/LED-Flashlight-USB-Rechargeable-LED-Waterproof-Torch-for-Outdoor-Camping-Hiking-Cycling-i.373941026.9933886458"
    },
    {
        "title": "BraceTop Sports Compression Leg Sleeves - Extra Long Knee Support for Basketball, Football, Running & More",
        "description": "Get the support you need for your active lifestyle with BraceTop's Sports Compression Leg Sleeves. Made with spandex, polyester and nylon, these leg sleeves are perfect for running, climbing, golf, basketball, football, soccer, volleyball, tennis, badminton, mountaineering, hiking, cycling, biking, weight lifting and yoga. Available in sizes M, L, XL and XXL, these leg sleeves offer optimal muscle support between workouts and during casual everyday activities. Highly effective in supporting swollen and painful knees, these leg sleeves also enhance blood circulation to rejuvenate muscles, ligaments and joints.",
        "source": "https://down-sg.img.susercontent.com/file/f1fb8941d4033ba59336b45327d559d0",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 5.72,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/BraceTop-Sports-Compression-Leg-Sleeves-Extra-Long-Leg-Brace-Knee-Support-for-Basketball-Football-Running-Cycling-Knee-Pain-i.130088698.12081886062"
    },
    {
        "title": "Aluminum Alloy Carabiner Clip Hook - Multifunctional 360° Rotatable Buckle",
        "description": "This multifunctional carabiner clip hook is made of premium aviation aluminum for high strength and durability. It can hold up to 18kg/39.68 lbs and is foldable for easy carrying and storage. The 360 degree rotatable design can be used for hanging luggage, handbag, bottles, backpack, keychain and more. Perfect for camping, hiking, travel and other outdoor activities. Dimensions: 5.84x4.82cm/2.29x1.89 inch (Fold), Unfloding Length: 10.7cm.",
        "source": "https://down-sg.img.susercontent.com/file/8f76e2dd31fd2d6fc4d69008d2f50ca3",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 2.56,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/FAST-SHIP-Multi-Functional-Carabiner-Clip-Outdoor-Camping-Multi-Tool-Fishing-Acessories-Aluminum-Alloy-D-Shape-Buckle-360Rotating-Hook-for-Camping-Hiking-Travel-Bag-Backpack-er-i.412714710.7585148153"
    },
    {
        "title": "Nylon Gloves Hook - Multi-purpose Safety Clip for Outdoor Activities",
        "description": "High quality nylon gloves hook that is perfect for outdoor activities such as camping, hiking, climbing, and more. Features adjustable webbing for a secure fit and a durable design for long-lasting use. Comes in multiple colors to choose from. Dimensions: Total length 12cm, fixed webbing adjustment 11-16cm, weaving width 2.5cm.",
        "source": "https://down-sg.img.susercontent.com/file/cfb72ff0b3e0c01070ee0f8631af26dc",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 1.87,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/FUSHANG-Durable-Gloves-Hook-Multi-purpose-Anti-lost-Work-Gloves-Safety-Clip-Portable-Climbing-Rope-Outdoor-Tools-Nylon-Gloves-Camping-Hiking-Hanging-BuckMulticolor-i.115163700.7581893498"
    },
    {
        "title": "Mileseey PF2E Golf Laser Rangefinder 600M Yard/M Mini 6x Telescope Measure Meter Speed Measure",
        "description": "Mileseey is a leader in China's precision laser measurement and control industry, creating a global diversified technology enterprise. The PF2E telescope is the perfect choice for golfers who want to get accurate measurements quickly and easily. This laser rangefinder telescope is made from durable aluminum alloy with a precision one-piece polishing process and sandblasting technology. It utilizes TOF (Optical Time of Flight) technology and an angle sensor to implement golf ball trajectory compensation, golf ballistic scan, and golf speed tests. It also features intuitive ranging, high measurement accuracy, fast measurement speed, intuitive distance display, and low power consumption. This package includes the PF2E Laser Ranging Telescope, lanyard, telescope lens cleaning cloth, six colors body sticker, and user manual (Simplified Chinese and English).",
        "source": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lfhxr7zcnnw897",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 68.03,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Mileseey-PF2E-Golf-Laser-Rangefinder-600M-YardM-Mini-6x-Telescope-Measure-Meter-Speed-Measure-For-Golf-Hunting-Sport6-colors-i.774209572.17885917100"
    },
    {
        "title": "Polyester Paracord Bracelet with Plastic Buckle",
        "description": "This paracord bracelet is crafted from polyester and plastic buckle, ideal for camping, boating, hunting, hiking, and other outdoor activities. It features a tensile strength of up to 110kg and a circumference of 25cm/9.84inch (buckle closed). The width of the bracelet is approx 2.0cm/0.79inch (braided cord) and the length of untied bracelet is 3.0-3.2m. This bracelet is a great accessory for outdoor activities and a stylish decoration for daily life.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcu-ljj2kzu7qz6f17",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 1.8,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Polyester-Emergency-Gear-plastic-buckle-Camping-Hiking-Paracord-Bracelet-i.40263988.1475985856"
    },
    {
        "title": "Knee Support Brace with Silicone Pad for Injury Recovery and Pain Relief",
        "description": "Get the support you need with this knee brace. Made with a thickening strengthening silicone patella pad, dual memory springs for support, and dual silicone anti-skid strips for free movement. Ideal for ACL, PCL, and meniscus tears, this brace helps to minimize joint oscillation and reduce inflammation. Available in sizes M, L, and XL.",
        "source": "https://down-sg.img.susercontent.com/file/1d075bc021efd188b2686c9b3d125687",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 9.1,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/1Pcs-Sport-Long-Knee-Support-Silicone-Antiskid-Breathable-Compression-Brace-Pad-Protector-Sport-Basketball-Leg-Sleeve-for-Joint-Pain-Relief-And-Injury-Recovery-i.130088698.12283517394"
    },
    {
        "title": "Muscle Stimulator Training Equipment",
        "description": "Get in shape with this advanced muscle stimulator training equipment! Featuring an electric acupuncture massage technology, it inputs low-frequency pulse current to stimulate muscles and accelerate blood circulation and metabolism. It comes with 6 massage modes and 15 massage intensity levels to simulate muscle contraction strength of different professional sports. It also supports USB charging and is perfect for outdoor, office, and family use. Get yours today and start your journey to a healthier you!",
        "source": "https://down-sg.img.susercontent.com/file/94feec07fb96854844a175782e94ef0c",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 21.87,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Muscle-Trainer-Stimulator-Muscle-Training-Equipment-i.202943576.5226039636"
    },
    {
        "title": "Portable Folding Aluminium Table - Lightweight & Easy Setup",
        "description": "Get your Portable Folding Aluminium Table and make your outdoor trips easier! This lightweight and easy-to-setup table is made of aluminum alloy and custom Oxford fabric, and is perfect for picnics, beach trips, and other outdoor activities. It can hold up to 15kg and is easily foldable for easy storage and transportation. Get yours now!",
        "source": "https://down-sg.img.susercontent.com/file/1a26d68eb77afb86f9a91add5fff50a0",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 5.31,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Outdoors-Portable-Table-Small-Folding-Camp-Gear-with-Aluminum-Table-Top-and-Carry-Bag-Small-and-Lightweight-for-Beach-Picnic-Outdoors-and-Travel-i.490045304.13710250488"
    },
    {
        "title": "Rigorer Performance Finger Sleeve",
        "description": "Get the ultimate protection and support for your fingers during basketball, volleyball, fitness, and exercise activities with the Rigorer Performance Finger Sleeve. This wrap guard is designed to provide superior comfort and support, with adjustable straps for a personalized fit. It is lightweight and breathable, and is perfect for long-term use. Get the perfect protection and support for your fingers with the Rigorer Performance Finger Sleeve.",
        "source": "https://down-sg.img.susercontent.com/file/9202e742dd360a474f9a90d866333f90",
        "categories": [
            "Sports and Outdoor Gear"
        ],
        "price": 6.91,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Rigorer-Performance-Finger-Sleeve-FS004-Basketball-Volleyball-Fitness-Exercise-Guard-Wrap-Support-Protector-Strap-i.106407924.1679591969"
    }
]