[
    {
        "title": "Singapore MRT Map Jigsaw Puzzle (1,000pcs)",
        "description": "Enjoy piecing together the Singapore MRT Map with this 1,000-piece jigsaw puzzle! This puzzle is the perfect addition to your Singapore-inspired collection. Put your problem-solving skills to the test and create a stunning MRT map of Singapore. Finished product measures approximately 71cmW x 51cmH.",
        "source": "https://down-sg.img.susercontent.com/file/f61c485870b502cecd2db73dfd7375d0",
        "categories": [
            "Toys and Games"
        ],
        "price": 25.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG-MRT-Map-Jigsaw-Puzzle-1000pcs-i.345223036.11370424614"
    },
    {
        "title": "Dancing Cactus Plush Toy - 120 Songs, Recording, Talking & Dancing Fun",
        "description": "Bring joy and laughter to your family and friends with this delightful Dancing Cactus Plush Toy. It dances and sings with three variations - 3 songs no record, 120 songs with record and lighting, and 168 songs with record but no lighting. The 120 and 168 songs version can also record and speak after you. Soft and cuddly, it is made with PP cotton and is dust absorption resistant. Enjoy hours of fun with this adorable cactus toy and make it your own by recording your favorite words. Perfect for children 4 years and up.",
        "source": "https://down-sg.img.susercontent.com/file/659e753d426ced4adff17305b996e7ea",
        "categories": [
            "Toys and Games"
        ],
        "price": 2.89,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Huggy-Wuggy-Plush-Toy-Cactus-Dance-and-Talking-Recording-Toy-120-Songs-Poppy-Playtime-Game-Original-Dancing-Speak-Song-Tik-Tok-Fun-Toys-i.119046960.14581272811"
    },
    {
        "title": "Remote Control Whale Shark Toy Robot",
        "description": "Bring the ocean to your home with this realistic remote control whale shark toy robot! This electric fish moves in a realistic way and can be used in pools, tubs and other bodies of water. It also features a squirt water spray function for added fun. Perfect for kids and adults alike, this remote control whale shark is sure to bring hours of fun and entertainment. Enjoy the wonders of the sea from the comfort of your own home! 2.4G remote control, multiple people can play without interference. Waterproof and durable, powered by a motor. Requires 4 AA batteries (not included).",
        "source": "https://down-sg.img.susercontent.com/file/ef8e2b0f3494eaf3f7fc076a2c195430",
        "categories": [
            "Toys and Games"
        ],
        "price": 20.04,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Rc-Whale-Shark-Toy-Robots-Remote-Control-Animals-Marine-Life-Tub-Pool-Electric-Fish-Children-Bath-Toys-for-Kids-Boys-Submarine-i.471724532.12339328237"
    },
    {
        "title": "Remote Control 4WD Toy Car - Super Run Luxury Racing Car",
        "description": "Enjoy the thrill of racing with this remote control 4WD toy car. Equipped with 4-way control, this car provides endless entertainment for both boys and girls. Made from plastic, this car is available in a variety of colors and comes in a color box. Battery not included. Suitable for ages 14 and below.",
        "source": "https://down-sg.img.susercontent.com/file/92bf58a391c4806c4980500b87a07918",
        "categories": [
            "Toys and Games"
        ],
        "price": 9.03,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Remote-Control-Car-Super-Run-Luxury-Car-Super-Racing-Car-Super-Sports-Car-4WD-Toy-i.426329846.17765451225"
    },
    {
        "title": "Rainbow Pop It Stress Relief Ball Fidget Toy",
        "description": "Get relief from stress and anxiety with this Rainbow Pop It Stress Relief Ball Fidget Toy! Made from food-grade silicone, this toy is washable and suitable for all ages. It's the perfect way to reduce stress and anxiety and have fun with family and friends. Enjoy hours of fun and relaxation with this stress relief ball. Get yours today!",
        "source": "https://down-sg.img.susercontent.com/file/c8cb3a5f4c890ea9de59049dfd31188d",
        "categories": [
            "Toys and Games"
        ],
        "price": 2.91,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/New-Antistress-Pop-It-Rainbow-Ball-Push-Bubble-Pokeball-Fidget-Toys-Decompression-Squeeze-3d-Elastic-Kid-Pokmon-Game-i.51960315.15512120876"
    },
    {
        "title": "Family Friends Bonding Party Toy - Crocodile Dentist, Vent Battle, Penguin - Balance Ice Cubes, Jumping Pirate Game",
        "description": "Have fun with your family and friends with this party toy set! This set includes Crocodile Dentist, Vent Battle, Penguin - Balance Ice Cubes, and Jumping Pirate Game. Crocodile Dentist measures 8.5cm x 15.4cm x 16.2cm, Vent Battle measures 17cm x 23cm x 7cm, Penguin measures 25.5cm x 25.5cm x 6cm, and Pirate (Small, Medium, and Large) measures 11.1cm x 7.7cm x 7.6cm, 12cm x 9cm x 8.8cm, and 15cm x 10.7cm x 10.6cm respectively. Pirate (Large) is a 2-in-1 game with a Wheel of Dares. Enjoy hours of fun with this set!",
        "source": "https://down-sg.img.susercontent.com/file/dbedc2ba27250ab6b5f53757b0aaac1a",
        "categories": [
            "Toys and Games"
        ],
        "price": 4.58,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Crocodile-Dentist-Vent-Battle-Penguin-Balance-Ice-Cubes-Jumping-Pirate-Game-Family-Friends-Bonding-Party-Toy-i.469049961.5092109754"
    },
    {
        "title": "Rummikub Rummy Digital Board Game Puzzle Family Party",
        "description": "Challenge your friends and family to a game of Rummikub! This classic game has been a family favorite for generations and is sure to provide hours of fun. This digital version of the game features all the elements that make a great game: it's easy to learn and fast moving, it's different every time it's played, it combines luck and strategy, and it changes quickly so every player has a chance to win until the very end. Players take turns placing numbered tiles in runs and groups, rummy style. The 'board' continually changes as players adjust the tiles on the table. Be the first player to play every tile on your rack to win. With more than 55 million units sold, Rummikub is one of the world's best-selling and most-played games! Ideal for people of different ages to play together, making it a great family game. Reinforces STEM skills",
        "source": "https://down-sg.img.susercontent.com/file/ca5e6feeef3e23621b1b7145a3ad0562",
        "categories": [
            "Toys and Games"
        ],
        "price": 16.73,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Rummikub-Rummy-Digital-Card-Board-Game-Puzzle-Family-Party-Parent-child-Education-Boy-Girl-Toy-GiftDigital-i.173728060.5102666895"
    },
    {
        "title": "106 Tiles Family Traveling Rummikub Israel Mahjong Digital Board Game",
        "description": "Enjoy the classic game of Rummikub with this 106 Tiles Family Traveling Rummikub Israel Mahjong Digital Board Game. This game is based on the traditional middle-eastern game of Okey and was first created in the 1930s. It is similar to the Rummy that you play with cards and you try to get rid of all your tiles by forming numbers into runs of 3 tiles or more, or 3 to 4 of a kind. This game includes 106 Digital Cards (104 Colorful Cards + 2 Jokers), 4 Black Plastic Cards Holders for Players, and 8 Supports for the Cards Holders. It is suitable for ages 12 and above.",
        "source": "https://down-sg.img.susercontent.com/file/8bc33554c460df3c342d6193bca20635",
        "categories": [
            "Toys and Games"
        ],
        "price": 12.44,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/106-Tiles-Family-Traveling-Portable-Rummikub-Israel-Mahjong-Digital-Board-Game-i.173728060.6000217981"
    },
    {
        "title": "5 in 1 Kids Music Bus Toy - Multifunctional Educational Car Toy",
        "description": "Get your kids this 5 in 1 Kids Music Bus Toy, a multifunctional educational car toy that encourages learning and development. This toy car is made of plastic and comes with a xylophone, shape sorter, pull to walk, knocking toy, and music. It is designed to help with manual brain, grasping, intellectual development, crawling, vision, interest cultivation, senses, emotions, hearing, other ability development, and hand-eye coordination. The dimensions of the toy are 30 cm x 16 cm x 11 cm, and it comes with an exquisite gift box measuring 31.5 cm x 16.5 cm x 12.5 cm. Please allow for 1-2 cm error due to manual measurement. Note: This product is packed in an OPP bag.",
        "source": "https://down-sg.img.susercontent.com/file/a93b218caf7ec1bdb5ee95b3feb46222",
        "categories": [
            "Toys and Games"
        ],
        "price": 13.96,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/5-in-1-Kids-Music-Bus-Toys-Multifunctional-Early-Educational-Car-Toy-Xylophone-Beads-Blocks-Sorting-Montessori-Game-Toys-GiftEarly-Learning-ToyXylophoneShape-SorterPull-to-walk-knocking-toy-Kid-ToyMusic-i.384594475.8349317940"
    },
    {
        "title": "Here to Slay Card Game Bundle",
        "description": "Enjoy a strategic card game with role-playing adventure with the Here to Slay Card Game Bundle. This bundle includes the Here to Slay Base Game and Warriors & Druids Expansion Pack. Perfect for players of all skill levels, the Here to Slay card game is an adorable and brutal game that is sure to provide hours of fun. The bundle includes a standard deck of 115 cards, 6 oversized Party Leader cards, 15 oversized Monster cards, 2 six-sided dice, and 6 rules reference cards. Recommended for ages 10 and up, with a playtime of 30-60 minutes.",
        "source": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-ljcw4h4lpj0620",
        "categories": [
            "Toys and Games"
        ],
        "price": 6.16,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Here-to-Slay-Base-Game-and-Expansion-Bundle-i.173728060.13442364521"
    },
    {
        "title": "Spirit Level Pipe Clamp Balance Bracket",
        "description": "Made of durable materials, this spirit level pipe clamp balance bracket is designed to fit 25.4mm and 30mm pipe diameters. It also features a 20mm card slot for easy installation. Suitable for use in various applications.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdp-li2txa4oixd8df",
        "categories": [
            "Toys and Games"
        ],
        "price": 14.88,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Spirit-Level-Pipe-Clamp-Balance-Bracket-25430mm-Pipe-Diameter-20mm-Card-Slot-Spirit-Level-i.1005572129.16897843486"
    },
    {
        "title": "Magical Claw Machine / Mini Arcade UFO Catcher Game",
        "description": "Enjoy the thrill of the chase with this Magical Claw Machine! This mini arcade UFO claw catcher game is perfect for kids and adults alike, and comes with tokens and 6 plush toys. You can also choose to add an extra 10 plush toys as an option. This game is powered by USB or batteries (not included). Please note that the playset comes with a packaging box that may be damaged or dented during delivery. To ensure maximum protection, an additional carton box is available for purchase. Have fun and enjoy the excitement with this claw machine!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdz-lftdvnkmpirn81",
        "categories": [
            "Toys and Games"
        ],
        "price": 6.62,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Easyhomesg-Magical-Claw-Machine-Mini-Arcade-UFO-Claw-Catcher-Game-i.7595687.1580642528"
    },
    {
        "title": "3D Llama Unicorn Dinosaur Shark Pinata Kids Birthday Party Decoration",
        "description": "Add some fun to your kids birthday party with this 3D Llama Unicorn Dinosaur Shark Pinata! Perfect for any themed party, this pinata is designed for both decoration and fun party games. Fill it up with candies, mini toys, and treats from the top opening (candy/treats not included). The piñata comes with a built-in hang hoop at the top (string not included) for easy hanging. Blindfold the children and take turn to hit the piñata until it breaks open and all the treats pour out. This piñata is sure to be a hit with all the kids! Please refer size/dimension of piñata at the product picture. Can holds up to 1.5 to 2kg of candies or treats. Hole at the top of the piñata for filling. Handle for easy hanging. Dinosaur piñata color",
        "source": "https://down-sg.img.susercontent.com/file/c32a4fa75e3c8c375ae8e222ad95ff05",
        "categories": [
            "Toys and Games"
        ],
        "price": 29.15,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/3D-Llama-Unicorn-Dinosaur-Shark-Pinata-Kids-Birthday-Party-Decoration-Theme-Party-Fun-Game-Halloween-Party-Candy-Hit-i.509469209.17475691636"
    },
    {
        "title": "Star Wars Lightsaber Set - 2 Pcs Extendable Laser LED Swords",
        "description": "Bring the force with you with this amazing Lightsaber Set! This set includes two extendable laser LED swords with 7 colored lights and motion sensitive sound effects. Quality and durable with high grade security, these sabers are 100% non-toxic and odorless. Each requires 3 AAA batteries (not included). Perfect for immersive games, cosplay, and more! Get yours today and start dueling!",
        "source": "https://down-sg.img.susercontent.com/file/8e5253065c605cce1907ec9fdb708546",
        "categories": [
            "Toys and Games"
        ],
        "price": 3.5,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Local-ShipStar-Wars-2-Pcs-LightSaber-Combined-Extendable-Laser-LED-Sword-Set-Motion-Sensitive-FX-Sound-Sword-for-Kids-i.444092281.17282296577"
    },
    {
        "title": "Kids Mini Claw Machine Capsule Catcher Toy",
        "description": "Let your kids enjoy the fun of games and exercise their hand-eye coordination with this mini claw machine capsule catcher toy! This toy is made of high-quality and safe ABS material, not easy to damage. It is compact in size (6.5x6.5x6cm) and comes with a mini storage drawer that can contain your micro dinosaur babies. Enjoy hours of fun with this educational and interactive game. Perfect for children and toddlers.",
        "source": "https://down-sg.img.susercontent.com/file/94f4a72ecfe1214700f32ef95735d265",
        "categories": [
            "Toys and Games"
        ],
        "price": 2.92,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Mini-Claw-Machine-Capsule-Catcher-Toy-with-Micro-Dinosaur-Figure-Egg-Hand-eye-Coordination-Game-Activity-for-Children-Toddler-i.187350317.18811070291"
    },
    {
        "title": "Cute Car Ornaments and Decorations",
        "description": "Add a touch of cuteness to your car interior with these adorable car ornaments and decorations. These little turtles, bunnies, ducks, lambs, puppies, and elephants will bring a smile to your face every time you get behind the wheel. Perfect for car center consoles, these car decorations are sure to brighten up your ride. Get creative and mix and match for a unique look.",
        "source": "https://down-sg.img.susercontent.com/file/ph-11134201-23030-fqpx79xyz9nv2a",
        "categories": [
            "Toys and Games"
        ],
        "price": 10.17,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/READY-STOCK-Car-ornaments-car-center-console-display-screen-car-decorations-small-turtle-cute-car-interior-supplies-or-i.867945903.19980987808"
    },
    {
        "title": "1:18 2.4G RC Car Wireless Remote Control Climbing Car ",
        "description": "This 2.4GHz RC Car is perfect for boys and adults alike! It features a scale of 1:18, dimensions of 24*15.5*11.5cm, a speed of 20km/h, a charging time of 2-2.5h, and a remote control time of 15 minutes. This off road vehicle is made of good material, which is durable and has good workmanship and appearance. The remote control requires 2 * 1.5v AA batteries (not included) and comes with a 4.8v700ma battery pack, charging cable, and remote control. Available in red and blue. Get it now for a fun and exciting remote control experience!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134211-7qvdn-lfavh2eiy6oy84",
        "categories": [
            "Toys and Games"
        ],
        "price": 21.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/SG24G-RC-Car-Wireless-Remote-Control-Climbing-Car-118-Toys-for-Boys-Adult-Children-Day-Gifts-i.339701161.15322225386"
    },
    {
        "title": "Fancycube Sushi Go Board Game",
        "description": "Enjoy a fun game of Sushi Go with your family and friends! This board game includes pick and pass cards and is made of high-quality paper. Package includes 1pc. Please allow 1-2cm difference due to manual measurement.",
        "source": "https://down-sg.img.susercontent.com/file/245de180d48668b4dfe089055140a954",
        "categories": [
            "Toys and Games"
        ],
        "price": 7.25,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Fancycube-Sushi-Go-Board-Pick-Pass-Cards-Family-Party-Game-i.7548342.1031814597"
    },
    {
        "title": "Magic Light Up Professional YoYo Ball ",
        "description": "Get ready to show off your tricks with this Magic Light Up Professional YoYo Ball. This yo-yo is made from high quality plastic and is designed to give off light at high speed. It is available in 6 bright colors and is compact and portable for easy carrying. A great gift for kids, this yo-yo measures approximately 2.2\" x 1.3\"/5.7 x 3.5cm. Order yours today!",
        "source": "https://down-sg.img.susercontent.com/file/353dc72b7e9489a2b4ca5742137075a3",
        "categories": [
            "Toys and Games"
        ],
        "price": 2.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Magic-Light-up-Professional-YoYo-Ball-Bearing-String-Trick-Kids-Playing-Toys-i.84711731.1584181510"
    },
    {
        "title": "Charades for Kids - No Reading Required Family Game",
        "description": "Get the whole family together for a game of Charades for Kids! This classic game is designed especially for kids, with three levels of clues so that kids of all ages can participate. Each card has a picture clue, so no reading is required. Act out a toothbrush, a cat or a bumble bee, or read the simple words and phrases and act out actions like eating spaghetti or playing guitar! Includes 150 charades cards, a sand timer, a game die, and complete instructions. Fun for 3 or more players, ages 4 and up.",
        "source": "https://down-sg.img.susercontent.com/file/9d1ed2b2020273de12d8a3a5a5a80ee9",
        "categories": [
            "Toys and Games"
        ],
        "price": 7.56,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Pressman-Charades-for-Kids-Peggable-No-Reading-Required-Family-Game-i.173728060.7720650047"
    }
]