[
    {
        "title": "HomeTeamNS Adventure Centre Singapore - Outdoor Rock Climbing, Zipline & Challenge Rope Course Attractions Tickets",
        "description": "Experience the thrill of outdoor adventure with HomeTeamNS Adventure Centre! Tackle our Challenge Rope Course, abseil off a cliff, climb up the rock wall and zip off on a thrilling 50m Flying Fox zipline! Ticket(s) includes any 2 adventurous activities. Advanced booking of 5 days is required. Minimum height requirement: 1.2m. Proper attire is required for all activities - Covered shoes and no sleeveless top. Open Daily: 10am to 5pm. Ticket(s) is valid for 30 days from date of issuance.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-23020-8bmv592wc8mv51",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 37.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/HomeTeamNS-Adventure-Centre-Singapore-Outdoor-Rock-Climbing-Zipline-Attractions-Tickets-Vouchers-Travel-Team-Bonding-i.408840252.16512241197"
    },
    {
        "title": "Front Runner Movable Awning Arm for Vehicle Expedition, Camping and Overland Use",
        "description": "Get precise control over blocking the sun with the Front Runner Movable Awning Arm. This Slimline II Rack accessory allows you to move a Front Runner Easy-Out Awning as the sun changes position, providing maximum shade throughout the day. The arm can be fitted to either the left or right rear corner of a Front Runner Slimline II Rack, and is compatible with 1.4m, 2m, or 2.5m sized Front Runner Easy-Out Awnings. Made from black powder-coated steel, this awning arm is easy to install and comes with all necessary hardware.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdt-lh46jyninzwgaf",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 1259.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Front-Runner-Movable-Awning-Arm-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.19880019603"
    },
    {
        "title": "Fashion Backpack Multifunctional & Waterproof for All Adventures",
        "description": "This stylish backpack is perfect for any adventure, with its lightweight design, adjustable shoulder straps, and durable construction. Nylon fabric is waterproof and easy to clean, making it ideal for long-distance hiking or camping trips. The pressure reducing belt is easy to carry and suitable for any occasion. It features a large capacity with ample storage space and a sturdy structure that can withstand the rigors of travel. The entire webbing allows for the connection of additional tactical bags or equipment. Get ready for your next adventure with this multifunctional and waterproof backpack!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvef-ljv6x2ue7vx267",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 40.39,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/1-Fashion-Backpack-multifunctional-And-Waterproof-Companion-For-All-Adventures-Outdoor-Legionary-Fan-Backpack-Travel-Backpack-i.642829935.22249951460"
    },
    {
        "title": "Hannibal Safari Legless Awning 2.4m - Vehicle Expedition, Camping, Overland Use (SUV, 4WD, Travel)",
        "description": "Make your next adventure a breeze with the Hannibal Safari Legless Awning 2.4m! This awning is designed for quick and easy setup, with no posts, pegs or ropes to trip over or bump into. It is made of premium grade materials and is manufactured in Australia. The heavy duty aluminium fold out arms feature polyurethane bushes for a smooth swivel and are completely self-supporting. The awning cover is constructed of Polymide ripstop canvas while the roll out awning is made from the same canvas. The seams are double stitched and edged with binding, and the stitching is of superior strength quality thread. The outrigger frame poles are made of aluminium. Installation is included in the price. Get ready for your next adventure with the Hannibal Safari",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvg6-lh2vjcutuyvbf0",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 1699.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Hannibal-Safari-Legless-Awning-24m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.21180005011"
    },
    {
        "title": "Adventure Waterpark Desaru Coast 1 Day Trip for 4/6 Persons",
        "description": "Experience the thrills and spills of Adventure Waterpark Desaru Coast on this 1-day trip from Singapore! Enjoy a private transfer between Singapore and Desaru, as well as Adventure Waterpark tickets. Please note that meals, visa application fees, travel insurance, and own expenses are excluded. Departure from Singapore is available on Thursdays to Sundays. All packages are subject to availability and Causeway Link reserves the right to cancel, change or refund all purchases made.",
        "source": "https://down-sg.img.susercontent.com/file/e144c3d641c1bd270d93b1364f73a383",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 366.0,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Causeway-Link-Adventure-Waterpark-Desaru-Coast-Johor-Malaysia-1-Day-Trip-for-46-persons-Desaru-Waterpark-i.800562399.20831155327"
    },
    {
        "title": "Adventure Waterpark Desaru Coast - 1 Day Entry Ticket",
        "description": "Enjoy a day of fun and adventure at Adventure Waterpark Desaru Coast! Get 1 Day Entry Ticket to enjoy the unique rides including the first-ever water coaster in the region and one of the biggest wave pools in the world! Present either mobile or printed voucher along with your IC / passport for entry. Adult: 12 - 59 years OR over 121cm in height. Child: 3 - 11 years OR up to 121cm in height (free entry for child below 3 years old). Senior: 60 years and above. Operating Hours (Thursday-Sunday): 10am - 6pm (last admission 5pm).",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-c1ecse91qnlv21",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 25.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Adventure-Waterpark-Desaru-Coast-Johor-Malaysia-Attractions-Tickets-Vouchers-Travel-Family-Outing-Kids-Friendly-Discount-i.408840252.21952373379"
    },
    {
        "title": "60L Waterproof Outdoor Hiking Backpack - Adventure Sport Camping Travel Bag ",
        "description": "Get ready for your next outdoor adventure with this 60L Waterproof Outdoor Hiking Backpack! Crafted with durable and waterproof polyester fabric, this bag is perfect for camping, hiking, holidays, and travel. It features a spacious main compartment with multiple storage compartments, a rain cover, light reflective straps, and anti-scratch and durable materials. With a capacity of 60L and a weight of 1.64kg, this bag is perfect for your next outdoor adventure!",
        "source": "https://down-sg.img.susercontent.com/file/my-11134207-7qul0-lh8ituux2ody2a",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 85.21,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/60L-Backpack-Waterproof-Outdoor-Hiking-Large-Travel-Backpack-Adventure-Sport-Camping-Travel-Backpacker-Luggage-Bag-Cabin-i.208819896.23245265798"
    },
    {
        "title": "Portable And Durable Luggage Carrier for Any Adventure - Multiple Pockets, USB Port, Expandable & Easy to Clean",
        "description": "Travel in style and convenience with this Portable and Durable Luggage Carrier. It features multiple pockets for easy organization of all your essentials, a USB charging port extension for on-the-go charging, and is made with waterproof materials and reinforced seams for long-lasting use. With a large capacity and expandable design, this carrier is perfect for all your travel, school, work, and leisure needs. Approximate dimensions: 46*30*14CM/18.11*11.81*0.00inch.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lik75ow4ilwz81",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 51.07,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Portable-And-Easy-To-Clean-Luggage-For-Any-Adventure-Carrier-Travel-Bag-Bags-Multiple-Pockets-Stylish-Expandable-i.42535292.23746685121"
    },
    {
        "title": "Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Kids) - [Hardcover]",
        "description": "Explore the world with Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters. Discover beautiful skylines, unique animals, and surprises at every turn. This travel book for kids is sure to be an ebullient outing for armchair travelers. Get your copy today! - [Hardcover]",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qves-lgqn4cn9b1fref",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 42.06,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/sgstock-Everything-Everywhere-A-Fact-Filled-Adventure-for-Curious-Globe-Trotters-Travel-Book-for-Children-Kid-i.645219716.23767833374"
    },
    {
        "title": "50 PCS Outdoor Adventure Camping Stickers - Waterproof & Sun-Protection",
        "description": "Add some adventure to your life with these 50 PCS Outdoor Adventure Camping Stickers! These stickers are made of high quality PVC and come in a variety of sizes ranging from 3-10cm. They are waterproof, sun-protection, and tear off easily. Perfect for scrapbooking, laptops, skateboards, luggage, cars, bumpers, bikes, bedroom, travel cases, bicycle, motorcycle, snowboard, guitar, and refrigerator. Great gift for men, women, children, and teenagers. Get yours today!",
        "source": "https://down-sg.img.susercontent.com/file/5be8bb06bb865ca8d6bcc20f2a1bdde0",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 2.7,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/50-PCS-Camping-Landscape-Stickers-Outdoor-Adventure-Climbing-Travel-Waterproof-Sticker-to-DIY-Suitcase-Laptop-Bicycle-Helmet-Car-i.876484752.10098187787"
    },
    {
        "title": "Rock Beach Swing - Phuket, Thailand Adventure Attraction Tickets",
        "description": "Experience the thrill of swinging through the air on a beach swing located on a rocky beach in Phuket, Thailand! Enjoy the contrasting landscape of jagged cliffs and boulders against the turquoise waters while soaring through the air. Ticket(s) Inclusion: Admission to Rock Beach Swing and Round-Trip shuttle service from venue parking area to the site. Book your tickets online now and receive a booking confirmation and e-ticket via email. Open Daily (except Wednesday): 9.30am - 6.30pm. Child: 5 years old and below.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvco-li2fph1ze3lm5d",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 11.9,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Phuket-Rock-Beach-Swing-Thailand-Outdoor-Scenic-Ocean-View-Adventure-Attractions-Tickets-Vouchers-Travel-Discount-Sale-i.767436339.20889707508"
    },
    {
        "title": "45mm Portable Handheld Mini Precision Compass - Outdoor Camping Adventure Survival Tool",
        "description": "Get ready for your next outdoor adventure with this 45mm Portable Handheld Mini Precision Compass. Perfect for camping, hiking, climbing and traveling, this mini compass is the most important tool for your daily life. Made from ABS and acrylic, this compass is black in color and measures about 45mm in diameter. Package includes 1* Compass. Please note that due to lighting effects, brightness/contrast settings of the display, etc., the color of the website photos and actual items may vary slightly. Please refer to the actual product.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-y139y1qsd1jv83",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 1.64,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Road-Crazy-Travel-Safety-Accessories-45mm-Portable-Handheld-Mini-Precision-Compass-Outdoor-Camping-Adventure-Survival-Pointing-Tool-i.127249066.23207098450"
    },
    {
        "title": "Portable and Waterproof Backpack for Outdoor Adventures Travel",
        "description": "Get ready for your next outdoor adventure with this travel backpack! Crafted with waterproof and tear-resistant materials, this backpack provides ample storage space for your camping and hiking essentials. Featuring a foldable design, this backpack can be conveniently folded into a compact size for easy storage. The breathable fabric and mesh of this bag provide cool and dry wearing experience, while the smooth zipping system and exquisite craft ensure easy and reliable opening and closing. Available in multi-color and polyester material, this backpack is the perfect companion for your outdoor adventures. Approximate size: 23*21*3cm/9.06*8.27*1.18inch.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qven-lk20cic16f6z64",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 11.76,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/123-Waterproof-And-Portable-Backpack-For-Outdoor-Adventures-Travel-Travel-Backpack-Wear-resistant-i.33675962.22150398938"
    },
    {
        "title": "Adventure Cove Waterpark ACW Sentosa RWS Singapore 1-Day Admission Ticket",
        "description": "Enjoy a thrilling day of fun and adventure at Adventure Cove Waterpark™ (ACW)! Get your 1-Day Admission Ticket and enjoy a full day of high-speed water slides, mesmerising wonders of marine life, and more. Book your ticket today and get ready for a memorable experience!",
        "source": "https://down-sg.img.susercontent.com/file/340242fd56231b6b1a90607f06557845",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 29.3,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Adventure-Cove-Waterpark-ACW-Sentosa-RWS-Singapore-Water-Theme-Park-Attractions-Tickets-Vouchers-Travel-Sale-Promotion-i.408840252.8951354157"
    },
    {
        "title": "Premium Quality Backpack Rain Cover with Safety Reflective Strip ",
        "description": "Protect your backpack from rain, dust, and dirt with this premium quality backpack rain cover. Made of high-quality Oxford cloth, this waterproof cover is durable and features safety reflective strips. Available in five sizes (XS-XL) to fit backpacks ranging from 10-70L, this rain cover is perfect for travel and outdoor adventures. Get yours today and enjoy the protection!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve2-lhdv96gacf1r77",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 2.55,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Premium-Quality-Backpack-Rain-Cover-with-Safety-Reflective-Strip-Ideal-for-Travel-and-Outdoor-Adventures-10-70L-i.77514575.19789712115"
    },
    {
        "title": "Archaeopteryx Backpack Oxford Cloth Waterproof Outdoor Lightweight Bird Brand Mountaineering Travel Folding School Bag",
        "description": "Get ready for your next adventure with this Archaeopteryx Backpack! Crafted from Oxford cloth for superior water repellent performance, it features a solid color style and a zipper closure. It is lightweight and perfect for mountaineering, travel, and school. Plus, it fits up to a 16-inch laptop. Order now and get ready to explore! ",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lha7e9i7l33uaf",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 29.79,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Archaeopteryx-Backpack-Oxford-Cloth-Waterproof-Sports-Outdoor-Lightweight-Bird-Brand-Men-Women-Mountaineering-Travel-Folding-School-BagAdventure-Traveler-i.1005147801.17494790535"
    },
    {
        "title": "Aji Brother National Park Adventure Travel Series – Doll, Gift, Decoration",
        "description": "Explore the wonders of Aji Brother National Park with this adventure travel series! This handmade toy set includes a fashion play hand office, doll, gift, and ornaments – perfect for any youth aged 15-35. Made from PVC, it is imported from Asia and shipped within 48 hours of ordering. Give your loved one a special gift with this unique set!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvct-ljnm9bqu3kzp43",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 26.61,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Aji-Brother-National-Park-Adventure-Travel-Series-Fashion-Hand-Office-Doll-Gift-Decoration-i.547879632.22375417200"
    },
    {
        "title": "IMG Worlds of Adventure Ticket | 1 Day Attraction Pass",
        "description": "Enjoy a thrilling day of adventure at IMG Worlds of Adventure in Dubai! Get an exclusive 1 Day Attraction Pass to experience unlimited rides based on iconic Marvel superheroes and Cartoon Network superstars, as well as a prehistoric dinosaur experience at the Lost Valley Adventure Zone. Each ride has a height restriction for safety purposes and free admission for children under 1.05m in height. Opening Hours: Monday-Thursday: 12:00-22:00, Friday-Sunday: 12:00-23:00. Enter the venue directly with your voucher. Please share your Date of visit, email address via Shopee chat/email (Subject to availability). Voucher is non-refundable & no cancellation allowed.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e7714a1a7mjv44",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 68.99,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/Cheapest-discounted-IMG-Worlds-of-Adventure-Ticket-i.78525603.18960942423"
    },
    {
        "title": "New Men's Commuter Business Backpack - USB Rechargeable, Waterproof & Fashionable",
        "description": "Upgrade your style and convenience with this new men's commuter business backpack. Featuring USB rechargeable, waterproof and fashionable design, this backpack is perfect for your daily commute and travel. It has a medium size with a capacity of 20L. The package includes a zip pocket, cell phone pocket, certificate bag and computer socket. The opening method is zipper and the carrying parts are soft hover. It is fully waterproof and has a vertical square shape with an air cushion strap. Get this stylish and convenient backpack today!",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfi-lhcrfhotdgdfed",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 23.08,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/new-men-commuter-business-backpack-USB-rechargeable-backpack-waterproof-computer-bag-fashion-luggage-backpack-simple-travel-bagAdventure-Traveler-i.1005147801.17897611987"
    },
    {
        "title": "Lightweight and Durable Backpack for Travel and Outdoor Adventure - Large Capacity and Adjustable Breathable Folding Bag",
        "description": "Keep your belongings safe and dry with this foldable backpack, made of tear-resistant fabric and designed with adjustable straps for a comfortable fit. It features multiple compartments and pockets, offering plenty of storage space and organization options for your outdoor activities. The breathable back panel and shoulder straps provide added comfort during long trips, and the backpack is easy to clean after use. Shock-proof and UV-resistant, this backpack is perfect for hiking, camping, and other outdoor adventures. Available in multiple colors and made with polyester material, this backpack measures approx 41*24*16 cm/16.14*9.45*6.30inch.",
        "source": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdl-ljss6p4cdt023a",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 14.49,
        "platform": "Shopee",
        "purchaseUrl": "https://shopee.sg/https://shopee.sg/1-Durable-And-Lightweight-Backpack-For-Travel-And-Outdoor-Adventure-Large-Capacity-And-Adjustable-Breathable-Folding-Bag-i.36503201.23249830478"
    }
]