{
    "query": "Fashion and Accessories",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "Women's 2022 T-shirt - 100% Cotton, Short Sleeve, Solid Color, Slim Fit",
            "path": "https://shopee.sg/100-cotton-2022-T-shirt-womens-short-sleeve-solid-color-classic-fashion-thin-age-reducing-loo1002022t-i.760038169.18000078028",
            "image": "https://down-sg.img.susercontent.com/file/4c2d403cd654782bd78cd673e8972e92",
            "price": 1293000,
            "location": "Mainland China",
            "rating": 4.333333333333333,
            "sold": 5,
            "description": "Get ready for the new season with this stylish and comfortable T-shirt! Crafted from 100% cotton, this piece features a solid color, short sleeves, and a slim fit that flatters your figure. Perfect for any occasion, this T-shirt is sure to become a staple in your wardrobe. Get it now and enjoy free shipping!"
        },
        {
            "title": "Women's 2020 Trendy Autumn/Winter Fashion Stitching Sweater Bag Hip Skirt Two-Piece Set",
            "path": "https://shopee.sg/2020-Trendy-suit-autumn-and-winter-fashion-shirt-stitching-sweater-bag-hip-skirt-skirt-skirt-two-piece-female-i.9153340.5951246001",
            "image": "https://down-sg.img.susercontent.com/file/9568b0767adea8089acff4b47e786e02",
            "price": 1285000,
            "location": "Mainland China",
            "rating": 4.931818181818182,
            "sold": 0,
            "description": "Look stylish and chic in this two-piece set featuring a slim fit shirt and an A-line skirt. Made of polyester and knitting, this set has long sleeves and a high waist. Perfect for any season, this set is sure to keep you looking fashionable and on-trend. Please refer to the size table for the most suitable size. Note: Actual color may vary from the pictures due to different monitor settings."
        },
        {
            "title": "Women's Summer Striped V-Neck Tee - Loose Casual Short Sleeve Top",
            "path": "https://shopee.sg/T-shirts-Womens-Summer-New-V-neck-Striped-Oversized-Tee-Fat-Mm-Fashion-Loose-Casual-Short-Sleeve-Top-i.422516015.11195919387",
            "image": "https://down-sg.img.susercontent.com/file/97f01729c540b94007d2c20a69c53575",
            "price": 1167000,
            "location": "Mainland China",
            "rating": 4.2926829268292686,
            "sold": 4,
            "description": "Get ready for summer with this stylish Women's Summer Striped V-Neck Tee. Featuring a classic V-neck, striped pattern, and a loose fit for maximum comfort, this top is perfect for casual days out or a night on the town. Made from a lightweight polyester fabric, this top is breathable and comfortable to wear. The short sleeves make it perfect for warm weather. Pair with your favorite jeans or shorts for a chic look. Get your summer style on with this must-have tee."
        },
        {
            "title": "Women's Striped Short Sleeve T-shirt - Summer Loose Fit",
            "path": "https://shopee.sg/Summer-Loose-Large-Womens-Fashion-Korean-Bottoms-Striped-Short-Sleeve-Front-Short-Back-Long-Top-T-shirt-i.240981362.6034117635",
            "image": "https://down-sg.img.susercontent.com/file/1d3dfe5d53c96fc9c54b71010a705a4e",
            "price": 673000,
            "location": "Mainland China",
            "rating": 4.4941176470588236,
            "sold": 5,
            "description": "Refresh your summer wardrobe with this stylish Striped Short Sleeve T-shirt. Crafted from a lightweight polyester fabric, it features a round neckline, short sleeve design and a loose fit silhouette. Available in a range of colors and sizes, this top is sure to become a wardrobe staple. "
        },
        {
            "title": "Korean Women's Floral Skirt Suit 2022 - Round Neck T-shirt & Short Sleeve Skirt Set",
            "path": "https://shopee.sg/Korean-Women-Suit-2022-Round-Neck-Fashion-Short-Sleeve-T-shirt-Floral-Skirt-Two-Piece-Set-i.95570154.14360289009",
            "image": "https://down-sg.img.susercontent.com/file/d1c44021eef2bf1b2c519694b0eb40c6",
            "price": 1501000,
            "location": "Mainland China",
            "rating": 4.333333333333333,
            "sold": 1,
            "description": "This stylish two-piece set features a round neck t-shirt and a short sleeve skirt, made from polyester fiber. Available in sizes M, L, XL, XXL and XXXL, and in a beautiful yellow and white color combination. Perfect for any occasion, this suit is sure to be a hit in the 2022 summer season!"
        },
        {
            "title": "Car Printed Short Sleeve T-shirt - Sexy Slim Tshirts for Women",
            "path": "https://shopee.sg/Korean-Fashion-Drawstring-High-Waist-Crop-Tops-Car-Printed-Short-Sleeve-T-shirt-Kawaii-Summer-Hollow-Out-Sexy-Slim-Tshirts-Women-i.107907122.13995423431",
            "image": "https://down-sg.img.susercontent.com/file/796e31fc8fc4fa2e322ec7ce4270df64",
            "price": 883000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 7,
            "description": "Get ready for summer with this stylish Korean Fashion Drawstring High Waist Crop Tops T-shirt. This Kawaii T-shirt features a car print, short sleeves, round collar, and a sexy slim fit. Crafted from polyester fabric, this T-shirt is sure to keep you comfortable all day long. Choose from sizes S, M, L, and XL. Please refer to the size chart for measurements. Package includes 1 piece."
        },
        {
            "title": "Women's Striped Round Neck T-Shirt | Short Sleeve | Slim Fit | Summer 2021",
            "path": "https://shopee.sg/T-shirts-Womens-Round-Neck-Striped-Tee-Ladys-Short-Sleeve-Female-T-shirt-Korean-Style-Fashion-Top-i.422516015.11203393098",
            "image": "https://down-sg.img.susercontent.com/file/587b1d4a7b19fadbfa38faab66632793",
            "price": 964000,
            "location": "Mainland China",
            "rating": 4.755681818181818,
            "sold": 6,
            "description": "Look stylish and fashionable with this Women's Striped Round Neck T-Shirt. It features a slim fit with a round neck and short sleeves. Crafted from Daimor Fiber, this t-shirt is perfect for the summer season. Get this stylish t-shirt now and upgrade your wardrobe!"
        },
        {
            "title": "Korean Women Oversized T-shirt - Tie Dye Print | 40-150kg",
            "path": "https://shopee.sg/Plus-Size40-150kg-Korean-Women-Short-sleeved-Oversized-T-shirt-Fashion-Loose-Tie-Dye-Tops-i.428972728.16528147388",
            "image": "https://down-sg.img.susercontent.com/file/79faf52afedcbfbc1b62e2dc0a7922da",
            "price": 821000,
            "location": "Mainland China",
            "rating": 4.668161434977579,
            "sold": 18,
            "description": "Add a stylish twist to your wardrobe with this Korean Women Oversized T-shirt. Made from polyester for a comfortable fit, this T-shirt features a tie dye print for a cool, casual look. Available in sizes M-4XL, this T-shirt is perfect for all body shapes and sizes from 40-150kg. Package includes 1 Women T-shirt."
        },
        {
            "title": "Korean Style Fashion Women's Knitted Top - 5 Colors Available",
            "path": "https://shopee.sg/Xiaozhainv-5-colors-Korean-style-fashion-women-clothes-short-sleeve-knitted-top-crew-neck-T-shirt-i.25924280.15782232141",
            "image": "https://down-sg.img.susercontent.com/file/cf5c023530ba73763c3f97311800e57d",
            "price": 895000,
            "location": "Mainland China",
            "rating": 4.705882352941177,
            "sold": 34,
            "description": "Enjoy a stylish and comfortable look with this Korean-style fashion women's knitted top! Available in 5 colors, this short-sleeved t-shirt features a classic crew neckline and a slim fit design. Please consult the customer service staff for size recommendations before purchase. Note: Actual color may vary slightly from images due to monitor brightness and light brightness. Please allow a slight (±3cm) manual measurement deviation for the data. Buy with confidence from us and enjoy our quality assurance and great service!"
        },
        {
            "title": "Luxurious 3 Piece Women's Fashion Crop Top, Shorts & Blazer Set",
            "path": "https://shopee.sg/Set-Of-3-Piece-Luxurious-Womens-Fashion-Crop-Top-And-Shorts-With-Blazer-i.462632635.15902286235",
            "image": "https://down-sg.img.susercontent.com/file/f249b3623326cf01fb1c8bd0a2e224ee",
            "price": 1340000,
            "location": "Vietnam",
            "rating": 4.45945945945946,
            "sold": 1,
            "description": "Look stylish and luxurious with this 3 piece women's fashion set! This set includes a crop top, shorts and a beautiful and luxurious women's fashion vest. It is made from a fabric with high color fastness, anti-stretch and squishy, but poor resistance to wrinkles and sweat due to its high velvet composition. To keep the fabric looking its best, we recommend washing and ironing it before wearing. This is a great choice for you and is sure to bring you value for money."
        },
        {
            "title": "Women's Summer Printed Top - Sexy Off-Shoulder Loose Thin Short Sleeve Tee",
            "path": "https://shopee.sg/T-shirts-Womens-Summer-Printed-Top-New-Splicing-Fashion-Sexy-Off-shoulder-Loose-Thin-Short-Sleeve-Tee-i.422516015.21002656973",
            "image": "https://down-sg.img.susercontent.com/file/c757d4d57ca27fd5893243de17699b5b",
            "price": 1321000,
            "location": "Mainland China",
            "rating": 4.823529411764706,
            "sold": 5,
            "description": "Add a touch of style to your wardrobe with this Women's Summer Printed Top. Featuring a sexy off-shoulder design with hollowed out and epaulet details, this top is perfect for a simple, yet chic look. Crafted from lightweight chiffon and polyester material, this top is comfortable to wear while still being fashionable. Available in regular and short sleeve lengths, this top is perfect for any summer occasion. Please note that due to the light and screen setting difference, the item's color may be slightly different from the pictures."
        },
        {
            "title": "Women V-Neck Puff Sleeve Tops - Summer Fashion T-Shirt",
            "path": "https://shopee.sg/Women-T-shirts-V-neck-Puff-Sleeve-Tops-Summer-Fashion-Tshirt-Casual-Patchwork-Women-White-Mesh-i.69827035.4643814980",
            "image": "https://down-sg.img.susercontent.com/file/2ddb69e6548431c602644a30a3780643",
            "price": 745000,
            "location": "Mainland China",
            "rating": 4.375,
            "sold": 1,
            "description": "Refresh your wardrobe with this stylish Women V-Neck Puff Sleeve Tops. Featuring a casual patchwork design and made from lightweight white mesh fabric, this top is perfect for the summer season. Available in one size, please check the size details below carefully before ordering. Package includes: 1 x Women T-shirt."
        },
        {
            "title": "Women's Cowboy Suit - Denim Two Piece T-Shirt Top & Nine Point Jeans ",
            "path": "https://shopee.sg/Cowboy-Suit-Women-Suit-Two-Piece-Student-Cartoon-T-Shirt-Top-Hole-Nine-Point-Jeans-Girl-Fashion-Suits-i.95570154.5737879894",
            "image": "https://down-sg.img.susercontent.com/file/a58d19a5d7dc09a786324c48b6df9372",
            "price": 1393000,
            "location": "Mainland China",
            "rating": 4.688888888888889,
            "sold": 2,
            "description": "Brand: Bird with a Hundred Stripes. Style: Simple Commuting/Korean Edition. Popular Elements: Sequins, Sticking Cloth, Button. Sleeve Length: Short Sleeve. Fabric/Texture of Material: Denim/Cotton. Component Content: 71% - 80%. No Plush. Launch Season: 2020 Summer."
        },
        {
            "title": "ZANZEA Women's Muslim Street Fashion Casual Suits - O-Neck, Full Sleeve, Elastic Waist",
            "path": "https://shopee.sg/ZANZEA-Women-Muslim-Street-Fashion-Casual-Mid-Length-Tops-Splits-With-Insert-Pockets-Wide-Leg-Pants-Suits-i.26974701.19716329486",
            "image": "https://down-sg.img.susercontent.com/file/bcc0b704ccb81a210eb8e676cd479df8",
            "price": 1993000,
            "location": "Mainland China",
            "rating": 4.857142857142857,
            "sold": 3,
            "description": "Get ready for the season with this stylish ZANZEA Women's Muslim Street Fashion Casual Suits! Featuring a solid color design, full sleeve, O-neck, elastic waist, insert pockets, and wide leg pants. Available in Beige, Navy, and Pink. Please check the size chart carefully before placing the order. Package includes 1 suit. Material: 95% Polyester+5% Spandex. Perfect for family, party, beach, wedding, and holiday occasions."
        },
        {
            "title": "ZANZEA Women's European Style Street Fashion Cotton Linen Suit",
            "path": "https://shopee.sg/ZANZEA-Women-European-Style-Street-Fashion-Sleeveless-Tank-Top-Pocket-Wide-Leg-Pants-Cotton-Linen-Suit-i.26974701.17277600718",
            "image": "https://down-sg.img.susercontent.com/file/1a2ad85399ac1332ac75c179fa604368",
            "price": 1866000,
            "location": "Mainland China",
            "rating": 4.8,
            "sold": 2,
            "description": "Get the perfect look with this stylish ZANZEA Women's European Style Street Fashion Cotton Linen Suit! Featuring a sleeveless tank top with side pockets and wide leg pants, this suit is perfect for any occasion. Available in Navy, Khaki, Army Green, and Orange, this suit is made from a lightweight cotton linen blend for a comfortable, breathable fit. Add a touch of retro style to your wardrobe with this stylish suit!"
        },
        {
            "title": "ZANZEA Women's Lace Up Casual Solid O Neck Set with Full Sleeve and Side Pockets",
            "path": "https://shopee.sg/ZANZEA-Women-Fashion-Lace-Up-Casual-Solid-Full-Sleeve-Side-Pockets-O-Neck-Sets-i.26974701.10546253369",
            "image": "https://down-sg.img.susercontent.com/file/484aafabefb9485dc4ec625d4c3c4ac6",
            "price": 1866000,
            "location": "Mainland China",
            "rating": 4.834645669291339,
            "sold": 14,
            "description": "Look stylish and feel comfortable in this ZANZEA Women's Lace Up Casual Solid O Neck Set with Full Sleeve and Side Pockets. It features pure cotton fabric, elastic waist, and solid color pattern. Available in Black, Khaki, Orange, and Blue, this set is perfect for family, party, beach, wedding, holiday, or employment occasions. Please check the size chart carefully before placing the order. Package includes: 1 Suit (Blouse + Pants)."
        },
        {
            "title": "Women's Summer French Style Bubble Sleeve T-shirt - Slim Fit Top",
            "path": "https://shopee.sg/T-shirt-Womens-New-Summer-Short-Sleeve-Top-French-Style-Bubble-Sleeve-Fashion-Large-Size-Top-i.422516015.17420073350",
            "image": "https://down-sg.img.susercontent.com/file/45e56619ce342c6ff602e3567ec72932",
            "price": 1184000,
            "location": "Mainland China",
            "rating": 4.583333333333333,
            "sold": 19,
            "description": "Get ready for summer with this stylish and comfortable t-shirt. Crafted from a lightweight fabric, it features a classic V-neck, short sleeves, and a bubble sleeve design for a unique touch. The slim fit flatters the figure and makes this the perfect choice for any occasion. Available in a range of sizes, so you can find the perfect fit."
        },
        {
            "title": "ZANZEA Women Muslim Fashion Cover Up Puff Sleeves Irregular Top & Wide Leg Pants Suit",
            "path": "https://shopee.sg/ZANZEA-Women-Muslim-Fashion-Cover-Up-Puff-Sleeves-Irregular-Top-Casual-Wide-Leg-Pants-Elastic-Waist-Suit-i.26974701.18845189025",
            "image": "https://down-sg.img.susercontent.com/file/09d12ab7a19cf0f409788443fd4d7035",
            "price": 2013000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 2,
            "description": "Look stylish in this ZANZEA Women Muslim Fashion Cover Up Puff Sleeves Irregular Top & Wide Leg Pants Elastic Waist Suit. It features a full sleeve O-Neck top with printing details and a pair of wide leg pants with an elastic waist. Made of 95% Polyester and 5% Spandex, it is perfect for family, parties, beach, weddings, and holidays. Please refer to the size chart before ordering."
        },
        {
            "title": "ZANZEA Women's Notched Lapel Single Breasted Shorts Sets",
            "path": "https://shopee.sg/ZANZEA-Women-Korean-Fashion-Single-Breasted-Notched-Lapel-Elastic-Waist-Shorts-Sets-i.26974701.21438837832",
            "image": "https://down-sg.img.susercontent.com/file/f6a489150848659c53ddc788fb2b5307",
            "price": 2381000,
            "location": "Mainland China",
            "rating": 5,
            "sold": 2,
            "description": "Material: Polyester | Colors: Purple, Beige, Light Grey | Package includes: 1 Blazer + 1 Shorts (Unlined, With Shoulder Pads) | Cutting: Regular | Stretch: Not Stretchable | Collar: Notched Lapel | Sleeve Style: Regular | Sleeve Length: Short Sleeve | Tops Closure Type: Single Breasted | Shorts Closure Type: Elastic Waist | Features: Pockets | Pattern: Solid | Thickness: Standard | Style: Casual, Commute, Vintage, Elegant, Street Fashion, Preppy | Occasion: Daily, Office, Holiday, Home, Casual, Travel | Note: Please refer to size chart before ordering."
        },
        {
            "title": "Korean Loose Fashion Women's Long Sleeve Suit with Long Pants Two-Piece Set",
            "path": "https://shopee.sg/Long-Sleeve-Women-Suit-2022-Korean-Loose-Fashion-Leisure-Sports-Academic-Style-Long-Pants-Two-piece-Set-Woman-i.95570154.21240066288",
            "image": "https://down-sg.img.susercontent.com/file/72124c0f3d9c09782c19c018e582bcd9",
            "price": 1825000,
            "location": "Mainland China",
            "rating": 4.5,
            "sold": 2,
            "description": "Get ready for the 2022 Autumn season with this stylish Korean Loose Fashion Women's Long Sleeve Suit with Long Pants Two-Piece Set. Available in White, Blue and Apricot, this fashionable two-piece set comes in sizes S, M, L and XL. Look fabulous and stay comfortable all day long!"
        }
    ]
}