{
    "query": "Sports and Outdoor Gear",
    "region": "Singapore",
    "total": 6000,
    "results": [
        {
            "title": "🇸🇬  Back Support / Posture Corrector / Shoulder Support",
            "path": "Back-Support-Posture-Corrector-Shoulder-Support-i.386374312.19220337681",
            "image": "https://down-sg.img.susercontent.com/file/cf3eb1967da82dc6d98143f0bb61f611",
            "price": 566000,
            "location": "SG",
            "rating": 4.814159292035399,
            "sold": 5,
            "description": "🇸🇬  LOCAL SELLER\n- Ready stocks in Singapore warehouse\n- Seller with over 35,000k+ positive reviews on Shopee alone!\n\n🚚  FAST ORDER PROCESSING\n- Our dispatch team will safely pack your parcel within 1 working day!*\n*Working days: Monday to Friday\n*Allow up to 48 hours for peak events.\n\n💵  SAVINGS TIPS\n- Simply spend $15 across our shop and receive FREE delivery on us!\n\n📈  HATE INFLATION?\nYes, we do too! Despite rising costs in operations, we have NEVER increase our prices. We thank you for your continued support and trust in a local homegrown brand.\n\nThank you,\nSpirethlon Team"
        },
        {
            "title": "Protective Gear for Kids Sport Skateboard Accessories",
            "path": "Protective-Gear-for-Kids-Sport-Skateboard-Accessories-i.460953914.15259118552",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvco-lj5g7wywy7ls17",
            "price": 600000,
            "location": "SG",
            "rating": 5,
            "sold": 1,
            "description": "Description:\nThis roller skating protector set is great for 5-15 years old kid\nknee and wrist pad set.\nHigh-density padding for comfort and cooling, highly shockproof, prevent kid from getting injured.\nSuitable for roller skating, riding scooter, skateboarding, cycling and other outdoor sports.\nWith high quality and durable performance.\n\nSpecification:\nMaterial: Foam\nProtector : PVC\n6pcs*Protective Gear"
        },
        {
            "title": "Mileseey PF230 600M Range finder Outdoor Laser Rangefinder Telescope Laser Speed Meter For Golf Telescope use in Golf hunting and outdoor activities",
            "path": "Mileseey-PF230-600M-Range-finder-Outdoor-Laser-Rangefinder-Telescope-Laser-Speed-Meter-For-Golf-Telescope-use-in-Golf-hunting-and-outdoor-activities-i.774209572.16068183895",
            "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lfte6acdcoe6a9",
            "price": 5778000,
            "location": "Mainland China",
            "rating": 4.928571428571429,
            "sold": 12,
            "description": "\n\n\n\n\n\n\n\n\nFeatures:\n\nWidely used in Golf,hunting and outdoor activities： Point-to-Point measurement Distance measurement Angle measurement Height measurement Seed measurement Innovative Technologies: Easy to operate power saving and durable longer lifespan Instant Measuremet Water-proof and Drop-resistance\n\n\ncommon problem \n1. What are the functions of PF230? Telescope, measuring distance, golf trajectory compensation, flagpole locking mode, measuring speed and other functions. Please refer to the manual for specific usage. \n2. How to adjust the eyepiece when you can't see clearly through the eyepiece? The magnification of the telescope is 6 times. When you can't see the object clearly in the eyepiece, you can adjust the magnification in clockwise direction, and decrease it in the counterclockwise direction. When the object in the distance is magnified by the eyepiece, the eyepiece number will be blurred, which is a normal phenomenon. After the target is determined, the distance can be clearly seen by adjusting the eyepiece. \n3. Can indoor measurement be carried out? The measurement should be carried out outdoors in a well lit environment; it can also be measured indoors, but the shortest measurement distance should be more than 5 meters, and the light should be bright. \n4. Why does the product have no laser spot? Telescope rangefinder also has laser, but it belongs to invisible laser. In general measurement environment, laser can not be seen, except in specific instrument environment.\n\nMeasuring unit ： m / Yd\nAccuracy ： 土0.5m\nLaser wavelength ： 905 nm\nEye safety ： FDA (CFR 21 )\nField of View ： 7°\nMagnification ： 6X\nObjective Lens Diameter ： 22mm\nEyepiece Lens Diameter ： 16mm\nExit Pupil Diameter ： 3.7mm\nDiopter ： ±5D\nDiopter Adjustment ： Eyepiece adjustment\nOperating Temperature ： o°C~+40°c\nVibration ： √\nGolf Slope Adjusted Mode ： √\nGolf Scanning Mode ： √\nAuto Level (Hor) ： √\nSpeed Measuring Mode ： √\nFlagpole Scanning Mode ： √\nDisplay LCD ： Transflective LCD\nDimension ： 114*71*43mm\nWeight (Without battery) ： 173g\nMileseey Protective Pouch ： X\n\nModel ： PF230-Mileseey\nRange ： 600m\nPower ： 3V,CR2*1\nMeasuring unit ： m / Yd\nAccuracy ： 土0.5m\nLaser wavelength ： 905 nm\nEye safety ： FDA (CFR 21 )\nField of View ： 7°\nMagnification ： 6X\nObjective Lens Diameter ： 22mm\nEyepiece Lens Diameter ： 16mm\nExit Pupil Diameter ： 3.7mm\nDiopter ： ±5D\nDiopter Adjustment ： Eyepiece adjustment\nOperating Temperature ： o°C~+40°c\nVibration ： X\nGolf Slope Adjusted Mode ： √\nGolf Scanning Mode ： √\nAuto Level (Hor) ： X\nSpeed Measuring Mode ： √\nFlagpole Scanning Mode ： X\nDisplay LCD ： Transflective LCD\nDimension ： 114*71*43mm\nWeight (Without battery) ： 173g\nMileseey Protective Pouch ： √"
        },
        {
            "title": "70cm Sport Fitness Protective Ankle Bandage Wrap Foot Brace Guard Protector",
            "path": "70cm-Sport-Fitness-Protective-Ankle-Bandage-Wrap-Foot-Brace-Guard-Protector-i.68618670.2117554170",
            "image": "https://down-sg.img.susercontent.com/file/c5df671c480caa300e6329d4dbb41f03",
            "price": 193000,
            "location": "Mainland China",
            "rating": 4.807860262008734,
            "sold": 7,
            "description": "Model Number: YS071\n\nColor: Multi colors optional\n\nMaterial: Nylon, latex yarn\n\nSize: Length approx. 70cm\n\nQuantity: 1pcs"
        },
        {
            "title": "1Pair Workout Weight Lifting Fitness Gym Barehand Gloves, Rowing Non-Slip Callus Guard Padded Grip for Cross Training, Pull Up, Hand Palm Protection",
            "path": "1Pair-Workout-Weight-Lifting-Fitness-Gym-Barehand-Gloves-Rowing-Non-Slip-Callus-Guard-Padded-Grip-for-Cross-Training-Pull-Up-Hand-Palm-Protection-i.130088698.17541478363",
            "image": "https://down-sg.img.susercontent.com/file/789dbde3ef7d0bd6ab5f108c86cba4c8",
            "price": 654000,
            "location": "Mainland China",
            "rating": 4.75,
            "sold": 13,
            "description": "About this item\n     MAX COMFORT - Wearing our open design gloves will make you feel like wearing nothing at all. The unique four-finger loop design maximizes the airflow to your hands, reducing sweat significantly.\n      PROTECTION - Microfiber for grip enhancement so your hands won’t easily slide off the iron bar. The cushioned palms provide protection, comfort and support, and give you a reliable hold on weights. Say goodbye to painful calluses, hand blisters, hand rips, and skin tears.\n      FUNCTION - Our gloves are perfectly suitable to perform any sort of workouts, ranging from heavy-duty weight training, pull-ups, rowing, WOD, chin-ups, deadlift to cross fit.\n      LONG-LASTING DURABILITY - Double and triple stitching technology is used to reinforce key pressure points to ensure your grips won't give out before you do. Our pads are made to last.\n\n\nSpecification:\nName: Weightlifting Palm Guard Gloves\nMaterial: Microfiber\nSize: one size fit all\nWarm Reminder: In the process of return and refund, to protect everyone's rights and interests,please provide a complete and clear unpacking video during the process of return and refund,and please provide clear video and photos of problematic product,in order to deal with your problems faster"
        },
        {
            "title": "IDOGEAR 1.7\"Tactical Belt Mens Inner Waist Belt Nylon Black Outdoor Camping 3418 Military Tactical Gear",
            "path": "IDOGEAR-17Tactical-Belt-Mens-Inner-Waist-Belt-Nylon-Black-Outdoor-Camping-3418-Military-Tactical-Gear-i.375407779.7877627611",
            "image": "https://down-sg.img.susercontent.com/file/14dd72ab82413b2696ca7f16d695442b",
            "price": 702000,
            "location": "Mainland China",
            "rating": 4.922330097087379,
            "sold": 17,
            "description": "Material:  Made by high quality nylon material. \nWeight: 110g\nColor: Black\nWidth: 4.3cm\nPackage: inner waist belt x 1( the outside buckle belt is not included )\nDimension: S Fits waist 76-86cm, belt whole length 111cm\n           M Fits waist 86-96cm, belt whole length 119cm\n           L Fits waist 96-106cm,belt whole length 127cm\n\n\nHook&loop ensures belt fasteness during vigorous activities\nPerfect for wargame,duty,hunting...all kinds of outdoor activities.\nHigh quality nylon body makes it durable and reliable\nSize is adjustable, 3 different sizes for your choice, suitable for most of guys!\n\n\n\n#tactical #tactical gear #airsoft #paintball #pistol #hiking #camping #hunting #pouch #G3 #magazine #Nylon #camo #camouflage #military #multicam #survival #survivalkit"
        },
        {
            "title": "PGM Golf Power transmission chain spinner swing trainer suitable for men women kid all age left right handed golfer training aid",
            "path": "PGM-Golf-Power-transmission-chain-spinner-swing-trainer-suitable-for-men-women-kid-all-age-left-right-handed-golfer-training-aid-i.314982917.3686596718",
            "image": "https://down-sg.img.susercontent.com/file/c547b351bcb2e7926a916da29896230e",
            "price": 2860000,
            "location": "Mainland China",
            "rating": 4.780487804878049,
            "sold": 11,
            "description": "Feature：\n# Practice standard golf moves,Make your swing more smoothly.\n# It can be used by either right-handed or left-handed people.\n1. The length and position of the wristband can be adjusted freely according to the size and length of the arm.\n2. The thickened sponge can reduce the friction between the body and the contactor.\n3. The triangle grip, convenient for power transfer, multi-angle training. create a smooth swing.\nThis golf training aid use for swing practice which designed to be able to help golf enthusiasts or professional trainer.\nFrom the point of view of posture and strength to bring more real feeling to the trainer, it can improve the ability of golf players, which is a golf coach recommended professional exercise equipment.\n \n【SWING CORRECTING】You will find the right swing angle quickly when practicing with this perfect golf swing training aid. Swing with the wrong posture will do harm to yourself and is not conducive to improving the ability to play golf, with this golf swing temp trainer, you can correct your swing, increase swing distance effectively and maintain an excellent golf practice experience\n【ACTIVATE MUSCLE MEMORY】It is a power flex golf swing trainer for warm up before the competition and formal training, which can help awaken your muscle and make a steady swing. You can get into the game and the training in a short time with the help of the golf swing trainer.\n \n【HIGH ELASTICITY &amp; ADJUSTABLE】Using composite plastic as material, the golf warm-up swing trainer has higher elasticity, which make it not easy to damage and you can get used to it in a short time. It is really user-friendly. Moreover, the length and position of the wristband can be adjusted freely according to the thickness and length of the wrist, so it is comfortable to wear, and you will not feel uncomfortable when practicing swing with this perfect training aid\n【SUITABLE FOR BEGINNERS AND KIDS】\nThere may be difficulties for beginners and kids to practice golf swing and maintain the right postures, the golf swing weight trainer can help them achieve it. Its anti-skid grip make it friendly to beginners and easy to operate,so it must be a perfect choice for golf training\n【PORTABLE FOR ANYWHERE】\nLength:20.5 inches, width:15.7 inches and weight:0.62 pounds\nWith this perfect golf swing trainer, you can practice swing perfectly just like being taught by a professional coach.\n【Usage】 PRACRICE GOLF SWING CORRECTLY\nWhen using the swing trainer, first, hold the handle with two hands each other, second, the front arm should be straight, third, the elbow can not bend, and finally swing like a professional golfer.\nIn your spare time, it is the best choice to improve golf training skills.\n \nBrand Name: PGM\nModel Number: JZQ019\nProduct Name :Golf Spiner Swing Trainer\nType: Golf Corrector\nWeight :0.282kg\nMaterial:Plastic+ABS\nColor: Red and Green\nSize : Length 52cm / Width 40cm\n#PGM #GolfSwing #golfTraining #Trainer #golfTrainer #Equipment #GolfSwingPractice"
        },
        {
            "title": "LOKAL PUTIH Safety Project Helmet V GUARD Brand MSA SNI Local Suspension FASTRACK FASTRAK -White",
            "path": "LOKAL-PUTIH-Safety-Project-Helmet-V-GUARD-Brand-MSA-SNI-Local-Suspension-FASTRACK-FASTRAK-White-i.348809659.17106119198",
            "image": "https://down-sg.img.susercontent.com/file/01cbea42de70832fe9581d71b619a585",
            "price": 1134000,
            "location": "Indonesia",
            "rating": 4.658536585365853,
            "sold": 12,
            "description": "White V-GUARD safety helmet \n\nMsa LOCAL Brand \n\nAlready strandarized SNI \n\nWith FASTRACK SUSPENCION/NEST\n\nPrice for the helmet and suspension (nest) only\n\nFor the addition of BEEF STRAP please select HELM FAST+CHIN variants\n\nIf you want to use chinstrap or chin strap \n\nDon't forget to add chinstrap with sbb link:\n\n\nSafety project helmet to guarantee your work safety\n\nQuality thick material, glossy finishing, strong, alot, quality original plastic material \n\nResistant slamming and impact\n\nSuitable to be your head shield while working on the field, projects and in factories \n\nSafety FIRST GUY’S\n\n- Anteraja \n- Ninja \n- Parcel Lion \nPickup According to Schedule Each, \nUsually morning and evening.\nHolides\nThick\nPickup at 17: 00 a.m.\nRishi Resi Resis Uploaded at 19: 00 a.m.\n\nAll Orders Yang Come In Saturday 10.00 s / d 15.00 & Sunday / National Holiday \nThen the Goods, Will Be Shipped The Next Day.\n\n\nNew condition item\n\n\n\nIf you want to be safe add Buble Wrap and Wraping\nWith the following links:\n\n\nNo BUBBLE WRAP AND WRAPING\n\nDamage OF THE ITEM IS NOT OUR RESPONSIBILITY\n\nThankyou\n\nPlease order Gan 😊"
        },
        {
            "title": "Sports Weight Lifting Gloves Fitness Training Workout Gymnastics Grips Gym Wrist Band Crossfit Hand Palm Protector",
            "path": "Sports-Weight-Lifting-Gloves-Fitness-Training-Workout-Gymnastics-Grips-Gym-Wrist-Band-Crossfit-Hand-Palm-Protector-i.322052223.7458383910",
            "image": "https://down-sg.img.susercontent.com/file/9e685ad751d7eb96745d2e11af4ca393",
            "price": 680000,
            "location": "Mainland China",
            "rating": 4.883116883116883,
            "sold": 11,
            "description": "BUILT-IN WRIST WRAPS\n\nExperience these uniquely designed weightlifting wrist wraps that offers both men and women a superior training experience and superior wrist support with each and every work out. Excellent wrist support for performing cross training and Olympic lifts like snatches, clean and jerks, front squats, and other lifts requiring wrist protection.\n\nEXTRA TIGHT GRIP * Discover the one of a kind palm design of Silicon Printed Neoprene for extra grip on the barbell, pull up bar, muscle up rings, kettle bells, and more! Triple your work load with no rips, tares, or calluses.\n\nCOMFORT * The Wrist Wraps are tightened and loosened with Velcro, providing the user the ability to adjust to their personal comfort. The well thought out open hand design also provides for extreme comfort, giving your hands the ability to breath while doing intense workouts. LESS SWEAT and MORE VENTILATION equals NO BAD SMELLING Gloves, less washes, thus longer lasting gloves."
        },
        {
            "title": "Bird&Fish 700C 21 gear transmission  inch city road 21 Speed City bicycle 27.5 inch",
            "path": "BirdFish-700C-21-gear-transmission-inch-city-road-21-Speed-City-bicycle-275-inch-i.407635483.10713704305",
            "image": "https://down-sg.img.susercontent.com/file/ccf6d3491def314f4a5d427791029067",
            "price": 22000000,
            "location": "SG",
            "rating": 4.711111111111111,
            "sold": 4,
            "description": "❤️ Welcome  ❤️\n✅【All goods are in stock】\n👍【100% brand new and high quality】\n💁【We ship within 36 hours of your order】\n🚚【You can receive the package within 3 to 7 work days】\nassembled before ship\nColor: black\nSize: 26 inch\nSpeed: 21 speed/ 27speed\nGear：Shimano\nMaterial: Aluminium alloy\nBrake type : Front and rear mechanical disc brakes\nWeight capacity: 150kg\nBicycle Weight: 11KG-13KG\nSHIP BY Seller"
        },
        {
            "title": "New 1 Piece Equipment Ankle Support Sports Compression Protector Comfortable Anti-Sprain Basketball Football Foo",
            "path": "New-1-Piece-Equipment-Ankle-Support-Sports-Compression-Protector-Comfortable-Anti-Sprain-Basketball-Football-Foo-i.322052223.16883377626",
            "image": "https://down-sg.img.susercontent.com/file/37f0fab26f10f081e0413149c205d360",
            "price": 281000,
            "location": "Mainland China",
            "rating": 4.821428571428571,
            "sold": 82,
            "description": "💕Hello, Welcome To Kang DUKE Store!!\n\nSkang DUKE Mainly Sells Sports Peripheral Products.\n\n\n💎 If You Have Any Questions, Please Contact Us, We Will Serve You At Any Time.\n\n\nProduct Name: Compression Ankle Brace\n\nMaterial: Spandex And Nylon\n\nColor: Black\n\nPacking Quantity: 1 Piece (Not 1 Pair)\n\n\n\nSize: S/M/L/XL\n\n\nProduct Display:\n\n\n\nProduct Details:\n\n\n\n\nFunction Function: Compression, Protect Ankle From Injury, Ankle Stability\n\nProtection Level: Professional Protection\n\nType: Ankle Foot Protector\n\nFeatures: Size, Comfortable, Compression, Stretching, Breathable, Protection\n\nUses: Golf, Baseball, Football, Tennis, Running, Cycling\n\n\n\nSize, Lightweight And Comfortable: This Support Ankle Brace Is Lightweight And Provides Maximum Comfort In All Your Favorite Activities.Perfect For Golf, Baseball, Football, Tennis, Workout, Running Or Even Cycling!This Is The Best Ankle Support For Sports Performance!\n\n\n\nErgonomic Design: Medical Ankle Support Is Designed To Perfectly Fit Any Type Of Ankle, So We Can Protect You If Your Ankle Is Slim Or Fleshy.Women Ankle Support Socks Feature Non-Slip Top Cuffs, Non-Slip Bottom Cuffs And Open Toe Design For All-Round Movement For Improved Mobility.\n\n\n\nHigh Quality Material: Our Ankle Sleeves Are Made Of Fully Elastic And Breathable Material, Which Is Very Strong And Provides Optimum Compression To Improve Joint Stability And Blood Circulation.In Addition, The Sweat-Absorbent Material Of The Ankle Brace Will Keep Your Feet Smell-Free And Dry."
        },
        {
            "title": "LED Flashlight USB Rechargeable LED Waterproof Torch for Outdoor Camping Hiking Cycling",
            "path": "LED-Flashlight-USB-Rechargeable-LED-Waterproof-Torch-for-Outdoor-Camping-Hiking-Cycling-i.373941026.9933886458",
            "image": "https://down-sg.img.susercontent.com/file/af151cbbb625b2104d2875c5711a86e4",
            "price": 743000,
            "location": "Mainland China",
            "rating": 4.598526703499079,
            "sold": 58,
            "description": "♥♥Welcome to our store ♥♥ \n★Features:\n【Super Bright】: Ultra-high lamp bead, irradiation distance up to 500m, 3 lighting modes (High / Low / Strobe ). Please don't point the flashlight in anyone’s eyes directly.\n【Waterproof 】IPX4 waterproof and designed for almost any weather conditions.\n【USB rechargeable】Built-in rechargeable 18650 battery, after fully charged, it will work up to 3-6 hours\n\n★Specification:\nMaterial: ABS\nColor: black\nSize: 168mm*44mm / 6.61inch* 1.73inch\nModes: High, Low, Strobe\nFunctions: lighting, camping, hiking, reading.\nElectricity: built-in 18650 battery\nWaterproof: IPX4"
        },
        {
            "title": "BraceTop Sports Compression Leg Sleeves Extra Long Leg Brace Knee Support for Basketball Football Running Cycling & Knee Pain",
            "path": "BraceTop-Sports-Compression-Leg-Sleeves-Extra-Long-Leg-Brace-Knee-Support-for-Basketball-Football-Running-Cycling-Knee-Pain-i.130088698.12081886062",
            "image": "https://down-sg.img.susercontent.com/file/f1fb8941d4033ba59336b45327d559d0",
            "price": 572000,
            "location": "Mainland China",
            "rating": 4.948275862068965,
            "sold": 11,
            "description": "Size Chart:  \n\nM---Thigh Circumference: 34-38cm /13.4-15inch\n\nL---Thigh Circumference: 38-42cm /15-16.5inch\n\nXL---Thigh Circumference: 42-46cm /16.5-18inch\n\nXXL---Thigh Circumference: 46-56cm /18-22inch\n\nPlease measure your thigh circumference 7 inch above your kneecap.\n\nProduct Description\nWeight: about 120g per piece\nColor: Black, Green, Blue\nMaterial: Spandex 25%, Polyester 33%, Nylon 42%\nSize: M, L, XL, XXL\nSuit for: Men, Women, Adults, Male, Female, Teenagers, Boys, Girls\nApplicable Scene: Running, Climbing, Golf, Basketball, Football, Soccer, Volleyball, Tennis, Badminton, Mountaineering, Hiking, Cycling, Biking, Weight Lifting, Yoga, Sports Fitness and so on\nPlease allow 1-2cm measuring deviation due to manual measurement\nDue to various monitors and lighting conditions, colors may be slightly different from listed photos.\n\nFeature:\n1. Offers optimal muscle support between workouts and during casual everyday activities.\n2. Highly effective in supporting swollen and painful knees. Enhances blood circulation to rejuvenate muscles, ligaments and joints.\n3. High-Performance fabric keeps an optimal joint temperature. Are perfect for any season or environment, indoors or outdoors.\n\nAbout the Product:\n1. Perfect for arthritis, tendonitis, swelling, meniscus tear, strains, sprains, calf cramps and recovery after surgery.\n2. Our knee braces for knee pain with compression can promote blood circulation and oxygen flow to relieve knee and calf pain, reduce varicose veins and swelling of legs. \n3. Fit for: Running, mountain climbing, riding, football, basketball, tennis, old cold leg, fitness, baseball, obstacle course runs savage, drive, cycling, football, golf, skiing skating, weight lifting, boxing, hiking.\n4. Quick at absorbing sweat and keeps your leg dry, gives you hours of continuous use. It also ensures increased blood transport to muscles over the entire length and keep the legs warm.\n5. This long leg sleeve is optimally designed for perfect fit. Seamlessly knit structure for exact fit and wide thigh band comfort. Ideal for who often use your legs a lot or exercise regularly. Highest quality materials provide maximum stability and non-slip.\n\nPacking List\n1 PC * Full Leg Compression Sleeve\nor\n1 Pair * Full Leg Compression Sleeves\nNote: 1 PC Full Leg Compression Sleeve can fit both left and right leg\nWarm Reminder: In the process of return and refund, to protect everyone's rights and interests,please provide a complete and clear unpacking video during the process of return and refund,and please provide clear video and photos of problematic product,in order to deal with your problems faster"
        },
        {
            "title": "【FAST SHIP】 Multi- Functional Carabiner Clip Outdoor Camping Multi Tool Fishing Acessories, Aluminum Alloy D Shape  Buckle 360Rotating Hook for Camping, Hiking, Travel Bag Backpack er",
            "path": "FAST-SHIP-Multi-Functional-Carabiner-Clip-Outdoor-Camping-Multi-Tool-Fishing-Acessories-Aluminum-Alloy-D-Shape-Buckle-360Rotating-Hook-for-Camping-Hiking-Travel-Bag-Backpack-er-i.412714710.7585148153",
            "image": "https://down-sg.img.susercontent.com/file/8f76e2dd31fd2d6fc4d69008d2f50ca3",
            "price": 256000,
            "location": "Mainland China",
            "rating": 4.857291666666667,
            "sold": 247,
            "description": "Description:\nMultifunctional 3-in-1 design Carabiner combines clip and hook allows you to  anything to anywhere\nPremium aviation aluminum main body, high strength, strong and can hold up to 18kg/39.68 lbs\nHook foldable, compact for easy carrying and convenient storage\n360 degree rotatable and multifunctional; can be used for hanging luggage, handbag, luggage, bottles, backpack, keychain and etc.\nIt is NOT for climbing or other use where over 20kg/40 lbs and may result in bodily harm\nSpecification:\n5.84x4.82cm/2.29x1.89 inch (Fold)\nUnfloding Length: 10.7cm\nPackage Includes:\n1 Piece Carabiner Clip Hook"
        },
        {
            "title": "FUSHANG Durable Gloves Hook Multi-purpose Anti-lost Work Gloves Safety Clip Portable Climbing Rope Outdoor Tools Nylon Gloves Camping Hiking Hanging Buck/Multicolor",
            "path": "FUSHANG-Durable-Gloves-Hook-Multi-purpose-Anti-lost-Work-Gloves-Safety-Clip-Portable-Climbing-Rope-Outdoor-Tools-Nylon-Gloves-Camping-Hiking-Hanging-BuckMulticolor-i.115163700.7581893498",
            "image": "https://down-sg.img.susercontent.com/file/cfb72ff0b3e0c01070ee0f8631af26dc",
            "price": 187000,
            "location": "Mainland China",
            "rating": 4.9201773835920175,
            "sold": 2288,
            "description": "<div><p>Color: black, khaki, army green\nSize: total length 12cm, fixed webbing adjustment 11-16cm, weaving width 2.5cm\nMaterial: Nylon\nType:hanging buckle\nPacking list:1*glove hanging buckle\nSize: total length 12cm, fixed webbing adjustment 11-16cm, weaving width 2.5cm</p></div>"
        },
        {
            "title": "Mileseey PF2E Golf Laser Rangefinder 600M Yard/M Mini 6x Telescope Measure Meter Speed Measure For Golf Hunting Sport,6 colors",
            "path": "Mileseey-PF2E-Golf-Laser-Rangefinder-600M-YardM-Mini-6x-Telescope-Measure-Meter-Speed-Measure-For-Golf-Hunting-Sport6-colors-i.774209572.17885917100",
            "image": "https://down-sg.img.susercontent.com/file/cn-11134207-7qukw-lfhxr7zcnnw897",
            "price": 6803000,
            "location": "Mainland China",
            "rating": 4.825,
            "sold": 10,
            "description": "\n\n\n\n\n\nMileseey is a leader in China's precision laser measurement and control industry, creating a global diversified technology enterprise\nWe have a stable batch manufacturing capacity of millions, which can meet the orders of hundreds of thousands of customers.\nMileseey has perfect quality control capabilities and has successfully passed ISO9001 certification from SGS.\n\n【𝐑𝐄𝐀𝐃𝐘𝐒𝐓𝐎𝐂𝐊】⏱48h express (working days)\n\n【𝐋𝐎𝐂𝐀𝐋𝐃𝐄𝐋𝐈𝐕𝐄𝐑𝐘】🚚𝗦𝗵𝗶𝗽 from China\n\n📌𝐒𝐩𝐞𝐜𝐢𝐟𝐢𝐜𝐚𝐭𝐢𝐨𝐧:\n\nBrand: MILESEEY PF2E telescope\n- Portable laser rangefinder telescope for golf.\n- Durable aluminum alloy shell, precision one-piece polishing process, sandblasting technology.\n- Using TOF (Optical Time of Flight) technology and angle sensor\n- Implement golf ball trajectory compensation\n- Golf Ballistic Scan\n- Golf speed test\n-Intuitive ranging, high measurement accuracy, fast measurement speed, intuitive distance display, low power consumption, etc.\n\nSpecification:\nProduct name: MILESEEY PF2E telescope\nModel: PF2E\nTelescope magnification: 6X\nTelescope objective lens aperture: 22mm\nTelescope eyepiece aperture: 16mm\nExit pupil diameter: 3.7mm\nVisually Safe: FDA (CFR)\nTwo-point metering mode\nAutomatic height measurement mode\nAuto level mode\nspeed mode\ngoniometer\nLiquid Crystal Display: Transmissive Liquid Crystal Display\nWeight: about 150g (without battery)\nSize: about 110*73*43mm.\n\nnotes:\n* Due to different shooting and display, the displayed color is slightly different.\n\nPacking list:\n1*PF2E Laser Ranging Telescope\n1 * Lanyard\n1*Telescope lens cleaning cloth\n1* Six Colors Body Sticker\n1 * User Manual (Simplified Chinese and English)\n\nPlease read the following details before placing an order.\nWarranty\n✅ 100% authentic, after receiving the product, it can be replaced with a new product if it is a quality problem of the product itself.\nOur shop is unable to issue tax invoices and we apologize to our customers.\n✅ Such as ordering the wrong product, wrong model, wrong color, our store reserves the right not to exchange or return. Please check carefully before placing an order.\n✅ If the address is wrong, the store cannot fix it. Customers must cancel before the package number is displayed. Otherwise the product cannot be cancelled.\n✅ Follow the store to receive promotions/special offers/participation prizes\n✅ Products are replaced within 15 days in case of wrinkles, equipment defects. /Cracked screen/Dent/Cracked devices must be notified within 24 hours of unboxing photos and videos.\n✅ Product warranty does not include freebies. During the warranty period, the freight needs to be paid by the customer."
        },
        {
            "title": "Polyester Emergency Gear plastic buckle Camping Hiking Paracord Bracelet",
            "path": "Polyester-Emergency-Gear-plastic-buckle-Camping-Hiking-Paracord-Bracelet-i.40263988.1475985856",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcu-ljj2kzu7qz6f17",
            "price": 180000,
            "location": "Mainland China",
            "rating": 4.8671875,
            "sold": 5,
            "description": "Load of bracelet: 110kg\nItem type: Paracord Bracelet\nCircumference of the bracelet: 25cm/9.84inch (buckle closed)\nMain Material: Plastic, Polyester\nWidth of the bracelet: approx 2.0cm/0.79inch (braided cord)\nLength of untied bracelet: 3.0-3.2m\nDiameter of the cord: 4mm\nDescription:\nA survival bracelet braided from parachute cord with plastic buckle.\nKnitted up by 3.0-3.2m paracord which can be used in an emergency or packaging, etc.\nIdeal accessory for camping, boating, hunting, hiking, and other outdoor activities.\nTensile strength of the paracord is up to 110kg.\nAs stylish decoration wearing in daily life.\n\nPackage Includes:\n1x Paracord Bracelet Rope Wristband"
        },
        {
            "title": "1Pcs Sport Long Knee Support Silicone Antiskid Breathable Compression Brace Pad Protector Sport Basketball Leg Sleeve for Joint Pain Relief And Injury Recovery",
            "path": "1Pcs-Sport-Long-Knee-Support-Silicone-Antiskid-Breathable-Compression-Brace-Pad-Protector-Sport-Basketball-Leg-Sleeve-for-Joint-Pain-Relief-And-Injury-Recovery-i.130088698.12283517394",
            "image": "https://down-sg.img.susercontent.com/file/1d075bc021efd188b2686c9b3d125687",
            "price": 910000,
            "location": "Mainland China",
            "rating": 4.8125,
            "sold": 4,
            "description": "Unit: 1pcs\n  Note: the unit of this item is only 1pcs, no have left and right leg differences, if you mind it, please be cautious to purchase.\n\n Multi Functions:\n    ---Reduces chronic pain around the patella.\n    ---Ensures non-restricted supported performance.\n    ---Ideal protection for ACL, PCL, and meniscus tears.\n    ---Minimizes joint oscillation for less risk of injury.\n    ---Helps to eliminate joint displacement and discomfort.\n    ---Reduces inflammation and swelling associated with injury.\n    ---Improves blood circulation, Promotes faster muscular recovery.\n    ---Supports the knee cap and joint when stationary and during motion.\n    ---Alleviates soreness and stiffness after exercise or long periods of standing.\n\nMaterial: nylon,spandex, silicone, gel\nColor: black\n\n   Size M:\n     Length: 43cm/16.9\n     UP Circumference: 30-42cm/11.8-16.5inch\n     Down Circumference: 24-33cm/9.4-12.9inch\n\n Size L:\n       Length: 43cm/11inch\n       UP Circumference: 32-45cm/12.6-17.7inch\n       Down Circumference: 25-34cm/9.8-13.9inch\n\n   Size XL\n     Length: 45cm/11inch\n     UP Circumference: 34-48cm/13.9-18.9inch\n     Down Circumference: 26-35cm/10.2-13.8inch\n\nFeature：\n\n   1. Comfortable knitted fabric and breathable perspiration.\n\n   2. Thicken strengthening silicone patella pad, cushioning and decompression bending easily without strain, decompression protection.\n\n   3.Dual memory springs support, soft and high elastic, secure the support, body fit design, fits the leg without tight, which doesn't make a difference to knee beng.\n\n   4.Dual silicone anti-skid strip for free movement, soft and comfortable, doing no harm to your skin.\n\n   5.Lengthen and lightweight, adopts mesh weave design, about 1.06mm thickness, even no sultry in summer, all weather fit.\n\nDescription:\n\n   1. Patella Stabilization Technology - Incorporated with anti-collision gel pad design that holds the patella in proper position and stabilizes your ACL, PCL, LCL, and MCL ligaments. It not only provides comfortable stabilization to the knee, and absorption of dynamic forces, but also provides extreme support for joint stabilization, pain relief and quicker injury recovery.\n\n   2.Relieve Knee Pain & Protect Your Joint – Reduce pain and recover faster from arthritis, joint pain relief, tendonitis, post-surgery, swelling as well as strains and sprains. Designed to reduce inflammation or swelling after an injury and help you recover from surgery. Ideal for meniscus tear, tendonitis as well as runners and jumpers knee problems.\n\n   3. Double spring supports--Adopts soft elastic spiral-shaped supports, which prevents the knee brace from easily deformation, increase the auxiliary and shrink the foot joint, easy to take on and off.\n\n   4.High Quality: Made of superior nylon and spandex material. Please note other knee support braces don't provide the level of support, are very stiff, uncomfortable, and won't last as long as ours. \n\n5.Our leg brace glides over your leg and hugs your knee"
        },
        {
            "title": "Muscle Trainer Stimulator  Muscle Training Equipment",
            "path": "Muscle-Trainer-Stimulator-Muscle-Training-Equipment-i.202943576.5226039636",
            "image": "https://down-sg.img.susercontent.com/file/94feec07fb96854844a175782e94ef0c",
            "price": 2187000,
            "location": "Mainland China",
            "rating": 4.803664921465969,
            "sold": 15,
            "description": "Features:\n1.Traditional exercises require continuous replacement of hydrogel, and subsequent expenses are higher. We don't need this one, saving all expenses at once.\n2.This advanced smart fitness abdominal belt Adopts electric acupuncture massage technology, inputting certain low-frequency pulse current into the human body to stimulate muscles, achieve the slimming massage effect.\n3.Accelerate the blood circulation and metabolism. Good effective in muscle training, fat reducing, pain relieving as well as figure shaping.\n4.Built-in 6 massage modes, 15 massage intensity,which simulate the muscle contraction strength of different professional sports and stimulate the muscle strength as needed to meet different needs.\n5.The Ems Massager Support USB charging design, long battery life, can be used anytime anywhere.\n\nSpecifica:\nBattery capacity: 150 mAh\nWorking voltage :DC5V\nBelt size :110 cm \nHost size :65*45*12mm\nPacking size: 25*15*4cm\nMaterial: selected PU+ABS\nScene: Outdoor, office, family\nUses: fitness equipment, weight loss, extreme challenges, health massage.\nFeature1:6 modes, 15 gear strength\nFeature2: No need for hydrogels, just wipe wet thewhite conductive silver with wet cloth.\n\nPackage Included:\n1*Arm belt\n1*host\n1*instruction\n1*usb charging cable\nOR\n1* belt\n1*host\n1*instruction\n1*usb charging cable\nOR\n1*belt\n2*Arm belt\n3*host\n1*usb charging cable\n1*instruction"
        },
        {
            "title": "Outdoors Portable Table, Small Folding Camp Gear with Aluminum Table Top and Carry Bag, Small and Lightweight for Beach, Picnic, Outdoors and Travel",
            "path": "Outdoors-Portable-Table-Small-Folding-Camp-Gear-with-Aluminum-Table-Top-and-Carry-Bag-Small-and-Lightweight-for-Beach-Picnic-Outdoors-and-Travel-i.490045304.13710250488",
            "image": "https://down-sg.img.susercontent.com/file/1a26d68eb77afb86f9a91add5fff50a0",
            "price": 531000,
            "location": "Mainland China",
            "rating": 4.841269841269841,
            "sold": 7,
            "description": "A sub-price goods!\n\nProduct Name: Portable Folding Table\n\nMaterial : Aluminum alloy, Custom Oxford\n\nColor: Green, Black, Sandy\n\nWeight : 682 G\n\nSupported Weight: 15 Kg\n\nSize : 60*39*39 cm\n\nFolding Size: 42*12*10 cm\n\nFeatures:\n\n1, This folding table is easy to set up so you spend more time enjoying your break; completely user oriented with features including plastic buckles that attach easily and securely to the table top.\n\n2, Foldable design allows you to easily transport and store this table anywhere\n\n3, This table is a must that everyone will be talking about on your next adventure."
        }
    ]
}