{
    "query": "Toys and Games",
    "region": "Singapore",
    "total": 3000,
    "results": [
        {
            "title": "20*20cm Foldable Scrabble Board Game - Compact Travel Edition",
            "path": "https://shopee.sg/2020cm-Foldable-Scrabble-Board-Game-Folding-Travel-Scrabble-Compact-Game-i.67960532.7742584619",
            "image": "https://down-sg.img.susercontent.com/file/6c18abad1a96df8ca7f5f53ccac48b52",
            "price": 810000,
            "location": "Mainland China",
            "rating": 4.730627306273063,
            "sold": 12,
            "description": "Enjoy a classic game of Scrabble with this compact travel edition. This set includes a 20*20cm foldable game board, 100 game word cards, 4 word calipers, and a PVC pocket for easy storage and portability. Challenge your friends and family to a game of Scrabble and have fun while learning new words! Perfect for family game nights or travel. #boardgame #scrabble"
        },
        {
            "title": "YQ20 CowherdMN99s Remote Control Car Land Rover GuardD90 Full Scale Simulation RC Model Four-Wheel Climbing Waterproof off-Road Vehicle",
            "path": "https://shopee.sg/YQ20-CowherdMN99sRemote-Control-Car-Land-Rover-GuardD90Full-Scale-SimulationRCModel-Four-Wheel-Climbing-Waterproof-off-R-i.524205429.22568539142",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdi-lh30c5r81wtg73",
            "price": 10200000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Get the ultimate off-road experience with the YQ20 CowherdMN99s Remote Control Car Land Rover GuardD90 Full Scale Simulation RC Model Four-Wheel Climbing Waterproof off-Road Vehicle! Ready stock and shipped from China, this RC car is perfect for 14+ age range and comes with a remote control handle. Enjoy waterproof and four-wheel climbing capabilities as you explore the outdoors with this RC car. If you have any questions or concerns, please don't hesitate to contact us and we'll do our best to help. Plus, when you leave us a five-star review, you can get a voucher for your next order! Get ready for an off-road adventure with the YQ20 CowherdMN99s Remote Control Car Land Rover GuardD90"
        },
        {
            "title": "🎁Star Wars 2 Pcs LightSaber Combined Extendable Laser LED Sword Set🔥",
            "path": "https://shopee.sg/Local-ShipStar-Wars-2-Pcs-LightSaber-Combined-Extendable-Laser-LED-Sword-Set-Motion-Sensitive-FX-Sound-Sword-for-Kids-i.444092281.17282296577",
            "image": "https://down-sg.img.susercontent.com/file/8e5253065c605cce1907ec9fdb708546",
            "price": 350000,
            "location": "SG",
            "rating": 4.694117647058824,
            "sold": 70,
            "description": "Welcome to Global Reality! Get FREE VOUCHER when you follow our shop. Enjoy LOCAL READY STOCK with Ship within 24 hours for Quality Assurance & Double Check. Trusted Seller with GOOD Ratings and Delivery to your doorstep 1-3 days. This STAR WARS SET Includes TWO Lightsaber (Extendable) with 7 COLORED LIGHTS and MOTION SENSITIVE SOUND EFFECTS. Quality & Durable & Security with 100% non-toxic, odorless, durable, long lasting and easy to use. Requires 3 AAA batteries each lightsaber (not provided). Exchange/refund after shipping out the item if product is broken. Contact us with Chat if you have any questions. Shop now!"
        },
        {
            "title": "Rummikub Classic Edition - Family Board Game for Ages 8 and Up",
            "path": "https://shopee.sg/Board-Game-Classic-Edition-Rummikub-Family-Game-i.67960532.17906200765",
            "image": "https://down-sg.img.susercontent.com/file/2fac876e92d3b775369e814e88974e04",
            "price": 2051000,
            "location": "Mainland China",
            "rating": 4.8,
            "sold": 6,
            "description": "Enjoy fast-paced, easy-to-learn gameplay with Rummikub Classic! This popular game combines luck and strategy for a unique experience every time you play. Players take turns placing numbered tiles in runs or groups, Rummy style. The first to use all their tiles wins! Perfect for multigenerational play, this board game helps teach STEM skills like sequencing and pattern recognition. Get ready for hours of family fun with Rummikub Classic!"
        },
        {
            "title": "6PCS Reusable Silicone Water Bombs - Absorbent Ball for Outdoor Pool & Beach Play",
            "path": "https://shopee.sg/6PCS-Colorful-Water-Balloon-Reusable-Silicone-Water-Bomb-Absorbent-Ball-Outdoor-Pool-Beach-Play-Toy-Fight-Games-i.51960315.14490011008",
            "image": "https://down-sg.img.susercontent.com/file/dd1c6fcb45a29afda7662fb731391559",
            "price": 647000,
            "location": "Mainland China",
            "rating": 4.511627906976744,
            "sold": 9,
            "description": "Get ready for a summer of fun with these 6PCS Reusable Silicone Water Bombs! These colorful water balloons are perfect for outdoor pool and beach play. Made of non-toxic and tasteless silicone, these water bombs are soft to the touch and feature a magnet adsorption interface for easy reuse. These water bombs are easy to fill and close in a second, so you can start your water fight right away! Perfect for summer parties, parent-child activities, swimming pools, beaches, parks, and more. Get ready for some fun in the sun with these 6PCS Reusable Silicone Water Bombs!"
        },
        {
            "title": "Electronic Gun Target Set with Light & Sound Effects - Auto Reset & High Precision Scoring",
            "path": "https://shopee.sg/SG-Local-Stock-Toys-Shooting-Target-Light-Shooting-Game-Auto-Reset-Electric-Gun-Target-Kids-Sound-i.144788252.12611792242",
            "image": "https://down-sg.img.susercontent.com/file/4b30189cce0880a971640aa0bd0fe5cc",
            "price": 1430000,
            "location": "SG",
            "rating": 4.7514450867052025,
            "sold": 11,
            "description": "Enhance your shooting skills with this Electronic Gun Target Set! Enjoy realistic sound and light effects with every shot, and keep track of your scores with high precision scoring. The target resets itself automatically, making it perfect for hours of fun! Get ready to aim and shoot!"
        },
        {
            "title": "RC Racing Kids Mini Car Remote Control Watch Toy - USB Charge Christmas Gift for Kids",
            "path": "https://shopee.sg/RC-Racing-Kids-Mini-Racing-Car-Remote-Control-Watches-toy-USB-charge-Christmas-gift-jam-tangan-kereta-kawalan-jauh-budak-kanak-i.770442999.16465820517",
            "image": "https://down-sg.img.susercontent.com/file/5e51e8be6fdb550faccc45e27a97e28f",
            "price": 955000,
            "location": "Mainland China",
            "rating": 4.780748663101604,
            "sold": 46,
            "description": "🎁 Get ready to rev up the fun with this RC Racing Kids Mini Car Remote Control Watch Toy! It features a colorful, cute mini racing car with a silicone wristband and a waterproof transparent cover to protect the car. Made of high-quality food-grade ABS material, the soft silicone wristband is smooth to the touch and wear-resistant. Perfect for kids as a birthday or Christmas gift, this RC Racing Kids Mini Car Remote Control Watch Toy comes with a USB cable and is suitable for ages 4 and up. Get yours now and let the racing begin!"
        },
        {
            "title": "Deepen Connections and Create New Ones with the We're Not Really Strangers Card Game",
            "path": "https://shopee.sg/WERE-NOT-REALLY-STRANGERS-CARD-GAME-i.173728060.21201329620",
            "image": "https://down-sg.img.susercontent.com/file/3b4bc51e9ca0469b0c3913e1eafe4bf7",
            "price": 1242000,
            "location": "Mainland China",
            "rating": 4.745762711864407,
            "sold": 10,
            "description": "Create meaningful connections with the We're Not Really Strangers Card Game. This purpose-driven card game is designed to empower connections between 2-6 players. It includes 2 pencils, a WNRS notepad, 2 transparent Dig Deeper cards, and 150 questions and wildcards. Challenge your existing relationships and discover new ones with this fun and interactive game!"
        },
        {
            "title": "Get Ready for Fun with Easyhome.sg's Magical Claw Machine!",
            "path": "https://shopee.sg/Easyhomesg-Magical-Claw-Machine-Mini-Arcade-UFO-Claw-Catcher-Game-i.7595687.1580642528",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvdz-lftdvnkmpirn81",
            "price": 662000,
            "location": "SG",
            "rating": 4.9185185185185185,
            "sold": 11,
            "description": "Get ready for hours of fun with Easyhome.sg's Magical Claw Machine! This mini arcade UFO Claw Catcher Game is brand new in box and comes with tokens and 6 plush. Plus, you can get an additional 10 plush toys option available! It's powered by both USB and battery (battery not included). Please note that the playset comes with packaging box, which may be damaged or dented during delivery. To ensure extra protection, an add-on carton box is available for delivery. This is a perfect gift for kids and adults alike - get yours today and enjoy the excitement of the Magical Claw Machine!"
        },
        {
            "title": "Taboo Card Game - The Unspeakable Fun of Guessing Words!",
            "path": "https://shopee.sg/Taboo-Game-board-games-Card-Game-i.173728060.6320453168",
            "image": "https://down-sg.img.susercontent.com/file/b234c606ea4ba601240bee662ee80c3c",
            "price": 1836000,
            "location": "Mainland China",
            "rating": 4.666666666666667,
            "sold": 3,
            "description": "The Taboo Card Game is the ultimate game of unspeakable fun! Race against the timer as you try to give creative and carefully-worded clues to get your team to guess words fast. But don't mention the forbidden words on the cards or you'll get the squeaker and lose the point! This super-fun guessing game is great for families and kids over 13 years of age, and includes 260 cards with over 640 Guess words. Get ready for a night of unspeakable fun with the Taboo Card Game!"
        },
        {
            "title": "So Cards Deep Conversation Starters Volume Two - Question Card Game for All Occasions",
            "path": "https://shopee.sg/So-Cards-Deep-Conversation-Starters-Question-Card-Game-for-All-Occasions-Volume-Two-i.173728060.21917763010",
            "image": "https://down-sg.img.susercontent.com/file/2c9912c3ffc280eb8d8d9c19cc6e4111",
            "price": 551000,
            "location": "Mainland China",
            "rating": 4.8125,
            "sold": 22,
            "description": "Get ready to dive deep into meaningful conversations with So Cards Deep Conversation Starters Volume Two. With 52 thought-provoking questions designed to spark meaningful connections, this question card game is perfect for dinners, parties, and friendly get-togethers. Enjoy improved readability with bigger, clearer letters, and get ready to make lasting connections with So Cards Deep Conversation Starters Volume Two. Available on May 5th, 2022."
        },
        {
            "title": "Craft Eva Foam Sheets - Punch Sheet DIY Handmade Model Making Material",
            "path": "https://shopee.sg/Eva-Foam-Sheets-Craft-Eva-Sheets-Punch-Sheet-DIY-Handmade-Model-Making-Material-i.283475592.5848569946",
            "image": "https://down-sg.img.susercontent.com/file/ddc4a4d00efa579affd9164eb42a6eb5",
            "price": 810000,
            "location": "Mainland China",
            "rating": 4.6909090909090905,
            "sold": 5,
            "description": "Make your DIY projects come to life with this Craft Eva Foam Sheets! Perfect for model making and other craft projects, this set includes 1 sheet of Eva Foam in your choice of thickness. Available in black and white, these sheets are 50 x 30cm in size and are made of high-quality Eva material. Get your set today and create something amazing!"
        },
        {
            "title": "Baby Playpen - Game Fence for Indoor Safety | Guardrail & Crawling Mat | Delivery in 15-25 Days",
            "path": "https://shopee.sg/Baby-Playpen-Babys-Game-Fence-Indoor-Childrens-Crawling-Mat-Guardrail-Walking-Safety-Fence-Bed-Ground-Dual-Purpose-167sg-i.267928044.19005981141",
            "image": "https://down-sg.img.susercontent.com/file/292a80726cde3486ea8e5c5ee0a1db21",
            "price": 4719000,
            "location": "Mainland China",
            "rating": 4.722222222222222,
            "sold": 14,
            "description": "Shop for your baby's safety with our Baby Playpen - Game Fence for Indoor use! Enjoy guardrail & crawling mat for your baby's protection. FREE Delivery in 15-25 days. We provide exceptional after-sales support - open the package and check before receiving the goods. If there are any quality problems, contact us and provide pictures for a fast resolution. Shop now!"
        },
        {
            "title": "Deepen Relationships & Create New Ones with We're Not Really Strangers Interactive Card Game",
            "path": "https://shopee.sg/Were-Not-Really-Strangers-Interactive-Adult-Card-Game-i.70474967.17328632316",
            "image": "https://down-sg.img.susercontent.com/file/9a0abb96d38d96d19a16b68257a919d9",
            "price": 667000,
            "location": "Mainland China",
            "rating": 4.9298245614035086,
            "sold": 23,
            "description": "Enhance existing relationships and create new ones with We're Not Really Strangers Interactive Adult Card Game. Optimized for 2 players (ages 12 and up), this game comes with 2 Pencils, WNRS Notepad, 2 Clear Dig Deeper Cards, 150 Questions and Wild Cards. Enjoy a fun and interactive experience with friends and family with this game. Box size: 5x4x3 inches."
        },
        {
            "title": "Kids Fishing Game Toys - Perfect Christmas Gifts for Kids",
            "path": "https://shopee.sg/Christmas-Gifts-Kids-fishing-game-toys-i.178175797.7643257581",
            "image": "https://down-sg.img.susercontent.com/file/f3c421a000aec622d9dcbb90b88a504b",
            "price": 662000,
            "location": "SG",
            "rating": 4.827814569536423,
            "sold": 21,
            "description": "Get your kids this fun fishing game toy set for the perfect Christmas gift! Made from eco-friendly plastic, this game set comes in a variety of colors and sizes. Enjoy quality time with your kids as you deepen the relationship between parent and child. Cultivate your children's manipulative ability, degree of sensitivity, concentration, and coordination. This set includes 1 set of fishing toys, packed in an OPP Bag. Suitable for children over 3 years old. Get this fishing game toy set today and watch your child's eyes light up!"
        },
        {
            "title": "🎠SG Stock🎠DIY Large Dinosaur Racing Car Track Game Set - Cultivate Kids' Cognitive Skills & Imagination!",
            "path": "https://shopee.sg/SG-StockDIY-Large-Dinosaur-Racing-Car-Track-Game-Racing-track-Assembled-building-blocks-Model-Children-Toy-Set-Gift-i.610125895.15063123183",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-84zvmn2ux1kv50",
            "price": 1115000,
            "location": "SG",
            "rating": 4.928571428571429,
            "sold": 3,
            "description": "Singapore local seller 🚚 Ships within 48 hours! Get this amazing Dinosaur Racing Car Track Game Set and let your kids have fun while developing their cognitive skills and imagination! It features one-click deformation multi-function remote control rail car, colorful dinosaur assembly track with bridges and bridges, and more! Plus, its edges are rounded without burrs for safety. Buy now and enjoy fast delivery! After-sales commitment: If you receive the package, if there is any damage or quality problem, please contact us in time, we will replace the product or refund, so as to serve you as soon as possible!"
        },
        {
            "title": "Fun Water Console Game - Perfect Gift for Kids & Children",
            "path": "https://shopee.sg/Funny-Water-Console-Game-Toys-Gift-for-Kids-Children-i.118302359.1979251547",
            "image": "https://down-sg.img.susercontent.com/file/4aae65e2e2b51003e40e8b17f353db16",
            "price": 172000,
            "location": "Mainland China",
            "rating": 4.771428571428571,
            "sold": 17,
            "description": "Challenge your friends and family with this fun water console game! Put the button and the water force will take the ring upside to see whether you can hit the target. This game is perfect for kids and children of all ages, and will provide hours of entertainment. Comes in a random color and measures 10*5 cm. Package includes 1x Water Console Game toy. Get yours today and start playing!"
        },
        {
            "title": "Deeper Talk Deck - 150 Prompts Card Game for Intimate Conversations & Relationship Building",
            "path": "https://shopee.sg/Best-Self-Decks-Icebreaker-Deck-Deeper-Talk-Intimacy-or-WorstSelf-150-Prompts-Card-Game-i.173728060.16733763199",
            "image": "https://down-sg.img.susercontent.com/file/a8db7d8132b3b7bda946c2b40f3d1db4",
            "price": 583000,
            "location": "Mainland China",
            "rating": 4.82962962962963,
            "sold": 56,
            "description": "Upgrade your conversations and take them to the next level with the Deeper Talk Deck – the powerful tool for improving quality time and communication with others. This incredible 150-card deck has six categories designed to help you know the people in your life in a more meaningful way. From building stronger teams to sparking meaningful discussions with your friends and family, this tool will help you become a better communicator and inspire you to be your best self. Perfect for professional and personal relationship growth, this deck makes every conversation the main event and is the perfect gift for someone looking to grow relationships. Start cultivating intrinsic happiness one card at a time with the Deeper Talk Deck."
        },
        {
            "title": "High-Performance Stunt RC Car - Easy-to-Operate Remote Control",
            "path": "https://shopee.sg/High-Performance-Stunt-RC-Car-Easy-to-Operate-Remote-Control-Stunt-Car-i.489316904.22870909923",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-lhf74sl7g0z243",
            "price": 2797000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for hours of entertainment with this high-performance stunt RC car! Featuring dual-mode driving, 360-degree stunt capability, a durable design, remote control operation, and fast speeds, this car is perfect for racing and other high-speed activities. Made of premium quality materials, the car is operated with a remote control and powered by a 7.4V battery pack. With a remote control distance of up to 35M and use time of up to 20 minutes, this car is sure to provide hours of fun for the whole family."
        },
        {
            "title": "1Box Magical Smith Tarot Cards Deck Edition - 78 Card Mysterious Tarot Board Game",
            "path": "https://shopee.sg/OnlyToday-1Box-Magical-Smith-Tarot-Cards-Deck-Edition-Mysterious-Tarot-Board-Game-78-Card-i.280579681.7070780867",
            "image": "https://down-sg.img.susercontent.com/file/4129302a40d645729d99c41d574618ba",
            "price": 519000,
            "location": "Mainland China",
            "rating": 4.89,
            "sold": 3,
            "description": "Get ready to explore the mysterious world of Tarot with this Magical Smith Tarot Cards Deck Edition! This 78-card deck is perfect for beginners and tarot enthusiasts alike, featuring simple instructions and an easy-to-carry design. This full English version deck is made of high-quality paper, with each card measuring approximately 60 x 103mm. With no peeks, duplicates, etc., you can predict any thought of card and use any borrowed deck. Get yours today and start your journey of divination!"
        }
    ]
}