{
    "query": "Travel and Adventure",
    "region": "Singapore",
    "total": 931,
    "results": [
        {
            "title": "Hannibal Safari Legless Awning 2.4m - Vehicle Expedition, Camping & Overland Use",
            "path": "https://shopee.sg/Hannibal-Safari-Legless-Awning-24m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.21180005011",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvg6-lh2vjcutuyvbf0",
            "price": 169900000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next roadtrip adventure with the Hannibal Safari Legless Awning 2.4m! This awning sets up in just 30 seconds and is perfect for vehicle expeditions, camping, and overland use. It has no posts, pegs or ropes to trip over or bump into, and is self-supporting for easy setup. The awning is constructed of Polymide ripstop canvas and waterproof, \"Dynaproofed\" 380g polycotton ripstop. The outrigger frame poles are made of aluminium and the seams are double stitched and edged with binding. Installation is included in the price, so get your Hannibal Safari Legless Awning 2.4m today!"
        },
        {
            "title": "Durable & Portable Travel Bag with Multiple Pockets & USB Charging Port",
            "path": "https://shopee.sg/Portable-And-Easy-To-Clean-Luggage-For-Any-Adventure-Carrier-Travel-Bag-Bags-Multiple-Pockets-Stylish-Expandable-i.42535292.23746685121",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lik75ow4ilwz81",
            "price": 5107000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Travel in style with this durable and portable travel bag. Featuring multiple pockets and compartments for easy organization of all your essentials, a side USB charging port extension, and waterproof materials and reinforced seams for lasting use. Approximate size: 46*30*14CM/18.11*11.81*0.00inch. Available in multiple colors."
        },
        {
            "title": "Kids Visor Hat with Fan - UV Protection, Adjustable & Portable",
            "path": "https://shopee.sg/SL-Kids-Visor-Hat-with-Fan-Protection-Wide-Brim-for-Outdoor-Adventures-Summer-Hiking-Travel-and-Screen-Accessories-i.134972426.16897916621",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lie58o1t7wq7a5",
            "price": 1151000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Protect your child from the harsh rays of the sun with our kids visor hat. This hat is designed with a unique small fan design to keep your little one cool and comfortable. It is lightweight and portable, easily rolling into a compact size that can fit into any purse, backpack, or handbag. The wide brim of this visor hat provides excellent UV protection, shielding your child from harmful rays. It also features an adjustable head circumference of 46-52cm, making it perfect for both children and adults. Make outdoor adventures even more fun with this dual-function fan hat!"
        },
        {
            "title": "Everything & Everywhere: A Fact-Filled Adventure for Curious Globe-Trotters (Travel Book for Kids) - Hardcover",
            "path": "https://shopee.sg/sgstock-Everything-Everywhere-A-Fact-Filled-Adventure-for-Curious-Globe-Trotters-Travel-Book-for-Children-Kid-i.645219716.23767833374",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qves-lgqn4cn9b1fref",
            "price": 4206000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Explore the world with this fun and exciting travel book for kids! Discover unique animals, skylines and more. Everything & Everywhere is an ebullient outing for armchair travelers. Hardcover edition."
        },
        {
            "title": "GP1 JoJo's Bizarre Adventure Backpack - Unisex for Men & Women",
            "path": "https://shopee.sg/GP1-JoJos-Bizarre-Adventure-Women-Men-Backpack-Cartoon-Student-School-Bag-Computer-Outdoors-Travel-Bag-Large-Capacity-i.368313731.22274412420",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfv-ljg4izpeg5c688",
            "price": 3116000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Keep your belongings safe and secure with this JoJo's Bizarre Adventure Backpack! Crafted from durable Oxford spinning, this backpack features a flip cover and zipper opening, breathable design to reduce burden, and a stylish anime cartoon pattern. With a capacity of 20-35L, this backpack is perfect for school, computer, or outdoor travel. Get yours today and enjoy a hassle-free experience!"
        },
        {
            "title": "Rock Beach Swing - Phuket, Thailand | Adventure Attraction Tickets",
            "path": "https://shopee.sg/Phuket-Rock-Beach-Swing-Thailand-Outdoor-Scenic-Ocean-View-Adventure-Attractions-Tickets-Vouchers-Travel-Discount-Sale-i.408840252.23845213296",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvez-li2fph1zfi60a4",
            "price": 1240000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Enjoy the contrasting landscape of jagged cliffs and boulders against the turquoise waters while swinging gently or soaring through the air on the beach swing at Rock Beach Swing - Phuket, Thailand! Get your tickets now and experience an unforgettable adventure! "
        },
        {
            "title": "Wear-resistant Waterproof Portable Backpack for Outdoor Adventures Travel",
            "path": "https://shopee.sg/123-Waterproof-And-Portable-Backpack-For-Outdoor-Adventures-Travel-Travel-Backpack-Wear-resistant-i.33675962.22150398938",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qven-lk20cic16f6z64",
            "price": 1176000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "This backpack provides ample storage space for your camping and hiking essentials, crafted with waterproof and tear-resistant materials to ensure your belongings stay dry and secure in any weather conditions. Featuring a foldable design, this backpack can be conveniently folded into a compact size for easy storage. The breathable fabric and mesh provide cool and dry wearing experience, while the smooth zipping system and exquisite craft ensure easy and reliable opening and closing. Available in multi-color, this backpack measures approximately 23*21*3cm/9.06*8.27*1.18inch."
        },
        {
            "title": "High Quality Backpack Rain Cover with Reflective Strip - 10-70L",
            "path": "https://shopee.sg/Premium-Quality-Backpack-Rain-Cover-with-Safety-Reflective-Strip-Ideal-for-Travel-and-Outdoor-Adventures-10-70L-i.77514575.19789712115",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qve2-lhdv96gacf1r77",
            "price": 255000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Keep your backpack dry and safe with this high-quality backpack rain cover! Made of Oxford cloth, this waterproof cover is foldable and features safety reflective strips for better visibility. Available in sizes XS to XL, this rain cover is perfect for outdoor adventures and travel. Get yours today and enjoy a dry and safe journey!"
        },
        {
            "title": "Archaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Lightweight Bird Brand Men Women Mountaineering Travel Folding School Bag",
            "path": "https://shopee.sg/Archaeopteryx-Backpack-Oxford-Cloth-Waterproof-Sports-Outdoor-Lightweight-Bird-Brand-Men-Women-Mountaineering-Travel-Folding-School-BagAdventure-Traveler-i.1005147801.17494790535",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lha7e9i7l33uaf",
            "price": 2979000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Welcome to Adventure Traveler Store! Get this Archaeopteryx Backpack Oxford Cloth Waterproof Sports Outdoor Backpack Lightweight Bird Brand Men and Women Mountaineering Travel Folding Schoolbag. It features a solid color, zipper closure, and a 16-inch computer size. It has a water repellent performance and is made of polyester fiber for durability. Shipping takes 7-12 days. Contact us for any questions or other products you are looking for. Shop now!"
        },
        {
            "title": "JOYMEMO Global Travel Theme Birthday Decorations - Adventure Birthday Supplies with Happy Birthday Banner, Plane Bus Car Balloons & Cupcake Toppers",
            "path": "https://shopee.sg/JOYMEMO-Global-Travel-Theme-Birthday-Party-Decor-for-kids-Adventure-Birthday-Supplies-with-Happy-Birthday-BannerPlane-Bus-Car-Vehicle-Pattern-Printed-Balloons-and-Cupcake-Toppers-i.580460816.18879093775",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lfxs0xipm15i99",
            "price": 401000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 2,
            "description": "Celebrate a special occasion with this global travel themed birthday decoration set! Our set includes 1 Happy Birthday banner, 12 cupcake toppers, 1 cake topper and 18 latex balloons, all printed with various patterns of transportation including planes, buses, cars, cruise ships and travel packages. The blue and green colors symbolize rivers and oceans, mountains and forests, making for a perfect combination with the map colors. Enjoy an enjoyable party experience with these easy to assemble decorations. Best after-sales service guaranteed - contact us with any questions and we will solve them within 48 hours."
        },
        {
            "title": "IMG Worlds of Adventure Ticket - 1 Day Pass",
            "path": "https://shopee.sg/Cheapest-discounted-IMG-Worlds-of-Adventure-Ticket-i.78525603.18960942423",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e7714a1a7mjv44",
            "price": 6899000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Get your IMG Worlds of Adventure Ticket for a 1 Day Pass and enjoy unlimited rides in the world's largest indoor theme park! Step back in time with a prehistoric dinosaur experience at the Lost Valley Adventure Zone, and ramp up the thrills with roller coasters and rides based on iconic Marvel superheroes and Cartoon Network superstars. Please note that each ride has a height restriction and free admission for children who are under 1.05m in height. Opening hours: Monday-Thursday: 12:00-22:00; Friday-Sunday: 12:00-23:00. Redeem your voucher by entering the venue directly."
        },
        {
            "title": "Ridwana.id 3in1 Waterproof Adventure Backpack",
            "path": "https://shopee.sg/Ridwanaid-Tas-Ransel-Duffle-3in1-Waterproof-For-Adventure-Backpack-Travel-Latest-Casual-Style-i.358942541.22975230280",
            "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul5-ljrxy267juoy54",
            "price": 1674000,
            "location": "Indonesia",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next adventure with this stylish 3in1 waterproof adventure backpack from Ridwana.id. Made from high quality Bimo material, this backpack is available in Ashes color and comes with a length of 26 cm, width of 25 cm, and height of 44 cm. Perfect for casual and travel use, this backpack is the perfect choice for your next outdoor adventure."
        },
        {
            "title": "Large Capacity Adjustable and Breathable Backpack for Travel and Outdoor Adventure ",
            "path": "https://shopee.sg/1-Durable-And-Lightweight-Backpack-For-Travel-And-Outdoor-Adventure-Large-Capacity-And-Adjustable-Breathable-Folding-Bag-i.36503201.23249830478",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdl-ljss6p4cdt023a",
            "price": 1449000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "This foldable backpack is made of tear-resistant and waterproof material, designed with adjustable straps and multiple compartments and pockets for easy storage and organization. It is shock-proof and UV-resistant, providing long-lasting performance and a comfortable fit. The breathable back panel and shoulder straps offer added comfort during long trips, and the backpack is easy to clean after use. Available in multi-color and made of polyester, this backpack is perfect for hiking, camping, and other outdoor activities. Approximate dimensions: 41*24*16 cm/16.14*9.45*6.30inch."
        },
        {
            "title": "Water Resistant 30L Hiking Backpack for Outdoor Travel",
            "path": "https://shopee.sg/In-Stock-Water-Resistance-Hiking-Backpack-Adventure-30L-Rucksack-for-Outdoor-Travel-i.13034017.18890606913",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvey-lj0ucp8acohye0",
            "price": 1200000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Keep your gear organized and easily accessible with this Water Resistant 30L Hiking Backpack. Made from highly durable, Oxford cloth material that is abrasion-resistant, scratch-resistant, and waterproof, this backpack is perfect for hiking, camping, climbing, and other outdoor activities. It features a Molle System throughout the bag and shoulder strap for adding additional pouches and a stress point of the carrying system that is changed from the thickest part of the whole strap to the webbing on the front of the strap and the top position of the front of the backpack. Size: 43x24x20 cm/16.93x9.45x7.87 inch. Package Includes: 1 Piece Backpack."
        },
        {
            "title": "Hannibal Safari Legless Awning 1.9m - Perfect for Vehicle Expedition, Camping & Overland Use",
            "path": "https://shopee.sg/Hannibal-Safari-Legless-Awning-19m-for-Vehicle-Expedition-Camping-Overland-Use-SUV-4WD-Travel-RoadTrip-Adventure-i.1001431607.23568536202",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvew-lh2vjcutny139f",
            "price": 129900000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your next adventure with the Hannibal Safari Legless Awning 1.9m! This awning is designed for quick and easy setup, with no posts, pegs or ropes to trip over or bump into. It is self-supporting and can be set up by one person in just 30 seconds. Made with heavy duty aluminium fold out arms and Polymide ripstop canvas for superior strength, this awning is waterproof and Dyna-proofed for maximum protection against the elements. The awning also comes with installation included, so you can get ready to go on your next journey with ease."
        },
        {
            "title": "45mm Portable Handheld Mini Precision Compass | Outdoor Camping Adventure Survival Pointing Tool",
            "path": "https://shopee.sg/Road-Crazy-Travel-Safety-Accessories-45mm-Portable-Handheld-Mini-Precision-Compass-Outdoor-Camping-Adventure-Survival-Pointing-Tool-i.127249066.23207098450",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-y139y1qsd1jv83",
            "price": 164000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Get ready for your outdoor adventures with this 45mm Portable Handheld Mini Precision Compass! Perfect for camping, hiking, climbing and traveling, this compact compass is the most important tool for your daily life. Made of ABS and acrylic, this compass comes in black and measures about 45 mm in diameter. Get yours today and be prepared for any adventure!"
        },
        {
            "title": "Foldable Outdoor Backpack - Perfect for Travel and Adventure!",
            "path": "https://shopee.sg/123-Foldable-Outdoor-Backpack-For-Travel-And-Adventure-Travel-Backpack-Waterproof-Camping-Hiking-i.38293403.21582605640",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvcx-lk209cejwfx3cb",
            "price": 1176000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "Travel in style and comfort with this foldable outdoor backpack! Crafted with waterproof and tear-resistant materials, this backpack provides ample storage space for your camping and hiking essentials. Featuring a foldable design, it can be conveniently folded into a compact size for easy storage. The breathable fabric and mesh provide cool and dry wearing experience, while the smooth zipping system and exquisite craft ensure easy and reliable opening and closing. Available in multi-color. Approximate size: 23*21*3cm/9.06*8.27*1.18inch."
        },
        {
            "title": "50L and 40L Men's Mountain Bag Backpack for Hiking, Camping and Adventure",
            "path": "https://shopee.sg/Mens-Mountain-Bag-Backpack-Backpack-Jumbo-Travel-Large-Carrier-Outdoor-Hiking-Camping-Adventure-Climber-Survival-Homecoming-Walking-Back-Sling-Cool-Boys-Aesthetic-Import-Waterproof-50liter-i.1040626980.20282338924",
            "image": "https://down-sg.img.susercontent.com/file/id-11134207-7qul7-licrv99khcwm5d",
            "price": 2862000,
            "location": "Indonesia",
            "rating": 0,
            "sold": 0,
            "description": "Explore the great outdoors with this 50L and 40L Men's Mountain Bag Backpack! Perfect for hiking, camping and adventure, this backpack is made from durable Cordura nylon fabric and is waterproof to keep your gear safe and dry. The back of the bag is designed to fit comfortably against your back and is equipped with adjustable straps for easy carrying. With a large storage capacity, you can fit all your survival gear and essentials for your next outdoor adventure!"
        },
        {
            "title": "Roblox Rainbow Friends Large Capacity Backpack - School Travel & Adventure",
            "path": "https://shopee.sg/Large-Capacity-Roblox-Rainbow-Friends-Backpack-Ideal-For-School-Travel-And-Adventure-i.315440333.22145121837",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134202-23020-i8qeez41v3mve0",
            "price": 1691000,
            "location": "Mainland China",
            "rating": 0,
            "sold": 0,
            "description": "This Roblox Rainbow Friends Backpack is perfect for school, travel and adventure. Made of canvas, it is lightweight and not easy to deform, and features a large capacity with multiple compartments for sorting items. It is the perfect gift for going back to school, birthday or Christmas, and a must-have for Rainbow Friends fans. Features include a zip opening, breathability, wear-resistance, and load-reduction. Product size: 42x29x11cm/16.5x11.4x4.3in. Package includes 1x Backpack."
        },
        {
            "title": "🎁NEW🎁 BMW R1200GS LC Adventure R1250GS Motorcycle Panniers Bag Case Luggage Bags",
            "path": "https://shopee.sg/NEWNew-Waterproof-bag-Top-Box-Panniers-Bag-Case-Luggage-Bags-For-BMW-R1200GS-LC-Adventure-R1250GS-Motorcycle-F650GS-G3-i.1003462474.18089222325",
            "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdw-lhaumxeor82k2c",
            "price": 5916000,
            "location": "SG",
            "rating": 0,
            "sold": 0,
            "description": "💖This waterproof bag top box is perfect for your BMW R1200GS LC Adventure R1250GS Motorcycle. Made with 1680D PVC material, it has a large capacity and is lightweight. It comes in a set of two and is black in color. For any problems or inquiries, feel free to contact us. Get a voucher when you leave a five star rating★★★★★!"
        }
    ]
}