[
    {
        "title": "Colorful Feather Paper Bookmarks - 60 Pieces",
        "description": "Add a unique touch to your reading experience with these colorful feather paper bookmarks! Made of high quality white cardboard, these bookmarks feature a creative feather design and are perfect for keeping your book pages marked. Each bookmark measures 6x1.5 inches and can be used for a variety of purposes. Great for students, writers, and readers alike!",
        "source": "https://m.media-amazon.com/images/I/71VhmbYnjGL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 7.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BNH7Z7GT"
    },
    {
        "title": "Marimekko Kukka Notecards: Floral Stationery Collection",
        "description": "Add a touch of style to your correspondence with this Marimekko Kukka Notecards Collection. Featuring 16 cheerful floral prints in bold colors, this set of 16 notecards and envelopes is perfect for sending birthday greetings, thank-you notes, congratulations, or just to say hello. The perfect gift for Marimekko fans, vintage enthusiasts, and design, fashion, and lifestyle aficionados, these notecards are an affordable way to own some of the brand's most desirable patterns.",
        "source": "https://m.media-amazon.com/images/I/61kZqj5RAQL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 16.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1452176701"
    },
    {
        "title": "Letter-perfect Stationery with Butterfly Design",
        "description": "Make your correspondence stand out with these letter sheets featuring a beautiful butterfly and flower pattern. Each box contains 30 sheets and 24 matching envelopes, with each sheet measuring 5-3/4 in. x 7-3/4 in. Make sure to check out our other products in the Letter-perfect Stationery Series, such as matching note cards, journals, calendars, and pens.",
        "source": "https://m.media-amazon.com/images/I/91MS6nXIXNL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 11.69,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/159359254X"
    },
    {
        "title": "The Stationery Shop: A Novel",
        "description": "Immerse yourself in a powerful love story set in 1953 Tehran that explores loss, reconciliation, and the quirks of fate. Follow Roya, a dreamy, idealistic teenager, as she discovers a literary oasis in Mr. Fakhri’s neighborhood book and stationery shop. Get lost in a world of fountain pens, shiny ink bottles, and thick pads of soft writing paper. Experience a story that will stay with you long after you turn the last page.",
        "source": "https://m.media-amazon.com/images/I/91g5GTfqQZL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 14.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07L3B8RN2"
    },
    {
        "title": "4-Tier Removable Bookshelf - Book Shelf Organizer",
        "description": "Keep your books, stationery, water cups, and other items organized with this 4-Tier Removable Bookshelf. Made of PP+ABS for durability and strength, this bookshelf has two square storage partitions and two circular storage partitions. The circular storage partition can fit most bottles and glasses, while the square storage can fit pens, staplers, scissors, rulers, compasses, and remote controls. Easily move this bookshelf with its convenient vientiane pulley. Ideal for college dorms, living rooms, offices, game tables, painting tables, and more.",
        "source": "https://m.media-amazon.com/images/I/515siq3JD2L._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 45.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BRG1RS5S"
    },
    {
        "title": "A4 Ruled A-Z Index Book with Hard Glossy Front and Back Covers",
        "description": "Keep documents organised with this A4 Ruled A-Z Index Book. It features hard glossy front and back covers, a personal information page and 192 pages in total. Perfect for filing and storing important documents.",
        "source": "https://m.media-amazon.com/images/I/71GABtiTSXL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 15.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B015HFB4DO"
    },
    {
        "title": "Gold Butterfly Stationery Set",
        "description": "Make your personal correspondence extra special with this beautiful Gold Butterfly Stationery Set. Each letter sheet features a single butterfly at top with gold foil highlights and embossed details. The set comes with 30 sheets and 24 matching cream-colored envelopes, all stored in a board box with a clear acetate lid. It would make a lovely gift too!",
        "source": "https://m.media-amazon.com/images/I/81pnV6pI7qL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 10.23,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1593592523"
    },
    {
        "title": "Explore Bookstores Around the World with 100 Postcards",
        "description": "Take a tour of the literary world with these 100 full-color postcards, featuring stunning images of bookstores from around the world. From London to Tokyo, Mexico City to NYC, this box of postcards is the perfect gift for any book lover or stationery enthusiast. Each postcard is printed with a glossy finish and comes in a hinged lid box. Send a note to a fellow bibliophile and share the bookish joy!",
        "source": "https://m.media-amazon.com/images/I/818q-AoSNPL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 22.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1452177937"
    },
    {
        "title": "Amy Butler Stationery Gift Set - Flower Pattern",
        "description": "Make a lasting impression with this stylish stationery set from Amy Butler. This set includes 16 writing sheets (4 designs repeating 4 times), 16 envelopes, and 16 address labels, packaged with twine and a gift tag. Perfect for adding a touch of elegance to your handwritten correspondence and makes a stunning gift for friends and loved ones.",
        "source": "https://m.media-amazon.com/images/I/51vxNNRcYbL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 14.06,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1452107726"
    },
    {
        "title": "Multi-Functional Pencil Case with Large Capacity",
        "description": "This multi-functional pencil case is perfect for storing all your office supplies. It is made of durable high density oxford and features one main pocket with zipper closure, one mesh pocket on the top, and one removable middle compartment with 40 pen slots. It is large enough to fit erasers, staplers, clips, pencils, crayons, erasers, pens, pencils, rulers and more. It is suitable for adults and students alike and is a great birthday or graduation gift.",
        "source": "https://m.media-amazon.com/images/I/71-gOjwkrVL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 12.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0B24NDHZS"
    },
    {
        "title": "Molang Rabbit Sticker Set - Cute Bunny Rabbit Character Decals for DIY Decorations",
        "description": "Add a touch of cuteness to your DIY decorations with this Molang Rabbit sticker set. The set includes 6 sheets with a variety of designs featuring the Molang Rabbit character. Perfect for personalizing laptops, bedrooms, cars, envelopes, scrapbooks, and more. Made from premium material, these stickers stick to almost any surface and easily remove. A great gift for kids and adults alike, these stickers are sure to bring a smile to anyone's face. 100% satisfaction guaranteed.",
        "source": "https://m.media-amazon.com/images/I/71VhH+A7CKL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 5.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B01M7RCABY"
    },
    {
        "title": "The Stationery Shop of Tehran - Fountain Pens, Ink Bottles & Writing Paper",
        "description": "Get your writing supplies from the Stationery Shop of Tehran. This set includes fountain pens, ink bottles, and thick pads of writing paper. Perfect for those who love literature from all over the world, this set is sure to bring a touch of nostalgia to your writing projects. Enjoy the timeless elegance of the writing instruments from the Stationery Shop of Tehran.",
        "source": "https://m.media-amazon.com/images/I/81oi3hmPF7L._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 12.8,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/147118501X"
    },
    {
        "title": "Coloring Book Assortment - Stationery",
        "description": "Get creative with this coloring book assortment! Perfect for all ages, this set of stationery includes 12 coloring books that feature a variety of Bible stories. Get creative and have fun with this great set!",
        "source": "https://m.media-amazon.com/images/I/81mqbAhd+-L._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 16.94,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B08CS4BM2Z"
    },
    {
        "title": "Comic Book Activity Pad - Create Your Own Comic",
        "description": "Create your own comic with this Comic Book Activity Pad! Includes tools to create your comic, pre-printed panels, stencils and hints. Made of paper. Product dimensions: 5\" x 7\". 52 pages.",
        "source": "https://m.media-amazon.com/images/I/914hhKFj0JL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 8.39,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07QF9ZDLK"
    },
    {
        "title": "Miracles of Jesus Coloring Book",
        "description": "An educational and creative activity book featuring the miracles of Jesus. Includes 12 coloring books with various designs. Perfect for kids and adults alike.",
        "source": "https://m.media-amazon.com/images/I/71oD2I93AOL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 11.71,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07QGH1LWN"
    },
    {
        "title": "Gold Butterfly Stationery Set ",
        "description": "Enjoy the fine art of letter-writing with this beautiful Gold Butterfly Stationery Set. Each crisp letter sheet features a single butterfly at top, gleaming with gold foil highlights and raised embossing for added dimension. The set comes with 30 sheets and 24 coordinating cream-colored envelopes, all housed in a board box with a clear acetate lid. A perfect gift for someone special! Sheet size: 5-3/4\" x 7-3/4\".",
        "source": "https://m.media-amazon.com/images/I/81pnV6pI7qL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 10.23,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1593592523"
    },
    {
        "title": "Genuine Leather Journal Writing Notebook - Handmade Craftsmanship",
        "description": "Crafted with genuine leather, this rustic brown journal offers a soft touch exterior with natural, distressed look. Perfect for use as an appointment book, daily journal, sketchbook, or travel diary. Features 120 sheets of 100gsm weight, 6.5 mm ruled, 2-sided kraft paper that fits most pens. Compact size of 7.5” x 5.5”, perfect for carrying when travelling or in daily life. Makes a timeless gift for an anniversary, birthday, graduation or any special occasion.",
        "source": "https://m.media-amazon.com/images/I/71ZxNhzVOaL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 24.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07FS3SPCV"
    },
    {
        "title": "Monolike Art Gogh & Monet Postcards - 24 Pack",
        "description": "Get creative with this 24-pack of postcards featuring famous paintings from artists such as Monet and Gogh! Each postcard has a unique design, blank back (except for a small logo) and measures 3.86 inches by 5.83 inches. Choose a postcard based on your mood and express yourself with style!",
        "source": "https://m.media-amazon.com/images/I/71c8qmnSrTS._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 12.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0972PVKYM"
    },
    {
        "title": "Rifle Paper Co. Botanical Social Stationery Set",
        "description": "Add a touch of style to your stationery collection with this Rifle Paper Co. Botanical Social Stationery Set. Featuring gold foil accents and full-color designs on the back, this set includes 12 cover-weight flat notes with four different designs and envelopes. Perfect for thank-you notes, greetings, and everything in between, this trendy stationery set is made with high-quality materials and unique hand-painted designs by Rifle Paper Co. co-founder Anna Bond. Make the world more colorful with Rifle Paper Co. and bring beauty to the everyday.",
        "source": "https://m.media-amazon.com/images/I/81ARhCONBwL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 19.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B08GHC5839"
    },
    {
        "title": "LOL Dolls Diary and Pen Set Bundle",
        "description": "Keep your secrets safe with this adorable LOL Dolls diary and pen set bundle! This set includes a mini diary journal with 60 pages, a real padlock and key, a LOL Dolls pen with a fuzzy top, and bonus animal stickers and a cute cat door hanger. Perfect for all LOL fans, this diary and pen set will provide hours of fun and creativity. Officially licensed LOL merchandise.",
        "source": "https://m.media-amazon.com/images/I/81F4ZI12ukL._AC_UL320_.jpg",
        "categories": [
            "Books and Stationery"
        ],
        "price": 11.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B08YBVX1LX"
    }
]