[
    {
        "title": "Metal Hair Bands - 5 Styles",
        "description": "Upgrade your hairstyle with these metal hair bands! These bands are made of high quality metal and come in 5 styles, perfect for long, curly and straight hair. The bands are elastic and adjustable to fit any size head, and the rubber sleeve at the end prevents headaches from prolonged wear. Get creative with your hair and try out different styles with these metal hair bands!",
        "source": "https://m.media-amazon.com/images/I/71c1Y+V-GmL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 6.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0C2TLZXPB"
    },
    {
        "title": "BEAYFILY Pearl Hairbands",
        "description": "Enhance your style with these beautiful and stylish pearl hairbands from BEAYFILY. Made of artificial pearls, alloy and rhinestone, these hairbands are strong and durable, perfect for any occasion. With a diameter of 13.8 cm/ 5.4 inches, these hairbands are gentle and comfortable and help to minimize snags and reduce breakage. A great gift for any occasion, these hairbands are sure to enhance any look.",
        "source": "https://m.media-amazon.com/images/I/718gK6VF9gL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 7.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B09LS59HHH"
    },
    {
        "title": "Sparkly Rhinestone Headbands for Women and Girls",
        "description": "Add a touch of glamour and sparkle to your look with these stylish and elegant rhinestone headbands. Handmade with sparkling crystal rhinestones and soft velvet fabric, these headbands feature a comfortable anti-slip lining that won't irritate your skin. Perfect for any occasion, these headbands make a great gift for friends, family, and loved ones. Approx. 13 cm/5.2 inches in width, these headbands are flexible and fit comfortably on your head. Please be careful not to pull too hard as it may damage your hair.",
        "source": "https://m.media-amazon.com/images/I/81KJ1bQKE2L._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 11.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BRNBWM9W"
    },
    {
        "title": "Fashion & Handbag Coloring Book",
        "description": "Get creative with this ultimate coloring book for fashion and handbag lovers! Enjoy coloring over 30 famous it-bags, from Classics to the latest must-haves, and learn something new with the bag story provided for each page. This coloring book features 26 large bag coloring pages and 5 details street style pages with a girl wearing a trendy bag. Printed on one-sided, high-quality line art images, this 8.5x11\" coloring book is perfect for relaxing and unwinding.",
        "source": "https://m.media-amazon.com/images/I/614kTLXgqZL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 7.9,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B091F5QPHN"
    },
    {
        "title": "20th Century Fashion Accessories",
        "description": "This book is the most comprehensive record ever published of fashion accessories throughout the twentieth century. It covers every kind of high-fashion male and female accessory for both day and evening wear, including hats and caps, shoes, bags and purses, umbrellas and parasols, jewelry, scarves, stoles, and capes, gloves and belts, cravats, ties, and bow-ties. With more than 2000 full-color drawings and a comprehensive bibliography, this book is the definitive reference work on twentieth-century accessories for fashion enthusiasts, historians, and collectors.",
        "source": "https://m.media-amazon.com/images/I/71ecLtwUCpL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 28.58,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/0500019975"
    },
    {
        "title": "Keep Straps Hidden & Secure with Hollywood Fashion Secrets Convertible Clips",
        "description": "Keep pesky straps hidden and prevent them from slipping with Hollywood Fashion Secrets Bra Converting Clips! Durable and reusable, these non-slip clips create instant lift and cleavage while lengthening and converting any bra to a cross back style in seconds. Great value for money and comes in 3 colors with contemporary design. Perfect for wearing racer back, sleeveless or tank tops. Get the same look as your favorite Hollywood stars with stylist secret weapons from Hollywood Fashion Secrets!",
        "source": "https://m.media-amazon.com/images/I/61ly986NxrS._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 9.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B005WU4YPA"
    },
    {
        "title": "Hair Claw Clips - Flower Design",
        "description": "Add a touch of elegance to your hair with these beautiful Hair Claw Clips. Crafted with high-quality alloy and premium spring, each clip is handmade with exquisite design and attractive colors. Perfect for women with long, thick, straight, curly or wavy hair, the clips come in 6 different shapes and colors, making them ideal for all hairstyles and hair colors. These clips are the perfect accessory for any occasion, from weddings to shopping trips. Keep your hair neat and tidy with these Hair Claw Clips.",
        "source": "https://m.media-amazon.com/images/I/71+8cdBFpyL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 14.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BYSG6XYC"
    },
    {
        "title": "Women's PU Leather Belt with Chunky Buckle",
        "description": "Add a touch of style to any outfit with this PU Leather Belt with Chunky Buckle! This belt features an elastic band with 70% Polyester and 30% Spandex, a classic buckle fastening for easy wear and removal, and four holes to adjust the length for the perfect fit. Dry clean only.",
        "source": "https://m.media-amazon.com/images/I/71PcJ2yE9dL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 14.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B073535TX8"
    },
    {
        "title": "SOJOS Unisex Metal Frame Plastic Lens Sunglasses",
        "description": "Protect your eyes from the sun with these stylish unisex sunglasses. Featuring a metal frame and plastic lenses with non-polarized UV protection coating, these sunglasses are sure to keep your eyes safe and looking great. Lens width: 56mm, Lens height: 43mm.",
        "source": "https://m.media-amazon.com/images/I/61FhIaBH5vL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 14.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B092M932Z6"
    },
    {
        "title": "Nine West Women's Watch",
        "description": "Domed mineral crystal lens; marbleized dial with rose gold-tone hands and markers. Lavender rubberized adjustable link bracelet; fold over clasp with double push-button safety. Japanese-quartz movement. Case diameter: 40 millimeters. Not water resistant.",
        "source": "https://m.media-amazon.com/images/I/715qxRKScOL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 22.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07MZ6TBWX"
    },
    {
        "title": "Spa Headband and Wristband Set",
        "description": "Get ready for a comfortable and stylish skincare routine with this spa headband and wristband set! This set is made of quality coral fleece and sponge lining, providing great water absorption. It has a grwm water absorption function and can be used when you are washing your face, skincare or makeup. The headband size is 7.08*6.69*1.37 inch and the wristband size is 3.5*3.5*2 inch. It is highly flexible and stretchable so it can be worn by almost anyone. Look cute even while washing your face with this fashionable and unique set! It is the perfect gift for any special occasion.",
        "source": "https://m.media-amazon.com/images/I/81RYZoH9vHL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 8.48,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BX7SS3J5"
    },
    {
        "title": "Women's Fashion Headbands - 4 Value Packs ",
        "description": "Add a stylish touch to your look with these 4 value packs of fashion headbands for women. Made of polyester and spandex fabric, these wide headbands are soft, comfortable, and sweat-wicking for all-day comfort. With great elasticity to fit most head sizes, these headbands measure approx 5.5'' in width and 9.45'' in length and can be stretched up to 15.75''. Wear them with the bow part in the front or the wider part in the back to complete your look for any occasion.",
        "source": "https://m.media-amazon.com/images/I/81nw2zeWiYL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 11.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0C622SYSX"
    },
    {
        "title": "Polyester Fabric Headbands",
        "description": "These stylish and comfortable headbands are perfect for any occasion. Made from polyester fabric with great elasticity, softness and breathability, these headbands provide a secure fit and won't slip off. The extra wide turban head bands are 7*9 inches and can be stretched to 14 inches, making it suitable for all head sizes. Choose from 8 different colors and add a unique flair to your look. Perfect for casual wear, workout, or special occasions.",
        "source": "https://m.media-amazon.com/images/I/71gj6DDbtUL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 19.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BTY3NH5N"
    },
    {
        "title": "GRACE KARIN Elastic+Polyurethane Leather Belt",
        "description": "Elastic+Polyurethane Leather construction for comfort and durability. Button and snap closure for easy on and off. Dry cloth clean. Lace-up wide elastic belt for a secure fit. Perfect for adding a vintage touch to your outfit.",
        "source": "https://m.media-amazon.com/images/I/81gfwynJf9L._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 15.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07VYQ1QS4"
    },
    {
        "title": "SOJOS Unisex Sunglasses",
        "description": "Stylish unisex sunglasses featuring a metal frame and polycarbonate lenses with non-polarized and UV protection coating. Lens width: 51 millimeters, Lens height: 51 millimeters. Imported.",
        "source": "https://m.media-amazon.com/images/I/6131E4WFXYL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 12.79,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07BPXR3MR"
    },
    {
        "title": "Boho Headbands for Women",
        "description": "Look stylish and charming with these classic headbands for women's hair. Featuring a twist knot design, these headbands are made from ribbed knitting for a soft, non-slip, comfortable, and breathable feel. Perfect for any occasion, from daily life to birthdays and weddings. Available in 8 assorted colors so you can match your most outfits. Stretchy and fits up to 10.6\". Get your chic 90s style now!",
        "source": "https://m.media-amazon.com/images/I/71xweTWjdpL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 16.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BYD4VVDB"
    },
    {
        "title": "Women's Denim Jacket",
        "description": "Crafted from a blend of 72% Cotton, 27% Polyester, and 1% Spandex, this classic denim jacket is perfect for any occasion. Featuring a button closure and a distressed look, it's comfortable and stylish. Available in multiple colors, this jacket is sure to be a wardrobe staple.",
        "source": "https://m.media-amazon.com/images/I/81558nIJf5L._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 45.97,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B09R7J3VY7"
    },
    {
        "title": "Gothic Waist Belt with Buckle Closure",
        "description": "This stylish Gothic Waist Belt is made of PU Faux Leather, making it soft, durable and adjustable. It features a buckle closure and elastic at the back for a perfect fit. The classic black design adds a bold edge to any outfit, making it perfect for festivals, events, clubs and more. Dry cloth cleaning is recommended.",
        "source": "https://m.media-amazon.com/images/I/51l-gCszF3L._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 18.86,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B09YH96M34"
    },
    {
        "title": "Elastic Wide Waist Belt Corset Cinch Belt",
        "description": "This stylish Elastic Wide Waist Belt Corset Cinch Belt is perfect for any occasion. Crafted from floral lace fabric with a press-button closure in the back, it features a corset lacing style in the front for an elegant look. The well-elastic elastic band ensures a comfortable fit. Hand wash only. Please refer to our size chart picture before ordering.",
        "source": "https://m.media-amazon.com/images/I/81atHyteE5L._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 14.39,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B077RQWDTY"
    },
    {
        "title": "Stylish and Elegant Knot Headband",
        "description": "Get a fashionable and romantic look with this stylish and elegant knot headband. It is made up of four different styles including velvet pearl headbands and knitted headbands. The built-in elastic plastic headband with a thoughtful inset design and a lovely cross knot design creates an elegant and charming style that is perfect for work, taking pictures, dating, dance parties, weddings, and concerts. The perfect size of 6.7 inches in height and 5.5 inches in width makes it comfortable to wear and easier to fix the hair. It is also a great gift for any occasion. Buy now and enjoy the best service from Tyfthui!",
        "source": "https://m.media-amazon.com/images/I/81pZlSEenZL._AC_UL400_.jpg",
        "categories": [
            "Fashion and Accessories"
        ],
        "price": 11.19,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BV2VBZHB"
    }
]