[
    {
        "title": "Gourmet Cheese Board Gift Set",
        "description": "Treat your friends and family to a delicious gourmet cheese board gift set. This 8-piece set includes a cheese board, a cheese knife, a cheese fork, a cheese spreader, a cheese slicer, and three cheese markers. Perfect for entertaining, the set comes in an attractive gift box, making it an ideal gift for any occasion.",
        "source": "https://m.media-amazon.com/images/I/71g44uA1nPL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 37.86,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B00FY43IJ2"
    },
    {
        "title": "Father's Day Delight - Gourmet Biscotti Gift Basket",
        "description": "Celebrate Father's Day with a special gift basket full of delicious gourmet biscotti cookies, chocolate-covered cookies, and chocolates. This delightful gift basket is sure to please all the special fathers in your life, including dad, grandpa, husband, papa, uncle, and boyfriend. Perfect for any occasion, this delicious food gift basket will make a lasting impression.",
        "source": "https://m.media-amazon.com/images/I/81DLtyK7KoL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 14.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07Q8DTKR9"
    },
    {
        "title": "Gourmet Gift Basket by Wine Country",
        "description": "Indulge in a luxurious gourmet experience with this premium gift basket from Wine Country. Filled with an assortment of gourmet treats, this basket is sure to impress! Enjoy a selection of delicious snacks, chocolates, and other treats, perfect for any special occasion. The perfect gift for any foodie, this basket is sure to delight.",
        "source": "https://m.media-amazon.com/images/I/81KOMgvYmGL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 84.87,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B00LUK2TGC"
    },
    {
        "title": "Father's Day Biscotti Gift Basket: 12 Chocolates & Cookies",
        "description": "Delight your dad, grandpa, husband, papa, uncle, or boyfriend this Father's Day with a special gift basket of 12 delicious chocolate-covered cookies and biscotti. These gourmet treats are the perfect edible gift idea for any occasion and are sure to be a hit with the special man in your life. Comes in a decorative gift box.",
        "source": "https://m.media-amazon.com/images/I/91oCs4AGh2L._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 27.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0081BE3E4"
    },
    {
        "title": "Dan the Sausageman's Gourmet Gift Basket",
        "description": "Indulge in a gourmet experience with Dan the Sausageman's Gift Basket! Enjoy a delicious selection of Smoked Beef Summer Sausage, Specialty Mustard, Onion & Pepper Relish, 100% Wisconsin Cheese, and Artichoke Lemon Pesto Spread. Perfect for any occasion, this gift basket is sure to be a hit!",
        "source": "https://m.media-amazon.com/images/I/81yHJ7SkfjS._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 54.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B08W1M1ZVS"
    },
    {
        "title": "Dried Fruit Gift Basket - Healthy Gourmet Snack Box",
        "description": "Delicious and healthy gift basket filled with a variety of dried fruits, including mango slices, apricots, yellow peaches, pears, apple wedges, dates, kiwi, plums, and prunes. Comes with a foldable wooden tray that can also be used as a trivet, cutting board, or fruit bowl. Star-K Kosher, Vegan, Halal, Dairy-Free, and Gluten Free. Perfect for any occasion or holiday, including as a thank you gift, a token of sympathy, or simply to show someone you care.",
        "source": "https://m.media-amazon.com/images/I/71baxHB-fYL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 37.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07CHSN691"
    },
    {
        "title": "Gourmet Food Gift Basket by Wine Country Gift Baskets",
        "description": "Enjoy the delicious assortment of gourmet snacks and tea with the Bon Appetit Gift Basket. Perfect for any occasion, this gift basket is sure to make your gift-giving even more thrilling and extra delicious. With over 30 years of experience, Wine Country Gift Baskets is the perfect choice for creating memories. Personalized messages are also available to share your customized sentiments.",
        "source": "https://m.media-amazon.com/images/I/81BShW1uP2L._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 54.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B00BY78O7Y"
    },
    {
        "title": "Delicious Father's Day Gift Basket with Chocolate, Caramel and Crunch",
        "description": "Treat your dad to a delicious surprise with this gift basket filled with chocolate, caramel and crunchy treats. Perfect for Father's Day, business, corporate, friends and family, this gift basket is sure to leave a lasting impression. Enjoy a variety of flavors and textures with this unique combination of treats.",
        "source": "https://m.media-amazon.com/images/I/81-7WGe7ZYL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 42.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B004D9XYWU"
    },
    {
        "title": "Gourmet Mixed Nuts Gift Basket in Reusable Wooden Tray",
        "description": "Enjoy the perfect combination of nut varieties in our Gourmet Mixed Nuts Gift Basket! This beautifully arranged gift basket comes in a reusable wooden tray and is adorned with a green ribbon. It's the perfect gift for any occasion! This 12-assortment food bouquet platter is a healthy, Kosher snack box that's suitable for both men and women. Enjoy the freshness and quality of our nuts, delivered right to your door!",
        "source": "https://m.media-amazon.com/images/I/A120J1cx-EL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 41.29,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07KGFNHWY"
    },
    {
        "title": "Premium Chocolate Gift Basket with Gourmet Candy and Snacks",
        "description": "Surprise your special someone with this luxurious chocolate gift basket. Filled with an assortment of gourmet chocolates, candy, and snacks, this gift basket is sure to delight. Perfect for birthdays, anniversaries, corporate events, or any special occasion. Enjoy a selection of carefully chosen treats that make for the perfect gift.",
        "source": "https://m.media-amazon.com/images/I/71S5KGhEo9L._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 42.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07K38QBKQ"
    },
    {
        "title": "Wisconsin Cheese & Sausage Gift Basket - Gourmet Food Sampler for Entertaining or Gifting",
        "description": "Enjoy the best of Wisconsin's finest with this gift basket! Featuring 100% Wisconsin cheeses, smoked summer sausages, and assorted crackers, this sampler is perfect for entertaining, charcuterie boards, birthday gifts, thank you gifts, and business gifts. Gourmet gifts delivered, perfect for family and friends! Includes an assortment of Wisconsin's finest cheeses, smoked summer sausages, and crackers.",
        "source": "https://m.media-amazon.com/images/I/818TjdgK5QL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 64.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B014FR2F92"
    },
    {
        "title": "Nut Cravings Gourmet Collection - Assorted Dried Fruits & Nuts Gift Basket",
        "description": "Indulge in this delicious assortment of dried fruits and mixed nuts with this Nut Cravings Gourmet Collection Gift Basket. This gift basket includes 12 different assortments of dried fruits and mixed nuts, and is presented in a black tower with a ribbon. Perfect for birthdays, care packages, or just to enjoy as a healthy, Kosher snack. Enjoy this delicious treat today!",
        "source": "https://m.media-amazon.com/images/I/81X1OIJiEFL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 54.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07KBCX5GQ"
    },
    {
        "title": "Italian Gourmet Food Gift Basket - Penne Pasta & Marinara Sauce",
        "description": "Enjoy the classic flavors of Italian cuisine with this Italian Gourmet Food Gift Basket! This package includes Penne Pasta and Marinara Tomato Pasta Sauce, both of which are made with premium durum wheat semolina and created by skilled local Italian artisans. The pasta and sauces are imported from Sicily- Italy and are 100% natural, non-GMO, with no additives or preservatives. Perfect for any holiday, birthday, or special occasion, this Italian Gourmet Food Gift Basket is sure to please!",
        "source": "https://m.media-amazon.com/images/I/61aQ1jatoyL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 16.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0BLHT7P6Q"
    },
    {
        "title": "Gourmet Gift Basket by Wine Country Gift Baskets",
        "description": "Enjoy a selection of sweet and savory treats with this gourmet gift basket. Perfect for any occasion, this basket is filled with gourmet cookies, crackers, and more. Hand-assembled in the USA with high-quality, brand-named ingredients, this is sure to make a lasting impression. Personalize your gift with a free personalized gift message. With over 30 years of experience in creating gift baskets, Wine Country Gift Baskets is sure to make your special occasion even more memorable.",
        "source": "https://m.media-amazon.com/images/I/91yDj-BAmjL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 59.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B009LHPM2Y"
    },
    {
        "title": "Gourmet Food Gift Basket",
        "description": "Delight your loved ones with this delicious gourmet food gift basket. Filled with a variety of treats, this gift basket is sure to please. Includes an assortment of snacks and goodies from the Golden State of California. Perfect for any occasion.",
        "source": "https://m.media-amazon.com/images/I/81R9vA38KPL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 60.23,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B013I733XW"
    },
    {
        "title": "Wisconsin Cheese Deluxe Assortment Gift Basket",
        "description": "Enjoy the best of Wisconsin cheese in this deluxe gift basket! Featuring premium cheddar cheese, crackers, pretzels and mustard, this is the perfect gift for any cheese lover. Enjoy this delicious assortment of snacks for birthday, thank you, or any special occasion.",
        "source": "https://m.media-amazon.com/images/I/71WYfeT+m+L._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 64.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B01KF722US"
    },
    {
        "title": "Nut Cravings Gourmet Collection - Dried Fruit & Mixed Nuts Gift Basket",
        "description": "Delight your friends and family with this delicious gift basket of Dried Fruit & Mixed Nuts. Enjoy 12 assorted varieties of healthy and Kosher snacks in a beautiful white and gold box. Perfect for birthdays, special occasions, or just because! Enjoy a guilt-free snack for a healthy and tasty treat.",
        "source": "https://m.media-amazon.com/images/I/91GhoDD0zOL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 33.39,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B07K8RCCB9"
    },
    {
        "title": "Gourmet Chocolate Food Gift Basket Tower - Sweet and Savory Treats for Birthdays",
        "description": "Send your best wishes with this Gourmet Chocolate Food Gift Basket Tower. This curated snack box is filled with an assortment of cookies, popcorn, snack mix, toffees and more. Perfect for birthdays, parties, and special occasions. Each gift is created and curated by our designers and assembled by experts. Topped with a hand-tied bow or ribbon for a memorable gift. Certified Kosher, this gift tower measures 6\" x 6\" x 12\" and includes boxes or a basket that can be repurposed. Shop with confidence and enjoy a 100% satisfaction guarantee.",
        "source": "https://m.media-amazon.com/images/I/81+ljLDsMJL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 24.41,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B00VN76CII"
    },
    {
        "title": "Hickory Farms Beef Summer Sausage & Cheese Gift Box | Gourmet Food Gift Basket",
        "description": "DELICIOUS TREAT – Enjoy the savory combination of Hickory Farms Signature Beef Summer Sausage, Smoked Gouda Blend, Mission Jack Blend, and Smoked Cheddar Blend cheeses, all paired with Golden Toasted Crackers. Perfect for any occasion like birthdays, congratulations, corporate gifting, or just to let someone know you’re thinking of them.",
        "source": "https://m.media-amazon.com/images/I/81JL5zdPMfL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 59.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B071GCYG42"
    },
    {
        "title": "Gourmet Nut Gift Basket in Reusable Wooden Crate",
        "description": "Give the perfect gift with this gourmet nut gift basket! This healthy gift option is filled with unique flavors of nuts, making it a great way to show you care. The reusable wooden crate makes this gift basket a great choice for any occasion, from birthdays to get-well wishes. Treat yourself or someone special to this delicious snack food box today!",
        "source": "https://m.media-amazon.com/images/I/71sIF1KqmeL._AC_UL400_.jpg",
        "categories": [
            "Food and Gourmet Gifts"
        ],
        "price": 33.5,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B0861QZN6C"
    }
]