[
    {
        "title": "Epic Journeys: Explore Life-Changing Adventures",
        "description": "Discover the world's best adventures with National Geographic's stunning and practical treasury. From rafting the Zambezi River's rapids to hiking the Inca trail, explore over 225 destinations for hikers, skiers, divers, rafters and more. Be inspired by over 300 vivid photographs, top ten lists and adventurer essays covering the best hiking trails and wildlife parks. Find out what to see, when to go and what to do for the ultimate epic journey. Combining adventure with cultural experiences, this one-of-a-kind collection will lead you to new heights of exploration.",
        "source": "https://m.media-amazon.com/images/I/91lpjF5KYPL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 20.98,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1426220618"
    },
    {
        "title": "California Bucket List Adventure Guide & Journal",
        "description": "Explore the beauty of California with this comprehensive guide and journal! This guide and journal contains 50 must-see destinations in California with detailed descriptions and photos to help you plan your adventure. With a dedicated journal section, you can log your experiences and memories from your travels. Start your journey today and explore the wonders of California!",
        "source": "https://m.media-amazon.com/images/I/71+KWxhHWGS._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 15.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1955149151"
    },
    {
        "title": "Alex Hawk Time Travel Adventure - Book 1",
        "description": "Take an extraordinary journey with Alex Hawk as he discovers a mysterious door into time! Follow Alex as he discovers secrets from the past and embarks on a thrilling adventure. This book is the first in the Alex Hawk Time Travel Adventure series, a captivating story of discovery and adventure. Perfect for readers of all ages!",
        "source": "https://m.media-amazon.com/images/I/91Kodz8bTWL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 10.50,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B08FBMM41L"
    },
    {
        "title": "Marco Polo: His Travels and Adventures",
        "description": "Follow Marco Polo on his thrilling adventures across Asia to the court of Kublai Khan. This edition of Marco Polo's travels is presented complete and unabridged, with larger text for easier reading by younger readers. It includes all the original illustrations and decorations, along with a preface by the author. Follow Marco Polo on his epic journey and discover the historical and cultural significance of his travels.",
        "source": "https://m.media-amazon.com/images/I/81HxGn50o8L._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 10.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1925729222"
    },
    {
        "title": "Tennessee State Parks Trip Planner & Outdoor Adventure Log List Guide | Travel Log & Memory Journal | America Passport & Stamp Book",
        "description": "Get ready to explore the great outdoors with this Tennessee State Parks Trip Planner and Outdoor Adventure Log List Guide! This travel log and memory journal is the perfect companion for your next outdoor adventure. It includes a passport and stamp book, so you can track your progress as you visit each of the 56 designated parks in the Tennessee Park System. Whether you're looking to relax on a beach, go horseback riding, snowmobiling, or hunting, this book will help you make the most of your journey.",
        "source": "https://m.media-amazon.com/images/I/719ULB9fyTL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 8.49,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/B09KN81NZF"
    },
    {
        "title": "Explore Washington: An Adventure Guide to 100 Must-Visit Destinations",
        "description": "Explore Washington and discover its many must-visit destinations! From the Channeled Scablands and the Selkirk Range to the majestic Mount Rainier, Washington is full of breathtaking natural wonders that will leave you speechless. This guidebook will help you uncover the best of the Evergreen State and create a memorable journey that you will cherish for years to come.",
        "source": "https://m.media-amazon.com/images/I/71FRS8-AfBL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 14.89,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1957590009"
    },
    {
        "title": "Route 66 Adventure Handbook: High-Octane Fifth Edition",
        "description": "Explore the vanishing American roadside with the Route 66 Adventure Handbook. This updated and expanded fifth edition includes magnificent architecture, natural wonders, Art Deco masterpieces, vintage motels and cafes, unique museums, offbeat attractions, fascinating artifacts, and kitschy tourist traps. City maps showing the multiple paths of Route 66 and displaying the exact locations of points of interest are included, as well as hundreds of beautiful photographs and GPS coordinates for virtually all of the photos. Discover all the exuberance, splendor, and absurdity of Route 66 with this comprehensive guide.",
        "source": "https://m.media-amazon.com/images/I/71vnqjAPlyL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 12.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1595800913"
    },
    {
        "title": "Travel the World Without Worries: An Inspirational Guide to Budget and Adventure Travel",
        "description": "Make your dream of travelling the world a reality with this inspirational guide to budget and adventure travel. Packed with in-depth advice and tips on how to properly plan, pack and prepare for your journey, this book will be your trusted companion as you explore the world. Whether you’re planning a short getaway or an extended stay, this book will help you travel with confidence.",
        "source": "https://m.media-amazon.com/images/I/61zcDrhzLNL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 18.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/179348306X"
    },
    {
        "title": "Explore the World with Confessions of a Middle-Aged Runaway",
        "description": "Take a journey of self-discovery with Heidi Eliason as she embarks on a five-year, motorhome road trip with her dog, Rylie. Experience the challenges, fears and insecurities she faced as she chased the corporate ladder and storybook romance. Learn how she found a new community of friends, met wildlife, traveled the Baja Peninsula, discovered the magic of the sea, and experienced freedom like never before. Whether you're looking for an alternative lifestyle or just a break from the routine, this book is sure to inspire you to take a leap of faith and explore the world.",
        "source": "https://m.media-amazon.com/images/I/711Z-56Bs-L._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 13.29,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1733641009"
    },
    {
        "title": "Explore Florida's State Parks",
        "description": "Discover the beauty of Florida's incredible state parks! This comprehensive guidebook covers the entire Florida State Park system, with information on where to hike, camp, snorkel, scuba dive, boat, and more. Whether you're seeking underwater coral reef gardens, stunning orchid blooms, or the playgrounds of panthers, painted buntings, and manatees, you'll find them within the pages of this guidebook. Explore the best of Florida's natural and historical parks, preserves, and recreational areas with this must-have guidebook!",
        "source": "https://m.media-amazon.com/images/I/51efhN5tv1L._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 19.95,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/0898867312"
    },
    {
        "title": "Motley Map 6x9 Lined Journal - Perfect for Recording Memories and Adventures",
        "description": "Capture your life's adventures and memories with this beautiful 6x9 lined journal featuring a vintage Motley Map design. This journal is perfect for recording your travels, new relationships, a new baby, new job, and all of your first time adventures. It makes a thoughtful and useful gift for world travelers, teachers, new moms and dads, newlyweds, and graduates. The journal measures 6\"x9\" and fits easily in a backpack, tote bag, or handbag.",
        "source": "https://m.media-amazon.com/images/I/81aZLIkHjsL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 6.99,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1091394768"
    },
    {
        "title": "United States Northeast Adventure Map",
        "description": "Explore the Mid Atlantic and New England regions with this waterproof and tear-resistant map. This detailed map features the states of Virginia, West Virginia, Maryland, Delaware and Pennsylvania, New York and New Jersey, Connecticut, Rhode Island, Massachusetts, Vermont, New Hampshire, and Maine. Discover cities like Washington DC, Philadelphia, New York City, and Boston, as well as historic seaports, beautiful parks, beaches, marshes, and bays including Chesapeake and Delaware Bays. Explore the Adirondack Mountains of New York, the White and Green Mountains of New Hampshire and Vermont, and the rolling Allegheny and Pocono Mountains of Pennsylvania. Perfect for outdoor adventures and small town exploration.",
        "source": "https://m.media-amazon.com/images/I/81KAIY7NWpL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 13.46,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1566957214"
    },
    {
        "title": "Mission Rome: A Scavenger Hunt Adventure for Kids",
        "description": "Take your kids on an exciting and educational journey through the Eternal City with Mission Rome! Enjoy a memorable family vacation as your young explorers learn and discover the wonders of Rome through a fun scavenger hunt. Ideal for kids of all ages, this travel guide will ensure your young travelers get the most out of their incredible opportunity to experience Rome.",
        "source": "https://m.media-amazon.com/images/I/71nWya2i5gL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 12.97,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/098922676X"
    },
    {
        "title": "The Baron Trump Collection - Adventures and Time Travel",
        "description": "Get ready to be taken on an adventure through time and space with Baron Trump and his faithful companion Bulger. This collection brings together the classic Baron Trump adventure stories in one volume. Travel through the ages and explore exotic lands with Baron Trump as he navigates various obstacles and meets societies from long ago. Whether you're a fan of classic adventure stories or just looking for a fun read, this collection is sure to provide hours of entertainment.",
        "source": "https://m.media-amazon.com/images/I/81lOEfMWK4L._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 12.98,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/1789870003"
    },
    {
        "title": "Indiana State Parks Guidebook",
        "description": "Get the most out of your outdoor adventures with this complete guidebook to Indiana State Parks. Learn about the park's history, explore the best trails, and discover the unique flora and fauna of each park. With 109 full-color photographs and detailed descriptions, this guidebook provides all the information you need to have a great outdoor experience.",
        "source": "https://m.media-amazon.com/images/I/91ywdatQJXL._AC_UY218_.jpg",
        "categories": [
            "Travel and Adventure"
        ],
        "price": 27.0,
        "platform": "Amazon",
        "purchaseUrl": "https://www.amazon.com/dp/0253025192"
    }
]