[
  {
    "title": "Create Beautiful Undersea Aquarium Art with Kids' Handmade Clay DIY Kit",
    "path": "https://shopee.sg/Children-Handmade-Creative-Art-Painting-Toys-Undersea-Aquarium-Clay-diy-Kindergarten-Work-Material-Package-i.419217874.22727080136",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-23020-sw3qk9aiaknvb0",
    "price": 551000,
    "location": "Mainland China",
    "rating": 3,
    "sold": 2,
    "description": "Give your kids an incredible creative experience with this Handmade Clay DIY Kit! This set includes all the materials they need to create a stunning Undersea Aquarium artwork. With step-by-step instructions, your children will learn art knowledge and gain a sense of accomplishment. Plus, it helps to exercise their hand-eye coordination and develop creative thinking. Buy your own coloring tools and let the creative journey begin!"
  },
  {
    "title": "Upgrade Your Kids' Creativity with HDY 3D Printing Pen!",
    "path": "https://shopee.sg/HDY-3D-Pen-Toys-Kids-Digital-Intelligent-3D-Printing-Pen-High-Temperature-DIY-Print-Drawing-Pens-Graffiti-with-Printing-Supplies-PLA-Filament-Painting-Doodle-Arts-Crafts-3D-Children-USB-Cable-Draw-Tool-Birthday-Gift-for-Boys-Girls-i.101833097.3154085499",
    "image": "https://down-sg.img.susercontent.com/file/37595321bcc5f87a93718ca60595b57e",
    "price": 399000,
    "location": "Mainland China",
    "rating": 4.602150537634409,
    "sold": 7,
    "description": "Unleash your kids' creativity with HDY 3D Printing Pen! This intelligent 3D printing pen is perfect for kids to create toys by themselves, which is very beneficial to develop their hands-on skills and mental development ability. It is made of high quality materials and with multiple colors, kids can draw whatever they image. It also features friendly filament to touch and speed control temperature adjustment. Buy now and get 3m filament (random color) and USB cable for free! Shop worry-free with us and get 100% authenticity guaranteed."
  },
  {
    "title": "50ml Simulation Cream Glue - Creative Material for DIY Phone Cases, Hairpins & More!",
    "path": "https://shopee.sg/50ml-Simulation-Cream-Glue-Childrens-Toys-Handmade-diy-Design-Material-Phone-Case-Hairpin-Frame-Surrounding-Beauty-Creative-Material-Childrens-Gift-i.915290312.22736439579",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd8-lf41kyz15dm72d",
    "price": 178000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 35,
    "description": "Our 50ml Simulation Cream Glue is perfect for making creative projects such as phone cases, hairpins, frames, and more! This material is made from resin and comes with a flower mouth. To use, simply squeeze the cream glue onto your project and let it dry naturally in a cool and ventilated place. After 24 hours, the coloring layer will be dry and the coloring thickness will take about 72 hours. Please note that this product is not edible and should be kept away from direct sunlight. All orders will be shipped within 1-2 days. If there is any damage to the goods received, please contact us immediately and we will arrange for re-sending or refund processing. Follow us to get exclusive coupons and discounts!"
  },
  {
    "title": "DIY Toy Book - Creative Quiet Book Decompression Toy Book with Cartoon Kuromi Melody for Kids",
    "path": "https://shopee.sg/DIY-Toy-Book-Childrens-Cartoon-kuromi-Melody-Creative-Quiet-Book-Decompression-Toy-Book-Semi-Finished-Product-Changing-Material-Package-i.477440506.23568018505",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfe-lguig96r9ahwf3",
    "price": 245000,
    "location": "Mainland China",
    "rating": 4.565217391304348,
    "sold": 77,
    "description": "Get creative with this DIY Toy Book! This kit includes drawings, cotton, double-sided tape, and transparent tape (scissors not included). With this kit, you can make your own unique Toy Book featuring the beloved cartoon character Kuromi Melody. Choose from mini size (6*7CM) or normal size (9*12CM). Get your creative juices flowing and make something special with this DIY Toy Book!"
  },
  {
    "title": "50 Sheets Shrink Film Kit - DIY Craft Ornaments Pendants Earrings Keychains Accessories",
    "path": "https://shopee.sg/Office50-Sheets-Shrink-Films-Kit-Shrinky-Art-Film-Paper-Heat-Shrink-Sheets-for-DIY-Craft-Ornaments-Pendants-Earrings-Keychains-Accessories-79-57-Inches-i.277026990.14225132535",
    "image": "https://down-sg.img.susercontent.com/file/4a279ff239c93018824a569f3f4aadb9",
    "price": 1589000,
    "location": "Mainland China",
    "rating": 4.7555555555555555,
    "sold": 43,
    "description": "Create beautiful DIY craft ornaments with this 50 sheet shrink film kit! Featuring 0.2mm thick heat-shrink sheets in a transparent or translucent color, these sheets measure 7.9 * 5.7 inches and are perfect for making pendants, keychains, earrings, necklaces, bookmarks and other accessories. Draw your favorite patterns on the sheet, cut it out with scissors and watch it shrink after heating. Unleash your imagination and have fun crafting your own unique pieces!"
  },
  {
    "title": "2000+ Piece DIY Arts and Crafts Supplies Kit - Educational Gift for School and Home Crafting Projects",
    "path": "https://shopee.sg/DIY-Arts-and-Crafts-Supplies-Kit-Set-Activity-Craft-Materials-with-Carrying-Box-Handmade-Educational-Gift-for-School-Kindergarten-Home-Craft-Art-Supplies-i.277026990.12506585451",
    "image": "https://down-sg.img.susercontent.com/file/e400ac8ca5f6aa8de3ec684069f7f5e5",
    "price": 1592000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 15,
    "description": "Unleash your creativity with this 2000+ piece DIY Arts and Crafts Supplies Kit! Perfect for classrooms or home projects, this kit includes wood sticks, cute eyes, pompoms, beads, paper, safety scissors, pipe cleaners, sequins, buttons, and a plastic carrying box. With this set, students can use their imagination to create unique artworks and express their creativity. Get yours today and start creating!"
  },
  {
    "title": "🇸🇬[SG Stock] Complete DIY Art Supplies for Kids - Folding Box Crafts Set for Home, Kindergarten and School Arts & Crafts ",
    "path": "https://shopee.sg/SG-Stock-Complete-DIY-Art-Supplies-for-Kids-All-in-One-Crafting-School-Kindergarten-Home-Arts-Set-Crafts-Folding-Box-i.650404568.16920786142",
    "image": "https://down-sg.img.susercontent.com/file/fb151ae7f8c4860c86e8ae04fce32341",
    "price": 1331000,
    "location": "SG",
    "rating": 4.833333333333333,
    "sold": 16,
    "description": "Unleash your creativity with this all-in-one DIY craft set! Perfect for kids to explore their imagination and develop innovative skills. With a range of materials such as clips, toy eyes, scissors, wooden sticks, feathers, and colored paper, this set is great for indoor activities and family time. No fixed template, let your imagination run wild and decorate as you like. Great for Christmas, birthday, and holiday gifts!"
  },
  {
    "title": "🔥High-Quality Mica Pigment Powder for Epoxy Resin DIY Art & Crafts Jewelry Nails Slime Dye",
    "path": "https://shopee.sg/SG-Mica-Pigment-Powder-High-Quality-Mica-Pigments-for-Epoxy-Resin-DIY-Art-Craft-Jewelry-Nails-Slime-Epoxy-Resin-Dye-i.267712007.19623311039",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134202-7qvex-lgm16g66chdxed",
    "price": 128000,
    "location": "SG",
    "rating": 4.951219512195122,
    "sold": 197,
    "description": ""
  },
  {
    "title": "Wooden Sensory Toys - Montessori Busy Board for Toddlers - Fine Motor Skills Travel Toy",
    "path": "https://shopee.sg/Montessori-Busy-Board-for-Toddlers-Wooden-Sensory-Toys-Toddler-Learning-Activities-for-Fine-Motor-Skills-Travel-Toy-Educational-Toys-for-Kids-i.410931893.11036111235",
    "image": "https://down-sg.img.susercontent.com/file/1b93805392baa87898fd79d2093ffdf3",
    "price": 519000,
    "location": "Mainland China",
    "rating": 4.894736842105263,
    "sold": 4,
    "description": "Help your little one learn essential dressing life skills with this Montessori Busy Board! Made of natural wood, this busy board is perfect for 1-2 year olds, encouraging precise movements and sensory exploration. It's also great for traveling, with no hard corners for added safety. Get your toddler their own educational toy today! Includes 1 Piece Busy Board (39x29.5x1.5cm/15.35x11.61x0.59inch)."
  },
  {
    "title": "DIY Handmade 3D Painting Decorative Mosaic Creative Ornaments Home Decorations Kids' Educational Art & Handicrafts Set",
    "path": "https://shopee.sg/diy-Handmade-Three-Dimensional-Painting-Decorative-Mosaic-Creative-Ornaments-Home-Decorations-Childrens-Educational-Material-Package-Art-And-Handicraft-Set-Work-Materials-i.419217874.13293083193",
    "image": "https://down-sg.img.susercontent.com/file/c02ff26c186a0ba3b9e1844b269c74b2",
    "price": 1620000,
    "location": "Mainland China",
    "rating": 4.3,
    "sold": 6,
    "description": "Create beautiful art and craft projects with this DIY Handmade 3D Painting Decorative Mosaic Creative Ornaments Home Decorations Kids' Educational Art & Handicraft Set! This set includes solid wood and glass materials, a 20x20cm white frame, and a special glue for patching and caulking. Get creative and start making unique decorations for your home!"
  },
  {
    "title": "DIY Handmade Material Bag Goo Bag Set - Perfect Children's Day Gift!",
    "path": "https://shopee.sg/Cheap-cream-glue-goo-card-big-set-hand-account-sticker-diy-handmade-material-bag-goo-bag-cheap-set-childrens-and-girls-toy-reward-gift-Childrens-Day-gift-i.915290312.22066341833",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvfk-lg3k0it2z6rqa0",
    "price": 1158000,
    "location": "Mainland China",
    "rating": 4.666666666666667,
    "sold": 9,
    "description": "Get this amazing DIY Handmade Material Bag Goo Bag Set, perfect for Children's Day gift! Comes with cream glue, goo card, big set, hand account sticker, and more. Available in pink and purple - default color is pink. All orders will be shipped within 1-2 days. If there is any damage to the goods received, please contact the store Xiaoer immediately for re-sending or refund processing. Follow this store to get coupons and more full discount coupons! Write a good review when you receive the goods and get a store coupon. Shop now!"
  },
  {
    "title": "26 Colors Epoxy Resin Pigment - Highly Concentrated Colorant for Resin Art, DIY Jewelry Making & Paint Crafts",
    "path": "https://shopee.sg/Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
    "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
    "price": 2148000,
    "location": "Mainland China",
    "rating": 4.851063829787234,
    "sold": 0,
    "description": "Get creative with our 26 Colors Epoxy Resin Pigment! Highly concentrated and easy to use, these epoxy resin colorants are perfect for resin art, DIY jewelry making, painting, and other crafts. Each bottle contains 10ml of non-toxic, cruelty-free pigment, for a total of 260ml of colorant. Mix the pigment with epoxy resin for the best color effect and no catalyst needed. Get started on your next project today!"
  },
  {
    "title": "Gupan Sticker Set Girl Children Stationery | 427-832 Pieces of Luxury Cards & Storage Box | DIY Gift Pack",
    "path": "https://shopee.sg/Guka-Sticker-Set-Girl-Children-Stationery-Gupan-Handbook-Material-Full-Handmade-diy-Gift-Pack-i.891301032.18668008086",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-zxl37tzqjskv60",
    "price": 4860000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 0,
    "description": "Welcome to our store! We offer a variety of exquisite handmade stationery sets for children, including the Guka Sticker Set. With 427-832 pieces of luxury cards and a three-layer storage box, this set is perfect for personal gifts or special occasions. Crafted with PPC material, this set is sure to bring a smile to your little one's face. Enjoy free shipping when you reach the marked free shipping threshold. Plus, if you have any after-sales questions, you can contact us at any time. Please note that due to the resolution of the computer screen, brightness, contrast, etc., the real color may be slightly different from the picture. Also, the product dimensions are all measured by hand, please allow 1-2CM difference. Buy yours today!"
  },
  {
    "title": "American Black Walnut Wood Square Plate DIY Material for Sculpting, Customization, and Crafts",
    "path": "https://shopee.sg/American-Black-Walnut-Wood-Raw-Wood-Square-Premium-DIY-Plate-Material-Handmade-Material-Sculpting-Materials-CustomizationWood-Block-wood-material-Carving-Wooden-DIY-craft-i.469283559.20447361480",
    "image": "https://down-sg.img.susercontent.com/file/e62accf73e521a793e75e58366369913",
    "price": 972000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Create unique sculptures, decorations, and crafts with this premium American Black Walnut Wood Square Plate DIY Material! This raw wood plate is perfect for customizing and sculpting, giving you the perfect material for your creative projects. With its durable and long-lasting quality, this wood plate is sure to be an essential addition to your crafting supplies."
  },
  {
    "title": "30pcs Retro Letter Sheet Material Paper for DIY Crafts, Junk Journal, Planner, Scrapbooking & More!",
    "path": "https://shopee.sg/30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
    "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
    "price": 210000,
    "location": "Mainland China",
    "rating": 4.833333333333333,
    "sold": 4,
    "description": "Add a touch of vintage charm to your DIY projects with these 30 pieces of letter sheet material paper! Perfect for decorating diaries, notebooks, planners, albums, letters, gift boxes, bottles, cups, scrapbooks, cellphones and more. Each sheet measures approximately 110 x 150mm. Get creative and start crafting today!"
  },
  {
    "title": "20 Pcsbox DIY Real Dried Flowers for Nail Art, Craft Making, and Jewellery Decoration",
    "path": "https://shopee.sg/20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
    "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
    "price": 350000,
    "location": "Mainland China",
    "rating": 4,
    "sold": 0,
    "description": "Create beautiful crafts with these 20 Pcsbox DIY Real Dried Flowers! Perfect for nail art, jewellery making, aromatherapy, epoxy handmade accessories, and more. Each flower is unique in size, shape, and color. Noted: Dried flowers can be put in glued, but not soaked in water. Add a natural touch to your crafts and decorations with these beautiful dried flowers!"
  },
  {
    "title": "2mm Thin Unfinished Basswood Sheet for Crafts, Model Building, Sand Table, and Decor",
    "path": "https://shopee.sg/2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
    "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
    "price": 658000,
    "location": "Mainland China",
    "rating": 4.666666666666667,
    "sold": 3,
    "description": "Create beautiful models and decorations with this 2mm thin unfinished basswood sheet! Perfect for model making, sand table scenery, diorama wargame scenes, and other painted model architecture scenery. Lightweight and durable, this basswood sheet is available in various sizes to suit your needs. Includes 5/10 pieces of basswood sheets. Colors may vary slightly due to individual monitor calibration. Please allow for slight measurement deviations due to manual measurements."
  },
  {
    "title": "30/60 Colors Dual Head Marker Pen Set | Kids Drawing & Art Supplies | Non-Toxic & Safe | Ideal for Coloring Pages, Sketching & Blending | Best Gift for Kids!",
    "path": "https://shopee.sg/2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
    "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
    "price": 910000,
    "location": "SG",
    "rating": 4.78125,
    "sold": 10,
    "description": "Get creative with this amazing 2-in-1 Dual Head Marker Pen Set! This 30/60 colors set is made of environmentally friendly and healthy raw materials, non-toxic and tasteless, and can be used with confidence. Suitable for primary school students and even college students who like to draw, this set provides a stylish and natural wood look for your toddler or older kids, making the color more interesting. Fast creativity and a great complement to the teen art and craft collection. Comes in a gift box to organize your coloring pencil series - the best gift for kids on birthdays and Christmas!"
  },
  {
    "title": "Resin Mixer - Handheld Electric Epoxy Stirrer for DIY Epoxy Resin Crafts Making",
    "path": "https://shopee.sg/Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
    "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
    "price": 521000,
    "location": "Mainland China",
    "rating": 4.833333333333333,
    "sold": 3,
    "description": "Create beautiful epoxy resin crafts with ease using this powerful handheld electric epoxy stirrer! With its 14,000 rpm motor, it quickly mixes epoxy resin for glitter tumblers with just the press of a button. The stainless steel shaft and spiral head are easy to clean and the ergonomic handle is comfortable to grip. Battery operated (batteries not included), this cordless mixer is stylishly designed in matte black with a shiny black stripe. Get your epoxy resin projects done quickly and easily with this handheld epoxy stirrer! Package includes 1 tool (batteries not included)."
  },
  {
    "title": "10g Mixed Color Soft Pottery Candy Pellets - DIY Resin Jewelry Crafts for Decoration, Accessories & Toys",
    "path": "https://shopee.sg/MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
    "price": 90000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 4,
    "description": "🎁 Create beautiful DIY jewelry, phone cases, and hair accessories with these 10g Mixed Color Soft Pottery Candy Pellets! Made with environmentally friendly resin, these pellets are perfect for crafting and making unique decorations. Please note that this product is not edible. We have all items in stock and will ship them out as soon as possible. If you have any questions, don't hesitate to reach out to us! We're here to help with any issues you may have. So go ahead and give these pellets a try - you won't be disappointed!"
  },
  {
    "title": "DIY Mosaic Vase Handmade Craft Kit - Wooden Mosaic Bottom, Mosaic Tiles, Mosaic Art Paste - Eco-Friendly Material Package, Home Decor, Personalized Gift Idea",
    "path": "https://shopee.sg/LEOTA-Handmade-Mosaic-Vase-Flower-Wooden-Mosaic-Bottom-DIY-Art-Decoration-Craft-Supplies-Material-Package-Mosaic-Art-Paste-Mosaic-Tiles-Creative-Craft-Kit-Parent-Child-Toys-i.455449081.22748936319",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd7-ljgel1dt8m2p3c",
    "price": 2589000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Create a unique and beautiful Mosaic Vase with this DIY Craft Kit! Featuring a wooden mosaic bottom, mosaic tiles, and mosaic art paste, this eco-friendly material package is perfect for home decor or as a personalized gift idea. Easy to make and simple to use, this Handmade Mosaic Vase Craft Kit is suitable for ages 7 and up (with parental supervision). Includes 1 base embryo, 1 simulation flower, and 1 set of material kit. Make your own unique Mosaic Vase and add a touch of beauty to your home decor!"
  },
  {
    "title": "8pcs Cone-Shaped Foams Trees Crafts - Perfect DIY Xmas Tree Materials for Kids",
    "path": "https://shopee.sg/8pcs-Cone-Shaped-Foams-Trees-Crafts-Cone-Crafts-Xmas-Tree-Materials-Christmas-Bag-Filler-Children-DIY-Supply-i.82435852.20166016031",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-c543amn3gjkva7",
    "price": 700000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Make your kid's DIY project extra special with these 8 cone-shaped foams trees crafts! Perfect for children activities in church, preschool, kindergarten, or at home. These foams are easy to paint, color, and glue, making them a great DIY project for all ages. Stimulate your child's imagination and creativity with this educational toy, and make your own unique Xmas trees! Includes 8 cone-shaped foams trees."
  },
  {
    "title": "26 Colours Epoxy Resin Pigment - Highly Concentrated Resin Colourant for Resin Art & DIY Crafts",
    "path": "https://shopee.sg/Yuykcei-Epoxy-Resin-Pigment-26-Colour-Epoxy-Resin-Dye-Highly-Concentrated-Epoxy-Resin-Colorant-for-Resin-Colour-Art-DIY-Jewelry-Making-Supplies-AB-Resin-Colouring-for-Paint-Crafts-10ml-Each-i.505358055.9087502143",
    "image": "https://down-sg.img.susercontent.com/file/c9d9092158e55d1d5e19c1495417dcad",
    "price": 2148000,
    "location": "Mainland China",
    "rating": 4.851063829787234,
    "sold": 0,
    "description": "Create stunning works of art with our 26 colour Epoxy Resin Pigment set! Highly concentrated and easy to use, these colours mix well with epoxy resin to create vibrant and unique pieces. Non-toxic and cruelty-free, this set is perfect for resin jewelry, crafts decorations, paint, garments and more. Each colour comes in a 10ml bottle with a specially designed nozzle for easy application. Get creative and unleash your inner artist today!"
  },
  {
    "title": "30 Pcs Retro Letter Sheet Material Paper for DIY Crafts, Junk Journals, Planner Scrapbooking and Vintage Decoration",
    "path": "https://shopee.sg/30-Pcs-Retro-Letter-Sheet-Material-Paper-Junk-Journal-Planner-Scrapbooking-Vintage-Decorative-Diy-Craft-Background-Paper-i.745674710.12887503723",
    "image": "https://down-sg.img.susercontent.com/file/07c86ca073a0ff2e9a5dddccbef05254",
    "price": 210000,
    "location": "Mainland China",
    "rating": 4.833333333333333,
    "sold": 4,
    "description": "Get creative with these 30 sheets of retro letter sheet material paper! Perfect for DIY crafts, junk journals, planner scrapbooking, and vintage decoration. Each sheet measures 110x150mm and is made of premium quality paper. Make your projects stand out with these stylish and unique decorative papers! Add a touch of vintage charm to your creations with these retro letter sheets."
  },
  {
    "title": "20 Pcsbox DIY Real Dried Flowers - Perfect for Nail Art, Craft Making, Jewellery & More!",
    "path": "https://shopee.sg/20-Pcsbox-DIY-Real-Dried-Flowers-For-Nail-Decoration-Art-Craft-Making-Jewellery-Simulation-Decoration-Holiday-Party-Supplies-i.792283377.20125241250",
    "image": "https://down-sg.img.susercontent.com/file/8881641c9b98a35c258dadbe3882e50c",
    "price": 350000,
    "location": "Mainland China",
    "rating": 4,
    "sold": 0,
    "description": "Add a touch of nature to your projects with this box of 20 real dried flowers! Perfect for DIY glass cover, nail art, handmade jewelry, aromatherapy epoxy and more. Each flower is unique with a different shape and size, adding a unique touch to your projects. Natural dried flowers are inevitably scattered, so please pay attention to the size, shape and color of each flower. Not for soaking in water. Get creative and add a natural touch to your projects!"
  },
  {
    "title": "DIY Cream Glue Gift Box Set - Creative Toys for Kids - Kindergarten Wholesale",
    "path": "https://shopee.sg/Cream-Glue-diy-Set-Gift-Box-Childrens-ins-Handmade-Material-Package-Creative-Toys-Kindergarten-Wholesale-i.915290312.21367114067",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-e8ge5tudp6jv05",
    "price": 1328000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 3,
    "description": "Get creative with this DIY Cream Glue Gift Box Set! Perfect for kids, this set includes all the materials needed to make unique and creative toys. With easy-to-follow instructions, you can make fun and imaginative creations in no time! Plus, this set is great for kindergarten classrooms and comes at a wholesale price. Buy now and start creating!"
  },
  {
    "title": "2mm Thin Basswood Sheets for DIY Sand Table Model Building Crafts Decor",
    "path": "https://shopee.sg/2mm-Thin-Basswood-Sheet-Unfinished-Wood-Piece-for-Crafts-Building-Model-DIY-Sand-Table-Materials-Decor-Board-model-making-scenery-diorama-wargame-scene-grass-painted-architecture-i.410931893.4996003202",
    "image": "https://down-sg.img.susercontent.com/file/04758ba7afde7603a86dda31ca33963d",
    "price": 658000,
    "location": "Mainland China",
    "rating": 4.666666666666667,
    "sold": 3,
    "description": "Create stunning model architecture scenes with these 2mm thin basswood sheets! Perfect for sand table models, diorama wargame scenes, and other painted model decorations, these lightweight sheets are made of durable basswood and come in a variety of sizes. Choose from 5/10 pieces of 50x200mm, 100x100mm, 100x200mm, 150x150mm, 200x200mm, and 200x450mm. Color may vary due to individual monitor calibration. Please allow for slight measurement deviations due to manual measurement."
  },
  {
    "title": "30/60 Colors Dual Head Marker Pen & Color Pencil Set for Kids - Art & Craft Materials for Children",
    "path": "https://shopee.sg/2-in-1-Dual-Head-Marker-Pen-Set-color-pencils-for-kids-Art-and-craft-materials-for-children-color-pencil-i.28159485.15929791660",
    "image": "https://down-sg.img.susercontent.com/file/edfada9b4d386a824c4a063f8970a586",
    "price": 910000,
    "location": "SG",
    "rating": 4.78125,
    "sold": 10,
    "description": "🔥 READY TO DISPATCH WITH 24 HRS - 30/60 Colors Kid Drawing Sets! 🔥 Made of environmentally friendly and healthy raw materials - non-toxic and tasteless with no harm to the body. 🔥 A wide range of uses - coloring pages, learning rainbow colors, idea development in office use, sketching, drawing, layering, blending, polishing, etc. 🔥 Suitable for primary school students and even college students who like to Draw. 🔥 Fast Creativity - Stylish and natural wood look for your toddler or older kids, making the color more interesting. 🔥 Satisfactory guarantee - Comes with a gift box to organize your coloring pencil series - the best gift for children on birthday and Christmas."
  },
  {
    "title": "Handheld Electric Epoxy Resin Mixer - 14000 RPM Motor for DIY Crafts Making",
    "path": "https://shopee.sg/Resin-MixerHandheld-Electric-Epoxy-Stirrer-Tool-for-DIY-Epoxy-Resin-Crafts-Making-tools-i.187101463.17159935516",
    "image": "https://down-sg.img.susercontent.com/file/c3efea06a89d4150382c348827cfc7e1",
    "price": 521000,
    "location": "Mainland China",
    "rating": 4.833333333333333,
    "sold": 3,
    "description": "Make your DIY epoxy resin projects easier with our powerful handheld electric epoxy stirrer. The high-speed 14000 RPM motor mixes epoxy resin quickly and efficiently, saving you time and effort. The stainless steel shaft and spiral head are easy to clean, and the ergonomic handle is comfortable to grip and hold. The mixer is powered by two AA batteries (not included) and has a simple one-touch switch for a powerful motor with low noise levels. Get your epoxy resin projects done faster with our stylish matte black and shiny black stripe epoxy mixer! Package includes 1pcs tool (Batteries not included)."
  },
  {
    "title": "Alphabet Learning Cognitive Matching Board Toy for Toddlers and Kindergarten Kids",
    "path": "https://shopee.sg/youn-Toddler-Puzzle-Alphabet-Learning-Cognitive-Matching-Board-Toy-Kindergarten-i.135054010.23839685932",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd3-lfqmin7pgnt800",
    "price": 3001000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "This Alphabet Learning Cognitive Matching Board Toy is perfect for toddlers and kindergarten kids to improve their basic fine motor skills. It features shape matching puzzle with cartoon pattern and shape matching alphabet pieces to stimulate toddler interests, encourage and improve early learning brain development, and exercise child hand & eye coordination. Made of qualified solid hard woods and transparent acrylic, it is well polished with round edges and no burrs, wear resistant, and non-toxic water printing for safe play. An awesome parent-child table game for funny activities. Product Dimension: approx. 26 x 26cm/10.23 x 10.23 inch, Net Weight: approx. 550g/1.21 lbs. Warning: The toy may contain small pieces and need to pay attention to the swallowed risk."
  },
  {
    "title": "B.B-Kids Water Drawing Mat with Magic Pens - Perfect Gift for Toddlers & Kids Ages 1-6",
    "path": "https://shopee.sg/BB-Kids-Toys-Water-Mat-Drawing-Painting-Toddler-Board-Magic-Pen-Childrens-Gift-i.51487338.1280564822",
    "image": "https://down-sg.img.susercontent.com/file/f1e5b14546f6d507286cbbc3460f61aa",
    "price": 400000,
    "location": "Mainland China",
    "rating": 4.7690582959641254,
    "sold": 13,
    "description": "Let your little ones explore their creativity with this B.B-Kids Water Drawing Mat! The set includes a large 45.5 x 29 cm mat and two magic pens that can be filled with water to draw colorful images that will slowly fade away. It's the perfect indoor toy for kids aged 1-6 and makes a great travel toy too! Get this Water Drawing Mat today and let your kids unleash their imagination!"
  },
  {
    "title": "10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories DIY Resin Jewelry",
    "path": "https://shopee.sg/MEET10g-Mixed-Color-Simulation-Soft-Pottery-Candy-Pellets-Cake-Decoration-Accessories-Jewelry-Toy-DIY-Resin-Handmade-Materials-i.767473829.22211632908",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22120-1uwhagug75kv4f",
    "price": 90000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 4,
    "description": "Make a unique statement with this 10g Mixed Color Simulation Soft Pottery Candy Pellets Cake Decoration Accessories DIY Resin Jewelry! Perfect for jewelry making, mobile phone case decoration, and hairpin DIY, this environmentally friendly resin is sure to make a great addition to your collection. All items are in stock and will be shipped out as soon as possible! Plus, if you have any questions or concerns, don't hesitate to chat us. So what are you waiting for? Get your DIY Resin Jewelry now and create something beautiful!"
  },
  {
    "title": "Educational TV Remote Control Toy for Toddlers - Numbers Cognition, Identify Colors, Hand-eye Coordination",
    "path": "https://shopee.sg/PLU-Simulated-Remote-Control-Light-Function-Sound-3-Languages-Number-Cognition-Identify-Colors-Hand-eye-Coordination-Baby-Toy-TV-Remote-Control-for-Toddler-i.134972817.22146244992",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qved-lho97zcfs12d68",
    "price": 644000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Get your little one started on the right path with this educational TV remote control toy! Featuring English, French and Spanish, interesting sound effects, and a lighting function, this toy is perfect for exercising children's grasping ability and facilitating cognitive development. Constructed of ABS material, this remote control toy is suitable for kids and requires 2 x AAA batteries (not included). Get it today and let the learning begin!"
  },
  {
    "title": "🌷32 Colors🌷DIY Handmade Craft Supplies - Chenille Stems, Pipe Cleaners, Bendable Wire Toys",
    "path": "https://shopee.sg/32-ColorsDIY-Colourful-Chenille-Stems-Pipe-Cleaners-Craft-Stems-Bendable-Wire-Toys-Handmade-DIY-Craft-Supplies-i.778855103.18065355611",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-22110-aup4su6mmekvae",
    "price": 571000,
    "location": "Mainland China",
    "rating": 4.545454545454546,
    "sold": 40,
    "description": "💕Welcome to ttsono online store💕 and experience the Happy Planet with our quality products and service! Get creative with our DIY Colourful Chenille Stems. Available in 32 colors, these craft stems are made of polyester wire and galvanized iron wire, measuring 0.6 * 30cm. Perfect for DIY projects, creative gifts, birthdays, daily surprises, blind boxes, decorations, and handmade crafts. Features rich and delicate fluff, high density, and is not easy to shed hair. Unleash your creativity and imagination with our bendable wires and create your own unique gifts! Includes 100pcs of DIY Colourful Chenille Stems."
  },
  {
    "title": "DIY Hand-Woven Coin Purse Kid Bag | Puzzle Felt Cloth Bag | Early Education Handmade Knitting Wallets | School Supplies",
    "path": "https://shopee.sg/DIY-Childrens-Hand-woven-Coin-Purse-Kid-Bag-Puzzle-Felt-Cloth-Bag-Early-Education-Handmade-knitting-Wallets-School-Supplies-i.561005339.15688249462",
    "image": "https://down-sg.img.susercontent.com/file/a64f68a1fc5a3ebd97a76a08360ad5f6",
    "price": 170000,
    "location": "Mainland China",
    "rating": 4.7272727272727275,
    "sold": 21,
    "description": "Get your hands on this amazing DIY Hand-Woven Coin Purse Kid Bag! This Puzzle Felt Cloth Bag is perfect for Early Education Handmade Knitting Wallets and School Supplies. It comes with a plastic needle, threads, a reference picture, double-side tape, cutting parts, and decorative parts. Get it now and enjoy a happy shopping experience! Shop with us and get ready stock, fast shipping, and quality control!"
  },
  {
    "title": "1 Set Kids Watercolor Painting Book - Pocket Water Color Painting Book for Kids Toddlers",
    "path": "https://shopee.sg/1-Set-Painting-Supplies-Kids-Pocket-Watercolor-Painting-Book-Pocket-Water-Color-Painting-Book-for-Kids-Toddler-uiransg-i.778792818.23450607516",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvd2-lk5co7dsc4hj13",
    "price": 945000,
    "location": "Mainland China",
    "rating": 0,
    "sold": 0,
    "description": "Get your kids creative juices flowing with this 1 Set of Kids Watercolor Painting Book! Made of safe and reliable material, this Watercolor Painting Book is perfect for teaching color recognition and promoting the use of fine motor skills and hand-eye coordination. With blank patterns, cartoon and lovely designs, your kids will have hours of fun with this painting book. A great gift for birthdays, Christmas, Children's Day, holidays and any other occasions, this Watercolor Painting Book is sure to bring endless joy and creativity to your little ones. Get yours today!"
  },
  {
    "title": "80G Crushed Glass Stones Resin Filling for DIY Epoxy Resin Crafts",
    "path": "https://shopee.sg/80G-Crushed-Glass-Stones-Resin-Filling-for-DIY-Epoxy-Resin-Silicone-Mold-Irregular-Broken-Stone-Nail-Art-Epoxy-Crafts-Filler-i.187101463.18311988156",
    "image": "https://down-sg.img.susercontent.com/file/c8ebcc81cac81dc787fc9c31af46cd37",
    "price": 502000,
    "location": "Mainland China",
    "rating": 4.708333333333333,
    "sold": 9,
    "description": "Create beautiful handmade crafts with this 80g pack of crushed glass stones! Perfect for DIY epoxy resin silicone molds, nail art epoxy crafts, and more. The stones come in an irregular, broken pattern and feature a variety of colors. Add a unique touch to any handmade craft with these crushed glass stones!"
  },
  {
    "title": "Create Model Yards with MDF Board",
    "path": "https://shopee.sg/Board-For-Making-Yard-MDF-Material-i.872832450.14893396673",
    "image": "https://down-sg.img.susercontent.com/file/470a032c0df9b21821071ae7ab20521e",
    "price": 486000,
    "location": "Vietnam",
    "rating": 0,
    "sold": 0,
    "description": "🎗️Product: MDF Board"
  },
  {
    "title": "Handmade Dried Flower Bookmark with Embossed Plant Specimen Transparent Sticker - DIY Material Package for Relieving Stuffy DIY Projects",
    "path": "https://shopee.sg/Bookmark-Homemade-by-Hand-Dried-Flower-Bookmark-DIY-Material-Package-Embossed-Plant-Specimen-Transparent-Sticker-Relieving-Stuffy-HandmadeDry-flower-handmade-DIY-bottle-self-made-plant-specimen-i.890128855.19578109794",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134201-7qvdx-lfdxrx5f50ajdb",
    "price": 478000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 3,
    "description": "Create unique and special bookmarks with this DIY material package! It includes dried flowers, embossed plant specimens, and transparent stickers to make your own handmade bookmark. Perfect for relieving stuffy DIY projects and adding a personal touch to your gifts."
  },
  {
    "title": "Precision Paper Cutter Craft Tool - Mohamm Art Sticker Washi Tape Cutter School Supplies",
    "path": "https://shopee.sg/Mohamm-Paper-Handaccount-Cutter-Cutting-Tool-Craft-Tools-Precision-Art-Sticker-Washi-Tape-Cutter-School-Supplies-i.147398485.7691292730",
    "image": "https://down-sg.img.susercontent.com/file/fb19c0d42935d2096f659ce52db74f6c",
    "price": 90000,
    "location": "Mainland China",
    "rating": 4.894308943089431,
    "sold": 45,
    "description": "Cut with precision and accuracy with this craft tool! Our Mohamm Art Sticker Washi Tape Cutter is made of durable PC material and is 15.8 cm long. Perfect for crafting projects, scrapbooking, and more! It features an ergonomic design for comfortable cutting and a sharp blade for clean cuts. Get yours today and start creating!"
  },
  {
    "title": "Create Unique Art with this Paint Your Own Mandala Stones Kit - Complete Starter Kit",
    "path": "https://shopee.sg/Paint-your-own-Mandala-stones-Kit-Complete-Starter-Kit-Children-art-craft-activity-kit-Creative-skills-i.54456685.10568183909",
    "image": "https://down-sg.img.susercontent.com/file/c6e563404843cbe83a92a965de82089a",
    "price": 2390000,
    "location": "SG",
    "rating": 0,
    "sold": 1,
    "description": "Unleash your creativity with this Paint Your Own Mandala Stones Kit, perfect for creating unique pieces of art that will wow friends and family. This complete starter kit includes 4 large rocks, 5 acrylic paints, 2 high-quality paint brushes, 5 dotting tools of varying thickness, and a 24-page book with step-by-step instructions and photography on how to create stunning pieces. **Paint could look dried up, kindly mix with few drops of water for a minute before using."
  },
  {
    "title": "Sakura Zentangle White Tile-Tool Set A | Arts & Crafts Drawing & Doodling",
    "path": "https://shopee.sg/Sakura-Zentangle-White-Tile-Tool-Set-A-Home-Stationery-Arts-Craft-Drawing-Doodling-i.190961827.5004938767",
    "image": "https://down-sg.img.susercontent.com/file/966aec3369f9b312a4079f58a64426a0",
    "price": 2214000,
    "location": "Malaysia",
    "rating": 5,
    "sold": 1,
    "description": "Create amazing art with the Sakura Zentangle White Tile-Tool Set A! This set includes a Pigma Micron 01 (Black), Pigma Micron 03 (Black), Pigma Micron 05 (Black), Pencil (Black), Tortillion, and 5 Zentangle Tiles (White) 89mmx89mm. It is easy to learn, relaxing and fun, and the ink dries quickly and does not bleed through the thinnest paper. Be sure to replace the cap tightly after use to prevent the ink from leaking, and take care when handling products with a sharp tip. Terms and conditions apply, please read carefully before purchase."
  },
  {
    "title": "500pcs Art & Craft Matchsticks DIY Wooden Sticks for Kindergarten Children",
    "path": "https://shopee.sg/Matchstick-Wooden-Sticks-Kindergarten-Children-Art-Craft-DIY-500pcspkt-i.27846050.3339489534",
    "image": "https://down-sg.img.susercontent.com/file/b7e8465f38324a58fbf8321b4825082e",
    "price": 450000,
    "location": "SG",
    "rating": 5,
    "sold": 3,
    "description": "Get creative with these 500pcs Art & Craft Matchsticks! Made from high-quality wood, these matchsticks are perfect for DIY projects, art and craft activities, and more. Suitable for children aged 3 and up, these matchsticks come in a convenient OPP Bag for easy storage and transport. Note: The quantity may vary slightly due to weight."
  },
  {
    "title": "50pcs Hollow Gear Laser Cut Wooden Craft Art Decor Embellishments",
    "path": "https://shopee.sg/50pcs-Mixed-Hollow-Gear-Laser-Cut-Wooden-Wood-Craft-Art-Decor-Embellishment-i.140625866.2476086884",
    "image": "https://down-sg.img.susercontent.com/file/6d9fab34db9faee1b6feb41fa5c1f3c5",
    "price": 323000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 1,
    "description": "Create beautiful decorations with these 50 pieces of laser cut wooden craft embellishments! Perfect for home wall hangings, wedding favors, gift tags, card making, scrapbooking, plaques and other art projects. Made from high quality wood, these pieces can be decorated with stains, inks, paint and more. Each piece measures approximately 0.98 - 1.97 inches. Get creative and start crafting!"
  },
  {
    "title": "Create Your Own Masterpiece with 20x20cm DIY Canvas Oil Painting By Numbers Art & Craft Set",
    "path": "https://shopee.sg/SG-Ready-Stock-20x20cm-NEW-DIY-Canvas-Oil-Painting-By-Numbers-Art-Craft-Children-Birthday-Goodies-Christmas-Gift-i.89705380.6771718002",
    "image": "https://down-sg.img.susercontent.com/file/sg-11134207-7qvfp-lfij0yrrx60rd0",
    "price": 399000,
    "location": "SG",
    "rating": 4.934065934065934,
    "sold": 23,
    "description": "Transform any space into a work of art with this 20x20cm DIY Canvas Oil Painting By Numbers Art & Craft Set! This set comes with a printed art canvas, a guided picture, a set of acrylic paints, a set of 2 nylon brushes, and 2 sets of screws and hooks. Perfect for children's birthdays, Christmas, or any other special occasion, this set is sure to bring out the artist in everyone. Note: Please allow +/- 1cm measuring deviation due to manual measurement. Colors may vary due to differences in monitor and display effect."
  },
  {
    "title": "150pcs Kids Art Set - Drawing and Painting Set - Crayons, Markers, Watercolors, Pencils",
    "path": "https://shopee.sg/SG-Seller-150-pcs-Art-Set-for-Kids-Drawing-and-Painting-Set-Craft-tool-Color-Crayons-Markers-Water-Color-Pencil-i.335595182.11257718177",
    "image": "https://down-sg.img.susercontent.com/file/7c3532b67ebafeaa04674b60185c6c94",
    "price": 900000,
    "location": "SG",
    "rating": 5,
    "sold": 3,
    "description": "Get creative with this 150-piece Kids Art Set! Perfect for children ages 3 and up, this set includes 24 color crayons, 36 color markers, 24 color oil pastels, 24 color pencils, 12 color powder pigments, 20 plastic paper clips, 1 ruler, 1 pencil, 1 rubber, 1 pencil sharpener, 1 plastic scissors, 1 pigment brush, 1 pigment tray, 1 glue, 1 white plastic, 1 stapler, and more. Everything you need to get your little artist started!"
  },
  {
    "title": "Fimo Slices for Slime & Nail Art Crafting Supplies",
    "path": "https://shopee.sg/Slime-Supplies-Fimo-Slices-Nail-Art-Craft-Supplies-i.236457540.7760268599",
    "image": "https://down-sg.img.susercontent.com/file/b7bc463e1ae293f115f054a59bf911ce",
    "price": 200000,
    "location": "SG",
    "rating": 5,
    "sold": 12,
    "description": "Get creative with our Fimo Slices! Each pack contains 25g of mystery mixed slices, perfect for slime and nail art crafting. Minimum order of $12 and get extra freebies! Start creating your masterpiece today!"
  },
  {
    "title": "[Local Seller] DIY Art Craft Supplies Set for Kids Toddlers - Create Fun Projects with Pipe Cleaners, Eyeballs & More!",
    "path": "https://shopee.sg/Local-Seller-DIY-Art-Craft-Sets-Supplies-For-Kids-Toddlers-Modern-Kid-Crafting-Supplies-Kits-Include-Pipe-Cleaners-Ey-i.431209658.15690648719",
    "image": "https://down-sg.img.susercontent.com/file/b294363247360418445183e9b4a706e1",
    "price": 1200000,
    "location": "SG",
    "rating": 0,
    "sold": 5,
    "description": "Get creative with this DIY Art Craft Supplies Set for kids and toddlers! This modern kid crafting supplies kit includes a variety of materials such as pipe cleaners, googly eyes, fur balls, sequins, buttons, wooden popsicle sticks, safety scissors and paper jam. Let your children explore their imaginations and develop their innovative abilities while having fun! The materials are easy to use and safe for your children. Get your set today and let your kids create amazing projects at home or school!"
  },
  {
    "title": "32pc Set Plastic Rod Paint Brushes - Acrylic, Oil & Watercolour Painting Tool",
    "path": "https://shopee.sg/32pcsSet-Plastic-Rod-Flat-Paint-Brushes-Acrylic-Oil-Watercolour-Painting-Tool-Craft-i.96459080.3341585229",
    "image": "https://down-sg.img.susercontent.com/file/e8c3cb8eac5321322d6e195e8abc8d9c",
    "price": 419000,
    "location": "Mainland China",
    "rating": 4.8977272727272725,
    "sold": 11,
    "description": "Get creative with this 32pc set of plastic rod paint brushes! Perfect for acrylic, oil and watercolour painting, these brushes are ideal for painting classes, training, games, parties, art, miniatures, scale models, face and body painting. Featuring synthetic nylon hair and a long service life, these brushes are easy to clean and convenient to carry. Get yours today!"
  },
  {
    "title": "30PCS Kids Paint Sponges - Early Learning Painting Brushes Stamps Foam Art Craft Drawing Tools for Toddlers & Kids",
    "path": "https://shopee.sg/SG-Seller-Kids-Paint-Sponges-Early-Learning-Kids-Toddlers-Point-Brushes-Stamps-foam-Art-Craft-Drawing-Tools-30PCS-G-i.255292169.13492148665",
    "image": "https://down-sg.img.susercontent.com/file/8b8e2bc279b80c3817eb4c569f7a3d21",
    "price": 579000,
    "location": "SG",
    "rating": 4.888888888888889,
    "sold": 2,
    "description": "Unleash your kids' creativity with this 30-piece kids paint set! Featuring different design paint sponges and rollers, this set is perfect for early learning and ideal for age 3+. The colorful sponges are easy to clean and operate, and the washable paint pad (sold separately) is perfect for mess-free fun. Get your kids started on their artistic journey with this 30-piece set!"
  },
  {
    "title": "🎁Educational Art n Craft Toy Set for Kids - Goodie Bag Gift for Children's Day - Stay Home Activity",
    "path": "https://shopee.sg/EVA-Foam-Art-n-Craft-Educational-toy-Kids-Goodie-Bag-Children-Day-Gift-Stay-home-Activity-i.8121841.4726607008",
    "image": "https://down-sg.img.susercontent.com/file/048da80087a7d04057a628eae52c664b",
    "price": 117000,
    "location": "SG",
    "rating": 4.902439024390244,
    "sold": 8,
    "description": "🤩Stock up on this educational art n craft set for kids - perfect for a goodie bag gift for Children's Day or a stay home activity! Includes 5 pieces of EVA foam (each measuring 18.5 x 2.6cm). Minimum purchase of 5 pieces or below 5 pieces if total purchase amount is more than $5 with other items from our shop (excluding shipping fee). PM us if you need lesser than that."
  },
  {
    "title": "Marie's Acrylic Colour Waterproof Paint - 50ml Arcylic Colors for Art Supplies, Stationery, Crafts & Student Projects",
    "path": "https://shopee.sg/NEW-ARVL-Maries-Acrylic-Colour-Waterproof-Paint-Arcylic-Colors-50ml-Cat-Arklirik-Art-Supplies-Stationery-Craft-Studen-i.550052911.21835085639",
    "image": "https://down-sg.img.susercontent.com/file/0403e0be6613a18d6c05502854e4cdd9",
    "price": 529000,
    "location": "Malaysia",
    "rating": 5,
    "sold": 0,
    "description": "Create stunning works of art with Marie's Acrylic Colour Waterproof Paint! This 50ml set contains 32 vibrant colors perfect for all types of painting. Perfect for paper, fabric, wood, metal and more, this set is ideal for art projects, stationery, crafts and student use. Get inspired and unleash your creativity with Marie's Acrylic Colour Waterproof Paint! Welcome to Colourhands Studio for all your canvas painting needs and more. Shop now and get creative!"
  },
  {
    "title": "Assorted Fimo Slices, Nail Art and Craft, Resin Art Supplies",
    "path": "https://shopee.sg/Slime-Supplies-Fimo-Slices-Nail-Art-and-Craft-Resin-Art-i.236457540.5962445965",
    "image": "https://down-sg.img.susercontent.com/file/cdc1397d62ebc0be2c6a5822a0bab45f",
    "price": 1200000,
    "location": "SG",
    "rating": 5,
    "sold": 1,
    "description": "Get creative with this selection of 25g of assorted Fimo slices, nail art and craft, and resin art supplies. Perfect for adding a unique touch to your projects!"
  },
  {
    "title": "12 Colors Acrylic Painting Pigment Paint Brush Set - Perfect for DIY Art Craft & Drawing",
    "path": "https://shopee.sg/JULA-12-Colors-Acrylic-Painting-Pigment-Paint-Brush-Set-DIY-Art-Craft-Drawing-Tool-i.129924052.2299263591",
    "image": "https://down-sg.img.susercontent.com/file/26abd496eae076a24efc1c24f8181f30",
    "price": 186000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 0,
    "description": "Get creative with this 12 Colors Acrylic Painting Pigment Paint Brush Set! Perfect for artwork, art projects, school projects, and more, this set includes a paintbrush and 12 colors of acrylic paint for you to express your imagination. Acrylics can be used on both smooth and textured surfaces, giving you more flexibility with your projects. The paintbrush is sent randomly. Ideal for parties, pubs, makeup, glow, and more, this skin-friendly, washable, and UV-resistant set is perfect for your next project!"
  },
  {
    "title": "Diamond Gem Art Craft Kit - Create Beautiful Mermaid, Unicorn, Dinosaur and Butterfly Artworks!",
    "path": "https://shopee.sg/Diamond-Gem-Art-Craft-Kit-i.14962.7715802818",
    "image": "https://down-sg.img.susercontent.com/file/a1b56a73e7a74f2f282b2fb999466791",
    "price": 800000,
    "location": "SG",
    "rating": 5,
    "sold": 0,
    "description": "Get creative with this Diamond Gem Art Craft Kit! Perfect for ages 5 and up, this fun and easy-to-use set includes a picture board, gems, tool, tray and wax to create a blinging masterpiece. Featuring 4 designs - Mermaid, Unicorn, Dinosaur and Butterfly - this kit is sure to provide hours of creative fun! Follow the easy number guide and create a beautiful artwork to show off!"
  },
  {
    "title": "Journamm 80pcs Vintage Paper for Phone Decoration | Craft Paper for Junk Journal, Scrapbooking & Labeling",
    "path": "https://shopee.sg/Journamm-80pcs-Cute-Vintage-Paper-for-Phone-Decoration-Stationery-Supplies-Craft-Paper-Junk-Journal-Label-Scrapbooking-Material-i.392853638.10605791396",
    "image": "https://down-sg.img.susercontent.com/file/34fa49ae93edc07f390135a564b591d2",
    "price": 200000,
    "location": "Mainland China",
    "rating": 5,
    "sold": 0,
    "description": "Get creative with Journamm's 80pcs of vintage paper! Perfect for phone decoration, crafting, junk journaling, labeling, and scrapbooking. Each paper measures 46*68mm and weighs 22g. Follow us to receive exclusive coupons and discounts. We strive to offer the best quality and most sincere service. Buy now and leave us a 5-star review if you're satisfied!"
  },
  {
    "title": "20pc Assorted Color Resin Flatback Cabochon Embellishments - Mermaid Tail, Shell, Starfish DIY Crafts",
    "path": "https://shopee.sg/20-Pieces-Lots-Mixed-DIY-Flatbacks-Resin-Flat-Back-Mermaid-tail-shell-starfish-Cabochon-Buttons-Scrapbooking-Slime-Charm-DIY-Embellishment-Craft-i.238364946.7834932100",
    "image": "https://down-sg.img.susercontent.com/file/e95d047c1daa851b1ca4a42392e8fa3c",
    "price": 376000,
    "location": "Mainland China",
    "rating": 4.947368421052632,
    "sold": 3,
    "description": "Create unique crafts with these 20pc Assorted Color Resin Flatback Cabochon Embellishments! Perfect for making all types of jewellery, decorations, phone cases, scrapbooking, card making, hair accessories, and other art & craft projects. Each package includes mermaid tails, shells, and stars in assorted colors, randomly picked from many different styles. Get creative and make something special today!"
  },
  {
    "title": "208pcs/set Crayola Masterworks Art Set - Coloring and Painting Supplies for Kids - Arts and Crafts Gift",
    "path": "https://shopee.sg/208pcssetCrayola-Masterworks-Art-color-penspencilmakerColoring-and-Painting-SuppliesArts-and-CraftsGift-for-Kids-i.140736052.5138395529",
    "image": "https://down-sg.img.susercontent.com/file/fd1dfc02a729b3a10ba89e207aaf8f60",
    "price": 3002000,
    "location": "Mainland China",
    "rating": 4.75,
    "sold": 0,
    "description": "Unleash your child's creativity with this 208-piece Crayola Masterworks Art Set! It includes crayons, colored pencils, and markers, all safe and nontoxic for kids ages 3 and up. The art case keeps supplies organized and protected for easy portability. Inspire creativity and encourage self-expression with this awesome arts and crafts set - the perfect birthday or holiday gift for any kid!"
  },
  {
    "title": "Colouring Crafts with Transparent Resin Dyes | Epoxy UV Resin | Art DIY",
    "path": "https://shopee.sg/Transparent-Resin-Dye-Pigment-Colouring-Epoxy-UV-Resin-Art-Craft-DIY-i.251530660.13773957493",
    "image": "https://down-sg.img.susercontent.com/file/1e2b08cc3bf77dc8894923abe9976eed",
    "price": 350000,
    "location": "SG",
    "rating": 4.818181818181818,
    "sold": 3,
    "description": "Craft your own unique creations with our Transparent Resin Dyes! All are translucent except for white, which can be used to turn your resin into a solid or pastel colour. Mix and match the dyes to create new colours! Each bottle is 6cm tall and contains approximately 10ml of dye. By purchasing from us, you're supporting small and local businesses. Please note that exchanges are only accepted within 14 days of purchase and only for unused products. Shipping for replacement items is covered by us, but buyer must cover shipping fee if item is used. Processing time for orders is 1-2 days."
  },
  {
    "title": "Assorted Craft Buttons - Multi Colours & Sizes - Perfect for Arts & Crafts Projects",
    "path": "https://shopee.sg/Ready-stock-craft-Buttons-Assorted-Sizes-Multicolours-Hobby-Crafts-Fun-Creative-Cute-Adorable-Patterns-Handicraft-i.121903432.14283124090",
    "image": "https://down-sg.img.susercontent.com/file/5ebd409547e552570c8550f32e9044eb",
    "price": 1000000,
    "location": "SG",
    "rating": 0,
    "sold": 0,
    "description": "Add a touch of creativity to your projects with our Assorted Craft Buttons! These fun and colourful buttons come in a variety of sizes and colours, perfect for any arts and crafts project. Whether you're making a dress, a card, a scrapbook or a friendship keepsake, these buttons are sure to make your project stand out! Choose from regular packs with sizes from 8mm to 25mm, big packs with sizes from 18mm to 30mm, large packs with sizes from 30mm to 40mm, printed multicolour 15mm and 30mm, star shape multicolour 10-19mm, flower shape multicolour 10-20mm, silver multi design and gold multi design. Customise your button craft for bonding workshop, children party or friendship keepsake - chat with us to find out more!"
  }
]
